{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP03_31",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP03/EP03_31.lua",
  "Text": "function EP03_31()\r\n    --.結-6【9月第4週】「美女と野獣」\r\n    SaveData.Title = \"美女と野獣\"\r\n\r\n    --//BG：大講堂正面（スポットライト無し）\r\n    LAYER_LOAD(LAYER_BG, \"BG020ba\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    MSG([[ I visited the great auditorium during Erika Ikusa and her group's performance time. ]])\r\n\r\n    MSG([[ As Erika Ikusa had said, on the front-row seat lay a handwritten paper with \"Uran Ryuguuin\" and my name written on it. ]])\r\n\r\n    MSG([[ I pocketed the paper, presumably written by Erika Ikusa herself, and took my seat. ]])\r\n\r\n    MSG([[ If I recall correctly, Erika Ikusa’s class was performing a play based on the Western fairy tale \"Beauty and the Beast.\" ]])\r\n\r\n    MSG([[ Although it’s a story I’ve loved since childhood and I was looking forward to it, the image of the man playing the Beast crossed my mind, making me feel uneasy. ]])\r\n\r\n    MSG([[ I understand Erika Ikusa’s intent. ]])\r\n\r\n    MSG([[ \"Beauty and the Beast\" is a love story in which a kind-hearted, brave woman named Belle connects with a Beast who was turned into a hideous form due to his weak heart. ]])\r\n\r\n    MSG([[ The Beast, who reforms and learns to respect others, ultimately finds true love. ]])\r\n\r\n    MSG([[ Through Belle, who initially shunned the Beast but gradually deepened her love as she understood his inner self, Erika Ikusa aims to seek understanding for coeducation. ]])\r\n\r\n    MSG([[ However, such a sermon won’t shake the hearts of the conservatives. ]])\r\n\r\n    MSG([[ No matter that Erika Ikusa won the Princess Election, they won’t change their ideology. ]])\r\n\r\n    MSG([[ Once this play ends, Erika Ikusa and I will be enemies again. But, for this moment alone, I want to purely enjoy the stage she has created. ]])\r\n\r\n    MSG([[ Surely Erika Ikusa has no ulterior motive; she must have invited me to this performance simply to entertain me. ]])\r\n\r\nPLAY_VOICE(\"erika_0901.wav\")\r\n    MSG([[\r\n【Erika】\r\n\"Everyone, thank you very much for waiting. We will now begin the stage presentation of 1-A and the boys’ division joint performance of the play ‘Beauty and the Beast.’\" ]])\r\n\r\n    --//BG：大講堂正面\r\n    LAYER_LOAD(LAYER_BG, \"BG020aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 300,true)\r\n\r\n    MSG([[ As Erika Ikusa finished her announcement, the lights on the stage illuminated. ]])\r\n\r\n    MSG([[ Then, a surprising casting choice appearing in the center of the stage caused murmurs of astonishment throughout the venue. ]])\r\n\r\n    STOP_BGM(1000)\r\n\r\n    --//CG：美女と野獣（オウガのみ）\r\n    LAYER_LOAD(LAYER_BG, \"EV019aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    PLAY_BGM(\"BGM06.wav\")\r\n\r\nPLAY_VOICE(\"erika_0902.wav\")\r\n    MSG([[\r\n【Erika】\r\n\"My beloved daughters, as I said before, I am going to the town. Is there anything you want?\" ]])\r\n\r\nPLAY_VOICE(\"erika_0903.wav\")\r\n    MSG([[\r\n【Erika】\r\n\"Come now, dear Belle. Tell me your wish, just as your elder sisters have.\" ]])\r\n\r\nPLAY_VOICE(\"erika_0904.wav\")\r\n    MSG([[\r\n【Erika】\r\n\"I want to give you a small gift to repay your usual devotion.\" ]])\r\n\r\nPLAY_VOICE(\"ogre_0241.wav\")\r\n    MSG([[\r\n【Ouga】\r\n\"Well then, Father, may I request a single rose?\" ]])\r\n\r\nPLAY_VOICE(\"ogre_0242.wav\")\r\n    MSG([[\r\n【Ouga】\r\n\"There isn’t a single rose bush around here, so I have longed for one. If it is placed on the dining table, it will surely add beautiful color to our meals starting tomorrow.\" ]])\r\n\r\nPLAY_VOICE(\"erika_0905.wav\")\r\n    MSG([[\r\n【Erika】\r\n\"Ah, what a humble wish. Leave it to me. I shall bring back not just one but an armful of roses.\" ]])\r\n\r\n    MSG([[ Saying so, Erika Ikusa, disguised as a middle-aged man, disappeared backstage. ]])\r\n\r\n    MSG([[ Belle, left behind, continued modestly wiping and sweeping while enduring sarcastic remarks from her sisters. ]])\r\n\r\n    MSG([[ Her appearance was a commoner’s Western-style dress, with some stains and patches visible here and there. ]])\r\n\r\n    MSG([[ Yet, with long hair reaching her waist, healthy and glossy skin, and long eyelashes, she clearly appeared more graceful compared to her sisters. ]])\r\n\r\n    MSG([[ Her looks perfectly matched the image of Belle I had imagined from the story I had read in the past. ]])\r\n\r\nPLAY_VOICE(\"uran_0257.wav\")\r\n    MSG([[\r\n【Uran】Surprised\r\n\"T-The one playing Belle is... no way, Ouga Rokujou!? That arrogant guy is cross-dressing and even changing his voice...!?\" ]])\r\n\r\n    MSG([[ It seems I was not the only one to notice, as the audience gradually began to stir. ]])\r\n\r\n    MSG([[ As the story progressed and the Beast made an appearance, the audience’s confusion deepened. ]])\r\n\r\n    --//CG：美女と野獣（野獣ヒユのみ）\r\n    LAYER_LOAD(LAYER_BG, \"EV019ab\")\r\n    SWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\nPLAY_VOICE(\"hiyu_0262.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n\"Hey, you! Not only do you stay at my mansion without permission, but you also try to steal the rose—which is more precious than my life—what an ungrateful wretch!\" ]])\r\n\r\nPLAY_VOICE(\"erika_0906.wav\")\r\n    MSG([[\r\n【Erika】\r\n\"Eek! A m-monster...!? P-please save me, please spare my life!\" ]])\r\n\r\nPLAY_VOICE(\"hiyu_0263.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n\"No way, I won’t forgive you. If you want my forgiveness, you must send me the one daughter you love the most within three months.\" ]])\r\n\r\nPLAY_VOICE(\"hiyu_0264.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n\"I was once called ‘the heartless one’ and turned into this Beast’s form.\" ]])\r\n\r\nPLAY_VOICE(\"hiyu_0265.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n\"I was told that if I reconsider my heart, I could return to my original form. But no one here in this mansion watches over my heart.\" ]])\r\n\r\nPLAY_VOICE(\"hiyu_0266.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n\"I need a wife who looks into my heart. I will never harm her. I swear to keep my promise to the very end and will not take your life either.\" ]])\r\n\r\nPLAY_VOICE(\"hiyu_0267.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n\"So you must keep your promise to me as well. Understood? Within three months, no exceptions.\" ]])\r\n\r\n    MSG([[ The shaggy beast pressing Erika Ikusa was none other than Hiyu Shinosaki. The face peeking out from the furry costume—unbelievably—was Hiyu. ]])\r\n\r\n    MSG([[ The very misogynistic Hiyu playing the role of the Beast, no less. ]])\r\n\r\n    MSG([[ Yet, his exaggerated gestures and running around the stage on all fours with beast-like movements carried a power that erased the fact that a girl was playing a man. ]])\r\n\r\n    MSG([[ Despite the odd casting of boys playing females and girls playing males, not a single discord arose. ]])\r\n\r\n    MSG([[ Initially, the audience was clearly confused, but soon everyone was absorbed, watching the characters on stage intently and following their story. ]])\r\n\r\n    MSG([[ Such a stage could only have been realized by Erika Ikusa. ]])\r\n\r\nPLAY_VOICE(\"uran_0258.wav\")\r\n    MSG([[\r\n【Uran】Sadness\r\n\"No... it’s not only Erika Ikusa.\" ]])\r\n\r\n    MSG([[ Yes. It is not only Erika Ikusa who is wonderful. ]])\r\n\r\n    MSG([[ To make this stage come to life, everyone involved must connect their hearts. ]])\r\n\r\n    MSG([[ I had heard from Yuri that there were conservative students even in Erika Ikusa’s class. ]])\r\n\r\n    MSG([[ Collaborating with the boys’ division to weave a single story must have involved unimaginable struggles. ]])\r\n\r\n    MSG([[ Perhaps this gender-reversed play was born incidentally amid those struggles. ]])\r\n\r\n    MSG([[ This play evokes various imaginations about its background. But at this moment, not a single performer on stage looks troubled. ]])\r\n\r\n    MSG([[ I feel all their hearts have become one. ]])\r\n\r\n    --//CG：美女と野獣（オウガ・野獣ヒユ）\r\n    LAYER_LOAD(LAYER_BG, \"EV019ac\")\r\n    SWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\nPLAY_VOICE(\"hiyu_0268.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n\"Belle! Why do you hate me!? I gave you magnificent dresses! Rich meals, beautiful roses, rooms filled with books!\" ]])\r\n\r\nPLAY_VOICE(\"hiyu_0269.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n\"I fulfilled all your wishes! I served you! What more do you want!? How can you love me!?\" ]])\r\n\r\nPLAY_VOICE(\"ogre_0243.wav\")\r\n    MSG([[\r\n【Ouga】\r\n\"I have never once told you my wishes. You only spoke of wanting me to look at you, but never once have you looked into my heart.\" ]])\r\n\r\nPLAY_VOICE(\"ogre_0244.wav\")\r\n    MSG([[\r\n【Ouga】\r\n\"Love is like a flower. You think that by giving water and fertilizer, the flower will grow—but that’s wrong.\" ]])\r\n\r\nPLAY_VOICE(\"ogre_0245.wav\")\r\n    MSG([[\r\n【Ouga】\r\n\"To nurture a flower, you need to touch the soil, look up at the sky, feel the air on your skin, and stay close beside the closed bud.\" ]])\r\n\r\nPLAY_VOICE(\"ogre_0246.wav\")\r\n    MSG([[\r\n【Ouga】\r\n\"<r=はなびら>Only looking at the petals</r>, the way you do now, you can never nurture love.\" ]])\r\n\r\nPLAY_VOICE(\"hiyu_0270.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n\"Belle!! You! Youuuu!\" ]])\r\n\r\n    MSG([[ The Beast’s roar echoed through the hall. That heart-wrenching misunderstanding made my chest feel as if it would be torn apart. ]])\r\n\r\n    MSG([[ When I was defeated in the recent Princess Election, I experienced the same feelings as the Beast now. ]])\r\n\r\n    MSG([[ As a representative of the conservatives, I poured my heart out preaching the importance of \"unchanging values.\" I believed everyone would understand. ]])\r\n\r\n    MSG([[ But... the result was defeat. My feelings did not reach them. ]])\r\n\r\n    MSG([[ The moment the election results came out, I felt a blazing hatred towards the coeducation faction flare deep in my chest. ]])\r\n\r\n    MSG([[ I thought myself narrow-minded, but that defeat was unbearably painful. ]])\r\n\r\n    MSG([[ But soon after, that flame began to calm. ]])\r\n\r\n    --//effect：セピア調\r\nFILTER_SCREEN(2)\r\n\r\n    --//BG：校舎前（昼）\r\n    LAYER_LOAD(LAYER_BG, \"BG011aa\")\r\n    --//BU：エリカ（笑顔）\r\n    LAYER_LOAD(50,\"BUL_ERI01ea\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000)\r\n\r\n    MSG([[ Without a single grudge or boastful victory proclamation, Erika Ikusa invited me to her play. ]])\r\n\r\n    MSG([[ Standing before her innocent smile, I realized why I was defeated. ]])\r\n\r\n    MSG([[ Her \"dance\" and mine were opposites. ]])\r\n\r\n    MSG([[ While I denied coeducation and tried to assert the correctness of my values, she accepted the conservatives' existence and conveyed the appeal of coeducation. ]])\r\n\r\n    MSG([[ Perhaps her imitating Hermes Himegami’s dance first was meant to express the unchanging status quo. ]])\r\n\r\nFILTER_SCREEN(0)\r\n    --//CG：美女と野獣（野獣ヒユ）\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(LAYER_BG, \"EV019ab\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_VOICE(\"hiyu_0271.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n\"Ah, my beloved Belle. Come back to me. Losing you, sinking again into the sea of loneliness, I finally understood.\" ]])\r\n\r\n    MSG([[ The scene shifted to the story’s climax. ]])\r\n\r\n    MSG([[ The Beast, learning that Belle's father collapsed from the worry of losing his daughter, gave Belle medicine and allowed her to return to her hometown. ]])\r\n\r\n    MSG([[ Though he said \"You need not return,\" the Beast’s heart still could not abandon his love for Belle and he lamented bitterly. ]])\r\n\r\n    MSG([[ His awkward stance was deeply moving. ]])\r\n\r\nPLAY_VOICE(\"hiyu_0272.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n\"You spoke many words to me out of love.\" ]])\r\n\r\nPLAY_VOICE(\"hiyu_0273.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n\"Love isn’t just about giving. It’s about taking hands, looking into each other’s eyes, and cherishing each other.\" ]])\r\n\r\nPLAY_VOICE(\"hiyu_0274.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n\"Until the day you forgive me and show me your beautiful form again, I pledge on this rose to love you forever, eternally.\" ]])\r\n\r\n    MSG([[ Like the Beast demanding love, I saw only the choice of maintaining the status quo. ]])\r\n\r\n    MSG([[ Erika Ikusa, viewing Yuriai Private Academy as a whole, affirmed the conservatives’ thoughts and worked hard to convey her own ideas. ]])\r\n\r\n    MSG([[ It’s obvious which side the students found more appealing. ]])\r\n\r\n    MSG([[ And the story finally reaches its conclusion— ]])\r\n\r\nPLAY_VOICE(\"ogre_0247.wav\")\r\n    MSG([[\r\n【Ouga】\r\n\"Ah, I apologize, my beloved Beast, Beato. Thanks to your medicine, my father was saved.\" ]])\r\n\r\n    MSG([[ In the dusty castle, Belle embraced the Beast’s body, now thin and losing fur. ]])\r\n\r\nPLAY_VOICE(\"ogre_0248.wav\")\r\n    MSG([[\r\n【Ouga】\r\n\"Yet, I left you alone, trapped in this cold mansion by yourself.\" ]])\r\n\r\nPLAY_VOICE(\"ogre_0249.wav\")\r\n    MSG([[\r\n【Ouga】\r\n\"Why did you not tell me that you would die if you remained in the Beast’s form? Had you told me, I would have given you all my little love.\" ]])\r\n\r\nPLAY_VOICE(\"hiyu_0275.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n\"You taught me that it’s not enough just to make the flower bloom.\" ]])\r\n\r\n    MSG([[ The Beast’s large hand gently wiped the tears streaming down Belle’s cheek. ]])\r\n\r\nPLAY_VOICE(\"hiyu_0276.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n\"I always imposed only my wishes, but at the end, I granted one wish of my beloved.\" ]])\r\n\r\nPLAY_VOICE(\"hiyu_0277.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n\"Now, smile for me. Smile, Belle. If I am seen off by your lovely smile, death is nothing to fear.\" ]])\r\n\r\nPLAY_VOICE(\"ogre_0250.wav\")\r\n    MSG([[\r\n【Ouga】\r\n\"No. You must not die.\" ]])\r\n\r\nPLAY_VOICE(\"ogre_0251.wav\")\r\n    MSG([[\r\n【Ouga】\r\n\"You must live forever as my husband. Please accept this love.\" ]])\r\n\r\n    MSG([[ Belle touched the Beast’s hand and softly kissed the back of it. ]])\r\n\r\n    MSG([[ At that moment— ]])\r\n    --//CG：美女と野獣（スモーク）\r\n    LAYER_LOAD(LAYER_BG, \"EV019ad\")\r\n    SWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\n    MSG([[ The stage was enveloped in pure white smoke. ]])\r\n\r\n    MSG([[ The ending that followed was classic. Surely, Hiyu Shinosaki returned to his original prince form and was united with Ouga Rokujou. ]])\r\n\r\n    MSG([[ As I eagerly awaited what costume Hiyu would change into, a figure gradually stepped forward out of the fading smoke. ]])\r\n\r\nPLAY_VOICE(\"uran_0259.wav\")\r\n    MSG([[\r\n【Uran】\r\n\"Eh—\" ]])\r\n\r\n    MSG([[ I lost my words the moment I realized the identity of that figure. Because— ]])\r\n\r\n    --//CG：美女と野獣（煙の中から男装エリカ）\r\n    LAYER_LOAD(LAYER_BG, \"EV019ae\")\r\n    SWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\nPLAY_VOICE(\"erika_0907.wav\")\r\n    MSG([[\r\n【Erika】\r\n\"My beloved Belle, thank you for loving me despite everything.\" ]])\r\n\r\n    MSG([[ Erika Ikusa, dressed in a lavish prince’s costume, was extending her hand to me. ]])\r\n\r\nPLAY_VOICE(\"uran_0260.wav\")\r\n    MSG([[\r\n【Uran】\r\n\"E-Erika Ikusa...? H-How...\" ]])\r\n\r\nPLAY_VOICE(\"erika_0908.wav\")\r\n    MSG([[\r\n【Erika】\r\n\"Thanks to you. With the power of your love, the witch’s spell was broken, and I was able to return to my original form.\" ]])\r\n\r\nPLAY_VOICE(\"erika_0909.wav\")\r\n    MSG([[\r\n【Erika】\r\n\"I want to repay this favor with a lifetime’s worth of love. Will you accept my love?\" ]])\r\n\r\nPLAY_VOICE(\"erika_0910.wav\")\r\n    MSG([[\r\n【Erika】\r\n\"If you accept it, take my hand and dance the waltz of love with me.\" ]])\r\n\r\n    MSG([[ Unable to grasp the sudden situation, I was stunned. ]])\r\n\r\n    MSG([[ But my hand naturally overlapped with Erika Ikusa’s, and led by her, I ascended the stage. ]])\r\n\r\n    --//SE：黄色い悲鳴\r\n--PLAY_SE(\"SEf008.wav\")\r\n\r\n    --//CG：美女と野獣（煙が晴れて、背景に全員集合）\r\n    LAYER_LOAD(LAYER_BG, \"EV019af\")\r\n    SWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\n    MSG([[ Cheers sounded in the distance. All of Erika Ikusa’s \"Knights\" and the boys’ division gathered on stage. Then, the pair dance began. ]])\r\n\r\n    MSG([[ With uncertain steps, I moved my arms and legs, trying to imitate Erika Ikusa. However, the movements were completely different from Japanese dance, and I couldn’t keep up. ]])\r\n\r\n    MSG([[ Erika Ikusa gently guided me by pulling my hands and feet as if leading me. ]])\r\n\r\n    MSG([[ That kindness touched my heart. The passion I had felt moments ago over the Princess Election results suddenly seemed pitiful. ]])\r\n\r\n    MSG([[ Unaware of my resentment, Erika Ikusa whispered softly. ]])\r\n\r\nPLAY_VOICE(\"erika_0911.wav\")\r\n    MSG([[\r\n【Erika】\r\n\"If not for the election against Uran Ryuguuin, I would never have understood the struggles of the conservatives and might have lived my school life so carefree.\" ]])\r\n\r\nPLAY_VOICE(\"erika_0912.wav\")\r\n    MSG([[\r\n【Erika】\r\n\"It’s thanks to competing with Uran Ryuguuin that we can all stand on stage laughing together like this now.\" ]])\r\n\r\nPLAY_VOICE(\"erika_0913.wav\")\r\n    MSG([[\r\n【Erika】\r\n\"That’s why... I really wanted Uran Ryuguuin to see this stage.\" ]])\r\n\r\nPLAY_VOICE(\"erika_0914.wav\")\r\n    MSG([[\r\n【Erika】\r\n\"I’m sorry for such a selfish wish.\" ]])\r\n\r\n    MSG([[ I almost sighed in disbelief. ]])\r\n\r\n    MSG([[ So kind as always. Since Erika Ikusa defeated me, it would be natural and her right to prove her justification to the loser. ]])\r\n\r\n    MSG([[ Even though I feel as if I might be consumed by the flames of jealousy at any moment. ]])\r\n\r\n    MSG([[ To cool the hot feelings inside me, tears began to trickle from my eyes. ]])\r\n\r\nPLAY_VOICE(\"erika_0915.wav\")\r\n    MSG([[\r\n【Erika】\r\n\"Uran, san...?\" ]])\r\n\r\nPLAY_VOICE(\"uran_0261.wav\")\r\n    MSG([[\r\n【Uran】\r\n\"Erika Ikusa... may I trust you? After trampling on your feelings, do I still have the right to love you again?\" ]])\r\n\r\n    MSG([[ Erika Ikusa gently hid my profile with her cloak, moving so the audience could not see my tearful face. ]])\r\n\r\n    MSG([[ Then, at an angle visible only to me, she smiled softly. ]])\r\n\r\nPLAY_VOICE(\"erika_0916.wav\")\r\n    MSG([[\r\n【Erika】\r\n\"Of course, my beloved Belle. No matter what hardships or misunderstandings arise, our love is eternal.\" ]])\r\n\r\nPLAY_VOICE(\"erika_0917.wav\")\r\n    MSG([[\r\n【Erika】\r\n\"So, smile for me. Just for now, I want to monopolize your delicate smile.\" ]])\r\n\r\n    MSG([[ I couldn’t help but laugh at Erika Ikusa’s theatrical and cheesy line. ]])\r\n\r\nPLAY_VOICE(\"uran_0262.wav\")\r\n    MSG([[\r\n【Uran】\r\n\"You’re quite a greedy Beast, aren’t you? Fine, it’s no problem. I will give you all of my face and love.\" ]])\r\n\r\nPLAY_VOICE(\"uran_0263.wav\")\r\n    MSG([[\r\n【Uran】\r\n\"Not just for now, but forever, always...\" ]])\r\n\r\n    MSG([[ I kept dancing with Erika Ikusa until the music ended. ]])\r\n    --//BGM：フェードアウト\r\nSTOP_BGM(3000)\r\n\r\n    --//BG：黒バック\r\n    PLAY_SE(\"SEa019.wav\",1000,true)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 2000,false)\r\n\r\n    --//SE：拍手\r\n--PLAY_SE(\"SEf008.wav\",0,true)\r\n\r\n    --//SE：歓声（MAX）\r\nPLAY_SE(\"SEa019.wav\",0,true)\r\n\r\n    MSG([[ As the stage lights went out, an applause louder than even the Princess Election announcement resounded. ]])\r\n\r\n    MSG([[ I had never heard such magnificent applause before. ]])\r\n\r\n    MSG([[ Surely it was a rare event in the over one hundred years of Yuriai Private Academy’s history. ]])\r\n\r\n    MSG([[ Thus, once again, I painfully realized that I could never compare to Erika Ikusa. ]])\r\n    --　　　　　◆\r\n    STOP_ALL_SOUND(1000)\r\n    --STOP_SE(\"SEa019.wav\",1000)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"EP03_32\")\r\nend\r\n"
}