{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP04_02",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP04/ERI/EP04_02.lua",
  "Text": "function ERI_EP04_02()\r\n    --.序章-2【11月第1週】「“伊草エリカ”の死んだ日」\r\n    SaveData.Title = \"“伊草エリカ”の死んだ日\"\r\n\r\n    --//BG：黒バッグ\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM06.wav\")\r\n\r\n    MSG([[I once practiced a method called \"lucid dreaming\" in which you maintain self-awareness within a dream, because I wanted to at least become my ideal self in my dreams.]])\r\n\r\n    MSG([[Because of that training, I often notice while dreaming that I'm actually dreaming.]])\r\n\r\n    MSG([[This time too, I was able to realize that I was dreaming.]])\r\n\r\n    MSG([[Moreover, in the dream, I was still being called \"Erika\" by those around me, and every time the school's test results came back, I was hailed as a \"prodigy\" or \"genius.\"]])\r\n\r\n    --//CI：思い出の写真 004\r\n\r\n    MSG([[It was a dream from my childhood, spent with Minato (Minachin) and Marika (Mariccho).]])\r\n\r\n    MSG([[But children who are called \"prodigies\" usually just have brains that develop slightly faster than others.]])\r\n\r\n    MSG([[Even if they are hailed at first, if they don't keep up their efforts, that advantage is quickly lost.]])\r\n\r\n    MSG([[They say \"a prodigy is just an ordinary person past twenty,\" but for me, it was even earlier. I was already just an ordinary person by the time I was ten.]])\r\n\r\n    --吉　後でイメージ背景にした方がよさそう\r\n\r\n    --//BU：モブ子ども×３\r\n    LAYER_LOAD(50,\"BU_MOB03aa\")\r\n    LAYER_LOAD(55,\"BU_MOB03aa\")\r\n    LAYER_LOAD(60,\"BU_MOB03aa\")\r\n    LAYER_POSITION(55,-600,0)\r\n    LAYER_POSITION(60,600,0)\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"undefined-a_0001.wav\")\r\n    MSG([[【Person A Whose Name I Can't Recall】 \"Hey, did you hear? Ikusa-san got below average again on the last test?\"]])\r\n\r\nPLAY_VOICE(\"undefined-b_0001.wav\")\r\n    MSG([[【Person B Whose Name I Can't Recall】 \"She's hopeless now. Everyone called her a genius, so she probably got full of herself.\"]])\r\n\r\nPLAY_VOICE(\"undefined-c_0001.wav\")\r\n    MSG([[【Person C Whose Name I Can't Recall】 \"Her eyes and attitude are sketchy too. Seriously, she's the worst.\"]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(55,\"\")\r\n    LAYER_LOAD(60,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[As my academic ability steadily declined, the teachers gave up on me, and my classmates mocked me so that I could hear on purpose, treating me like a pariah.]])\r\n\r\n    MSG([[A genius who has degenerated into a mere mortal becomes invisible. While a reformed delinquent might be praised, the treatment of a fallen genius is downright miserable.]])\r\n\r\n    MSG([[The daily mockery I endured in the classroom was more than enough to fill my ordinary heart with dreary emotions.]])\r\n\r\n    MSG([[Eventually, I couldn’t take it any longer and tried to confide my troubles to Mom and Dad. But the answers I got were completely off the mark—]])\r\n\r\n    --//BU：モブスーツ男性、モブ女性\r\n    LAYER_LOAD(50,\"BU_MOB14aa\")\r\n    LAYER_LOAD(55,\"BU_MOB02aa\")\r\n    LAYER_POSITION(50,-400,0)\r\n    LAYER_POSITION(55,400,0)\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"akira-mama_0001.wav\")\r\n    MSG([[【Mom】 \"It’s okay, Erika-chan. You are a genius after all.\"]])\r\n\r\nPLAY_VOICE(\"akira-papa_0001.wav\")\r\n    MSG([[【Dad】 \"That’s right~? You’re just a bit tired from studying right now.\"]])\r\n\r\nPLAY_VOICE(\"akira-mama_0002.wav\")\r\n    MSG([[【Mom】 \"It’s tough now, but you’ll surely be able to be like your cousin Marika-chan soon. Take your time and do your best.\"]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(55,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[They both said in unison things like \"Do your best,\" \"You can do it,\" \"You must aim to be like Marika,\" lecturing me.]])\r\n\r\n    MSG([[I had felt it vaguely before, but my parents gave me the name 'Erika' inspired by Marika—that was their Marika complex.]])\r\n\r\n    MSG([[If there was one great misfortune in my family, it was having Marika so close to us.]])\r\n\r\n    MSG([[Looking back now, no matter how much I struggled, I could never become such a perfect superhuman beauty. Being so close to her only made me chase after her back without fail.]])\r\n\r\n    MSG([[No matter how much I chased, I could never catch up. The more I chased, the more painfully aware I became of my own incompetence.]])\r\n\r\n    MSG([[Neither my parents nor I realized this until the very moment I broke down.]])\r\n\r\n    MSG([[That I was nothing special at all, just a plain \"Erika Ikusa.\"]])\r\n\r\n    MSG([[On my eleventh birthday, when Dad suggested I take the entrance exam for Yuriai Private Academy's much-competitive middle school division... I ran away from home.]])\r\n\r\n    MSG([[Because I could no longer endure being expected to do anything by anyone.]])\r\n\r\n    MSG([[I ran wildly, ran some more. I rested a bit and then started walking again. Walked and walked. Kept walking—]])\r\n\r\n    --//BG：公園\r\n    LAYER_LOAD(LAYER_BG, \"BG003aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    --//BU：幼い頃のミナト（通常）\r\n\r\n    MSG([[Before I knew it, I had ended up at the park near Minachin's and Mariccho's houses.]])\r\n\r\n    LAYER_LOAD(50,\"BU_CMI01aa\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"minato_0629.wav\")\r\n    MSG([[【Young Minato】Normal \"H-Huh? Erika-chan? Why are you here?\"]])\r\n\r\nPLAY_VOICE(\"minato_0630.wav\")\r\n    MSG([[【Minato】Normal \"Your home is far from this park, right?\"]])\r\n\r\nPLAY_VOICE(\"akira_0564.wav\")\r\n    MSG([[【Erika】 \"Not really. None of your business, okay? Leave me alone.\"]])\r\n\r\n    MSG([[The truth was, I was so happy to bump into Minachin by chance that I almost cried, but I held it back. Good job, young me.]])\r\n\r\n    MSG([[Maybe unconsciously, I had been trying to see Minachin. But I never wanted anyone, especially Minachin or Mariccho, to know that I was suffering from being compared to Mariccho.]])\r\n\r\n    MSG([[No matter how much I suffered because of Mariccho, I loved her. I wanted to avoid causing her pain because of my situation.]])\r\n\r\n    MSG([[Whether Minachin knew my feelings or not, he took an unexpected action. After we reunited, without saying anything or asking anything, and without tattling to parents, he just stayed by my side.]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\",1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    --//BG：公園（夕方）\r\n    LAYER_LOAD(LAYER_BG, \"BG003ba\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    MSG([[The sun was already setting. If Minachin stayed with me like this, he would surely get scolded too.]])\r\n\r\n    MSG([[I wanted to send Minachin home but couldn’t bring myself to start a topic, when Minachin said with a smile:]])\r\n\r\n    LAYER_LOAD(50,\"BU_CMI01ea\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"minato_0631.wav\")\r\n    MSG([[【Minato】Smile \"I won’t leave your side until you smile, Erika-chan.\"]])\r\n\r\nPLAY_VOICE(\"akira_0565.wav\")\r\n    MSG([[【Erika】 \"W-Why...? You don’t even know what’s going on. Why are you staying by my side without asking anything?\"]])\r\n\r\nPLAY_VOICE(\"erika_0966.wav\")\r\n    MSG([[【Erika】 \"If you stay like this, you’ll get scolded by Mom too, you know?\"]])\r\n\r\n    LAYER_LOAD(50,\"BU_CMI01aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"minato_0632.wav\")\r\n    MSG([[【Minato】Normal \"You did say you wanted to be left alone earlier, but you never said you wanted to be left by yourself, right?\"]])\r\n\r\nPLAY_VOICE(\"minato_0633.wav\")\r\n    MSG([[【Minato】Normal \"All I can do for you, Erika-chan, is stay by your side. So I absolutely won’t leave you.\"]])\r\n\r\n    LAYER_LOAD(50,\"BU_CMI01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"minato_0634.wav\")\r\n    MSG([[【Minato】Smile \"Because Erika-chan is someone important to me.\"]])\r\n\r\nPLAY_VOICE(\"akira_0566.wav\")\r\n    MSG([[【Erika】 \"Minachin...\"]])\r\n\r\nPLAY_VOICE(\"akira_0567.wav\")\r\n    MSG([[【Erika】 \"U... u...\"]])\r\n\r\nPLAY_VOICE(\"akira_0568.wav\")\r\n    MSG([[【Erika】 \"Uwaaaaaaahhh...\"]])\r\n\r\n    LAYER_LOAD(50,\"BU_CMI01da\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"minato_0635.wav\")\r\n    MSG([[【Minato】Sadness \"W-What’s wrong?! Erika-chan!?\"]])\r\n\r\n    MSG([[The moment I heard Minachin’s words, I collapsed into tears right there. Surely I had wanted to hear those words all this time.]])\r\n\r\n    MSG([[Not \"Do your best,\" nor \"You can do it,\" nor even \"prodigy.\"]])\r\n\r\n    MSG([[Just those simple words, \"someone important.\" That was enough to affirm who I was now.]])\r\n\r\nPLAY_VOICE(\"minato_0636.wav\")\r\n    MSG([[【Minato】Sadness \"Did I say something terrible? If so, I’m sorry.\"]])\r\n\r\nPLAY_VOICE(\"akira_0569.wav\")\r\n    MSG([[【Erika】 \"No... *sniff*... Minachin didn’t say anything wrong. Rather... thanks to you, I feel freed.\"]])\r\n\r\nPLAY_VOICE(\"akira_0570.wav\")\r\n    MSG([[【Erika】 \"I’m done being a good girl. In fact, I’m going to become the exact opposite, a bad girl.\"]])\r\n\r\nPLAY_VOICE(\"minato_0637.wav\")\r\n    MSG([[【Minato】Sadness \"Eh!? Why would you say that!? Erika-chan, what did I say to make you like that!?\"]])\r\n\r\nPLAY_VOICE(\"akira_0571.wav\")\r\n    MSG([[【Erika】 \"Please don’t call me Erika anymore.\"]])\r\n\r\nPLAY_VOICE(\"akira_0572.wav\")\r\n    MSG([[【Erika】 \"Yes, from now on I am the complete opposite of the Erika I was before. If I were to give a name... umm...\"]])\r\n\r\n    MSG([[Young me wrote out the alphabet spelling of \"Erika\" on the ground with my foot, working hard with my limited brain.]])\r\n\r\nPLAY_VOICE(\"akira_0573.wav\")\r\n    MSG([[【Erika, now Akira】 \"’ARIKA‘ spelled backward is ’AKIRA.’ Doesn’t that sound good? From now on, I will live as ’Akira Ikusa.’\"]])\r\n\r\nPLAY_VOICE(\"minato_0638.wav\")\r\n    MSG([[【Minato】Surprised \"Huh, Erika-chan? If it’s Erika, the first letter should be '<r=イー>E</r>', I think...\"]])\r\n\r\nPLAY_VOICE(\"akira_0574.wav\")\r\n    MSG([[【Akira】 \"Please don’t call me Erika. From this moment on, I am Akira.\"]])\r\n\r\nPLAY_VOICE(\"minato_0639.wav\")\r\n    MSG([[【Minato】Surprised \"S-sorry. Uh, uh... Akira?\"]])\r\n\r\nPLAY_VOICE(\"akira_0575.wav\")\r\n    MSG([[【Akira】 \"That’s fine, Minachin<sprite=\"Emoji\" name=\"note\">.\"]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\",1000,false)\r\n\r\n    MSG([[After that, once I achieved somewhat decent results on the middle school entrance exam, I began a life of withdrawal.]])\r\n\r\n    MSG([[To be better than others. To stand above others.]])\r\n\r\n    MSG([[Continuing to strive to be someone special started to feel pointless.]])\r\n\r\n    MSG([[Because there was someone who accepted me as I was without needing that.]])\r\n\r\n    MSG([[Minachin’s presence made me realize that I could be happy just by having him by my side.]])\r\n    --　　　　◆\r\n    --LAYER_LOAD(LAYER_BG, \"\")\r\n    --SWITCH_SCREEN(\"mask000\" , 1000)\r\n    SWITCH_SCREEN(\"mask000\",0,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    --//BG：アキラ宅（消灯）\r\n    LAYER_LOAD(LAYER_BG, \"BG023ba\")\r\n    SWITCH_SCREEN(\"mask011\" , 2000,false)\r\n\r\n    MSG([[When I woke up, I was on the sofa.]])\r\n\r\n    MSG([[Perhaps because I had such a nostalgic and soul-wrenching nightmare, my whole body was drenched in sweat.]])\r\n\r\n    MSG([[My eyes were wide awake too, so unless I showered right now, I wouldn’t be able to fall asleep, feeling gross.]])\r\n\r\n    MSG([[It had been a long time since I’d suffered such a terrible nightmare. Ever since Minachin and I started living together, I hadn’t dreamed like that at all. It was strange even to me.]])\r\n\r\nLAYER_LOAD_FACE(\"BU_AKI03aa\")\r\nPLAY_VOICE(\"akira_0576.wav\")\r\n    MSG([[【Akira】Normal, roomwear \"Huh? Come to think of it, I was supposed to have fallen asleep playing games, so why is this blanket—\"]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Looking around the room, I quickly figured out who had moved the blanket. Minachin was on the floor, wrapped in a towel blanket, peacefully breathing in sleep.]])\r\n\r\nLAYER_LOAD_FACE(\"BU_AKI03fc\")\r\nPLAY_VOICE(\"akira_0577.wav\")\r\n    MSG([[【Akira】Bitter smile, roomwear \"...He didn’t have to stay in the living room with me. What a clumsy person.\"]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I approached Minachin and poked his defenseless cheek with my finger.]])\r\n\r\nPLAY_VOICE(\"minato_0640.wav\")\r\n    MSG([[【Minato】 \"S-s-stop it... Akira...\"]])\r\n\r\nLAYER_LOAD_FACE(\"BU_AKI03ea\")\r\nPLAY_VOICE(\"akira_0578.wav\")\r\n    MSG([[【Akira】Smile, roomwear \"Minachin, even in my dreams you’re teasing me, huh?\"]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Well, I’m exactly teasing him right now in reality.]])\r\n\r\n    MSG([[Careful not to wake him, I covered Minachin again with the blanket and headed to the bathroom.]])\r\n\r\n    MSG([[Minachin’s core has never changed since long ago.]])\r\n\r\n    MSG([[Whenever I’m sad, he’s always by my side. He’d do anything to make me laugh. He accepts all of my faults.]])\r\n\r\n    MSG([[He’s the kindest and most gentle, endlessly good-natured, my precious person.]])\r\n\r\nLAYER_LOAD_FACE(\"BU_AKI03da\")\r\nPLAY_VOICE(\"akira_0579.wav\")\r\n    MSG([[【Akira】Sadness, roomwear \"But surely, to you, I am just one of many important people.\"]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Alone in the dark room, I murmured a question I knew would never be answered.]])\r\n\r\n    MSG([[To the grown-up Minachin, the weak me is no more than a chain weighing him down. Even though he knows it, he can’t leave. He desperately wants to stay by my side.]])\r\n\r\n    MSG([[If there is a \"special something\" inside me, it’s this feeling—that I love Minachin.]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    --　　　　　◆\r\nSTOP_BGM(1000)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"ERI_EP04_03\")\r\nend\r\n"
}