{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP05_21",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP05/ERU/EP05_21.lua",
  "Text": "function ERU_EP05_21()\r\n    -- .エピローグ「三人で進み出す」\r\n    SaveData.Title = \"三人で進み出す\"\r\n\r\nPLAY_BGM(\"BGM08.wav\")\r\n\r\n    -- //BG：駅前\r\n    LAYER_LOAD(LAYER_BG, \"BG002aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    MSG([[ Two years have passed since the Princess Election that saved Arumeria-san. ]])\r\n\r\n    MSG([[ I no longer needed to cross-dress, but I was walking through town in the guise of \"Erika Ikusa.\" ]])\r\n\r\n    MSG([[ The reason was the broadcast of the Princess Election from two years ago. ]])\r\n\r\n    MSG([[ Because of that broadcast, unbelievably, I was nicknamed \"real trap\" and \"the Bokuhime,\" and my real face spread across the internet. ]])\r\n\r\n    MSG([[ Especially the word \"Bokuhime\" spread like wildfire. ]])\r\n\r\n    MSG([[ Now, if I’m not cross-dressing, sightings of me quickly get posted on social media, making me a minor celebrity. ]])\r\n\r\n    MSG([[ Lira said, \"You'll get used to it eventually,\" but I didn’t feel that way at all. ]])\r\n\r\n    MSG([[ Even today, with important business, I came to the meeting place not as myself, but in cross-dress. ]])\r\n\r\nSTOP_BGM(1000)\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI03ca\")\r\nPLAY_VOICE(\"erika_2437.wav\")\r\n    MSG([[\r\n    【Erika】\r\n \"Huh――?\" ]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[ At that moment, a young man with short hair passed by beside me. ]])\r\n\r\n    MSG([[ Immediately, I turned back, touched his shoulder, and called out. ]])\r\n\r\nPLAY_BGM(\"BGM18.wav\")\r\n\r\n    -- //CG：エルメスＥＮＤ\r\n    LAYER_LOAD(LAYER_BG, \"EV044aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_VOICE(\"erika_2438.wav\")\r\n    MSG([[\r\n    【Erika】\r\n \"Don’t be mean on our first reunion in a year, Arumeria.\" ]])\r\n\r\nPLAY_VOICE(\"armeria_0224.wav\")\r\n    MSG([[\r\n    【Arumeria】\r\n \"Because I believed Minato would find me...\" ]])\r\n\r\n    MSG([[ Squinting her odd-colored eyes, Arumeria smiled. She’d cut her long hair short and dressed boyishly, looking so much like a man at first glance that it surprised me. ]])\r\n\r\n    MSG([[ No one around us, except me, would think she was the once-popular idol \"Hermes Himegami.\" ]])\r\n\r\n    MSG([[ In fact, passersby didn’t even glance at her. Though it’s been two years since her hiatus, it was a lonely reaction. ]])\r\n\r\n    MSG([[ Seeing my feelings, Arumeria pinched my nose. ]])\r\n\r\nPLAY_VOICE(\"armeria_0225.wav\")\r\n    MSG([[\r\n    【Arumeria】\r\n \"Looks don’t matter. Our songs are super popular overseas right now.\" ]])\r\n\r\nPLAY_VOICE(\"hermes_0612.wav\")\r\n    MSG([[\r\n    【Hermes】\r\n \"That’s right, that’s right<sprite=\"Emoji\" name=\"heart\"> We perform without showing our faces, so there’s tons of fan art~ <sprite=\"Emoji\" name=\"note\"> Hehehehe <sprite=\"Emoji\" name=\"heart\">\" ]])\r\n\r\nPLAY_VOICE(\"erika_2439.wav\")\r\n    MSG([[\r\n    【Erika】\r\n \"You’re really popular now, Ellie & Ally. I’m glad Hermes is having fun too.\" ]])\r\n\r\nPLAY_VOICE(\"armeria_0226.wav\")\r\n    MSG([[\r\n    【Arumeria】\r\n \"Hehe, actually with Nemesia Mother’s help, we’re teaming up with a fashion brand... Things are going to get even more fun from here!\" ]])\r\n\r\nPLAY_VOICE(\"hermes_0613.wav\")\r\n    MSG([[\r\n    【Hermes】\r\n \"And our manager Daria-chan has to work even harder too<sprite=\"Emoji\" name=\"heart\">\" ]])\r\n\r\n    MSG([[ Right now, Hermes and Arumeria support one body with two hearts. They share every hardship and keep going together. ]])\r\n\r\n    MSG([[ Perhaps as a result, their vocal unit's song \"Ellie & Ally\" became a massive hit online. ]])\r\n\r\n    MSG([[ Without showing their faces and purely through their singing, their debut album became so popular it hit the US Billboard charts. ]])\r\n\r\n    MSG([[ Finally, they prepared to return triumphantly to Japan, allowing us to promise this reunion... That sums up the past two years. ]])\r\n\r\n    MSG([[ Though they lost the title of national idol \"Hermes Himegami,\" their charm has clearly reached many people. ]])\r\n\r\nPLAY_VOICE(\"armeria_0227.wav\")\r\n    MSG([[\r\n    【Arumeria】\r\n \"Even so... something feels strange.\" ]])\r\n\r\nPLAY_VOICE(\"erika_2440.wav\")\r\n    MSG([[\r\n    【Erika】\r\n \"What is it?\" ]])\r\n\r\nPLAY_VOICE(\"armeria_0228.wav\")\r\n    MSG([[\r\n    【Arumeria】\r\n \"Because Minato is disguised, and we’re showing our true faces. Our roles are reversed from two years ago.\" ]])\r\n\r\n    MSG([[ Indeed, compared to our date in this town two years ago, the positions have switched. ]])\r\n\r\n    MSG([[ The flow of time is merciless. The streets and trends are vastly different than two years ago. ]])\r\n\r\n    MSG([[ But my feelings have not changed since then... no, since I was a child. ]])\r\n\r\nPLAY_VOICE(\"erika_2441.wav\")\r\n    MSG([[\r\n    【Erika】\r\n \"No matter what we look like. The two I love dearly are right here in front of me now.\" ]])\r\n\r\n    MSG([[ The \"her\" gently clasped my hand, just as she has since two years ago. ]])\r\n\r\nPLAY_VOICE(\"armeria_0229.wav\")\r\n    MSG([[ \"...Yeah. I love you too, Minato.\" ]])\r\n    -- //ここだけ、どちらのセリフかわからないように名前指定無しで\r\n\r\n    MSG([[ And the three of us began to walk together. ]])\r\n\r\n    MSG([[ So we won’t ever be apart again. ]])\r\n\r\n    MSG([[ So we can continue to support each other forever. ]])\r\n\r\n    MSG([[ So no one has to suffer through doubts alone. ]])\r\n\r\n    -- 31\tボク姫様と乙女主義\tやっと、肩を並べることができた\r\n    UNLOCK_TROPHY(31)\r\n\r\n    -- 　　　　◆\r\nSTOP_BGM(10000)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 10000,false)\r\n\r\n    -- システムセーブデータTrueエンドクリア\r\n    SystemSaveData.IsClearTrue = true;\r\n    SystemSaveData.IsClearERU = true;\r\n\r\n    -- ゲームクリア\r\n    GAME_CLEAR()\r\n\r\n    ScenarioManager.Next(\"\")\r\nend\r\n"
}