{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP01_05",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP01/EP01_05.lua",
  "Text": "function EP01_05()\r\n    -- .承-2「疑惑と焦燥」\r\n    SaveData.Title = \"疑惑と焦燥\"\r\n\r\n    -- //BG：病室\r\n    LAYER_LOAD(LAYER_BG, \"BG009aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM09.wav\",0)\r\n\r\n    MSG([[Waking up from a nostalgic dream, the unchanging reality spread before me. A hospital room with walls and floor pure white, clean and sterile. The scent of disinfectant alcohol mixed with a faint floral aroma.\r\n懐かしい夢から目覚めると、変わらぬ現実が広がっていた。 壁も床も真っ白な清潔感のある病室。殺菌用のアルコールと、ほのかな花の微香。]])\r\n\r\n    -- //CI：眠り続けるマリカ。 005\r\nLAYER_LOAD(50,\"CI005a\")\r\nLAYER_POSITION(50,0,-200)\r\nLAYER_MOVE_POSITION(50,0,0,500,Ease.OutSine)\r\nSWITCH_SCREEN(\"mask000\",500,false)\r\n\r\n    MSG([[And there, my sister Marika still asleep in the bed.\r\nそして、ベッドで眠り続けるマリカ姉さん。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03da\")\r\nPLAY_VOICE(\"minato_0059.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, sadness \"...So this really is happening in reality.\"\r\n「……やっぱり、現実の出来事なんだね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nLAYER_LOAD(50,\"\")\r\nSWITCH_SCREEN(\"mask000\",500,false)\r\n\r\n    MSG([[It seems I must have fallen asleep while nursing her. I hadn’t noticed because I was so focused on caring for her, but come to think of it, I hadn’t slept for over a whole day.\r\nどうやら看病を続けている内に眠ってしまったらしい。 看病に夢中で気付かなかったものの、そう言えば、丸一日以上も寝ていなかった。]])\r\n\r\n    MSG([[...No, the more accurate way to say it is that I didn’t have the peace of mind to sleep.\r\n……いや、寝ている心の余裕がなかった、というのが正しいと思う。]])\r\n\r\n    MSG([[It’s been a whole day since I was contacted at the hamburger place. The doctor and my mother explained everything, but I still can’t believe it.\r\nハンバーガー屋で連絡を受けてから丸一日。 主治医の先生や母さんから説明を受けたけれど、未だに信じられない。]])\r\n\r\n    MSG([[To think my sister looks so healthy, with skin and complexion so vibrant, yet there’s a possibility she may never wake up again.\r\nこんなにも元気そうで、肌の色も、ツヤもいい姉さんが、もう二度と目覚めない可能性があるだなんて。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03da\")\r\nPLAY_VOICE(\"minato_0060.wav\")\r\n    MSG([[\r\n【Minato】\r\nSadness \"What happened to my sister at Yuriai Private Academy...?\"\r\n「百合愛学園で、姉さんの身に何があったっていうの……？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[The doctor and mother’s exchange from yesterday is still etched in my mind.\r\n昨日の主治医の先生と母さんのやり取りは、今でも脳裏に焼きついている。]])\r\n\r\n    -- //effect：セピア加工\r\nFILTER_SCREEN(2)\r\nSWITCH_SCREEN(\"mask009\" , 1000)\r\n\r\n    -- //BU：モブ医者、モブ女性\r\n    LAYER_LOAD(50,\"BU_MOB02aa\")\r\n    LAYER_POSITION(50,-400,0)\r\n    LAYER_LOAD(55,\"BU_MOB14aa\")\r\n    LAYER_POSITION(55,400,0)\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"mother_0001.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"Heidoin-kun, no need to hold back. Please tell us quickly about Marika’s condition.\"\r\n「<r=びょうどういん>平等院</r>くん、遠慮は無用よ。早くマリカの容態について教えて」]])\r\n\r\nPLAY_VOICE(\"doctor_0001.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"Is this alright with your child present? I can come back another day if you prefer.\"\r\n「お子さんの前ですが、よろしいのですか？　よければ、日を改めることもできますが」]])\r\n\r\nPLAY_VOICE(\"mother_0002.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"You know I hate delays, don’t you? Minato’s old enough to know the truth.\"\r\n「結論の先延ばしが嫌いなこと、よく知っているでしょう？　ミナトだってもう義務教育は終えた年齢よ、知っておくべきだわ」]])\r\n\r\nPLAY_VOICE(\"doctor_0002.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"...Understood. Then I’ll be direct.\"\r\n「……わかりました。ならば率直に申し上げます」]])\r\n\r\nPLAY_VOICE(\"doctor_0003.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"All injuries suffered when she was brought from Yuriai Private Academy three nights ago have been fully treated.\"\r\n「三日前の深夜に、私立百合愛学園から運ばれてきた際の外傷はすべて治療が完了しました」]])\r\n\r\nPLAY_VOICE(\"doctor_0004.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"We must observe until the head wound fully heals, but she’s already in a state where waking up at any moment wouldn’t be surprising.\"\r\n「頭部の傷が塞がるまで、様子を診なければなりませんが、既にいつ目覚めても不思議はない状態です」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ea\")\r\nPLAY_VOICE(\"minato_0061.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, smile \"R-Really!? So Marika-neesan will wake up soon!\"\r\n「ほ、本当ですか！？　じゃあマリカ姉さんは、じきに目覚めるんですね！」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"mother_0003.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"Calm down. Don’t give vague answers just because a child’s here, Heidoin-kun. Are you really a doctor?\"\r\n「落ち着きなさい。子どもの前だからって曖昧な説明はやめて、平等院くん。アナタ、それでも医者なの？」]])\r\n\r\nPLAY_VOICE(\"mother_0004.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"Will Marika wake up? Or not? Just tell us the conclusion.\"\r\n「マリカは目覚めるの？　目覚めないの？　結論を教えて」]])\r\n\r\nPLAY_VOICE(\"doctor_0005.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"I’m sorry... but honestly, I cannot say anything definite.\"\r\n「心苦しいのですが……ハッキリとしたことは申し上げられないのが正直なところです」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ca\")\r\nPLAY_VOICE(\"minato_0062.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, surprise \"...Huh?\"\r\n「……え？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ca\")\r\nPLAY_VOICE(\"minato_0063.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, surprise \"The treatment is complete, right...? Th-then why can’t you say for sure?\"\r\n「治療は、完了したんですよね……？　ど、どうして断言できないんですか？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"doctor_0006.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"Yes, the treatment is done. She doesn’t even need a respirator; physically, there’s no reason she shouldn’t wake up any time.\"\r\n「ええ、治療は完了しました。人工呼吸器すら必要がなく、身体的にはいつ目覚めても不思議ではない状態です」]])\r\n\r\nPLAY_VOICE(\"doctor_0007.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"Yet the coma continues. This symptom has no precedent. Even among our medical team, opinions differ as we try to determine the cause.\"\r\n「にも関わらず、未だに昏睡状態が続いている。これは過去に例のない症状です。私たち医療チームの間でも意見が分かれており、原因の究明に努めています」]])\r\n\r\nPLAY_VOICE(\"mother_0005.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"That’s frustrating. In other words, for some unknown reason, she just won’t wake up no matter how long it takes, right?\"\r\n「まどろっこしいわね。つまり、何故かはわからないけれど、いつまで経っても目覚めないってことでしょ？」]])\r\n\r\nPLAY_VOICE(\"doctor_0008.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"Exactly... I can’t predict when she’ll wake up.\"\r\n「おっしゃる通り……いつ目覚めるかについては断言できかねます」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03da\")\r\nPLAY_VOICE(\"minato_0064.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, sadness \"S-So what will happen to Marika-neesan...? Will she just sleep forever like this!?\"\r\n「そ、それじゃあマリカ姉さんはどうなるんですか……！？　このまま、ずっと眠ったままなんですか！？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"doctor_0009.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"Unfortunately, at this point, we really don’t know... Physically she is fine, so we want to continue observing her progress.\"\r\n「残念ながら、現時点では何とも……。身体的には何ら問題は見られませんので、しばらく経過を診ていきたいと考えています」]])\r\n\r\nPLAY_VOICE(\"mother_0006.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"Observing progress... I can’t hope for much. I’m preparing for her to enter a ‘vegetative state’ without recovering.\"\r\n「経過を診る、ね……期待できないわ。このまま回復せずに、『植物状態』に陥ることも覚悟しておくわ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ga\")\r\nPLAY_VOICE(\"minato_0065.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, panic \"A vegetative state...!? Marika-neesan...!?\"\r\n「しょ、植物状態……！？　マリカ姉さんが……！？」]])\r\n\r\nPLAY_VOICE(\"minato_0066.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, panic \"Isn’t there anything that can be done!? Isn’t there anything I can do to help Marika-neesan!?\"\r\n「どうにもならないんですか！？　マリカ姉さんのために、ボクにできることはないんですか！？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"doctor_0010.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \".........\"\r\n「…………」]])\r\n\r\nPLAY_VOICE(\"mother_0007.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"Stay away from the doctor, Minato. Sorry. He gets too fired up when it comes to Marika.\"\r\n「先生から離れなさい、ミナト。ごめんなさいね。その子、マリカのことになると熱くなりすぎるのよ」]])\r\n\r\nPLAY_VOICE(\"doctor_0011.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"No... confusion is only natural. Our medical team is doing everything we can for Marika’s recovery.\"\r\n「いえ……混乱するのも当然でしょう。私たち医療チームも、マリカさんの回復のために最善を尽くす心づもりです」]])\r\n\r\nPLAY_VOICE(\"doctor_0012.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"Going forward, you can choose either home care or continued hospitalization here.\"\r\n「今後の治療では、自宅療養と当院での入院、二つから選択いただけます」]])\r\n\r\nPLAY_VOICE(\"doctor_0013.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"Home care costs less, and you can monitor her condition anytime, so that’s reassuring.\"\r\n「自宅療養では入院費用がかからず、自宅でいつでも容態を確認いただけるので安心でしょう」]])\r\n\r\nPLAY_VOICE(\"doctor_0014.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"However, Marika’s symptoms are rare, so unexpected complications may arise. Home care carries the risk of delayed response to emergencies.\"\r\n「ただマリカさんの場合、過去に例の少ない症状ですので、不測の事態が起こりかねません。自宅療養では、有事の際の対応が遅れてしまうというリスクがあります」]])\r\n\r\nPLAY_VOICE(\"doctor_0015.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"Hospitalization fees here are the biggest concern. If you choose hospitalization, we will cover part of the costs not covered by insurance.\"\r\n「当院での入院の場合、入院費用が最大の懸念点でしょう。もし入院を希望されるのでしたら、保険の適用外の費用については一部を当院で負担いたしましょう」]])\r\n\r\nPLAY_VOICE(\"mother_0008.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"Covering long-term hospitalization fees? That’s awfully kind. Feels like they want us to pick hospitalization.\"\r\n「長期入院の費用を負担する？　やけに親切なのね。まるで、入院を選んでもらわなきゃ都合が悪いみたいじゃない」]])\r\n\r\nPLAY_VOICE(\"mother_0009.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"I wonder where those instructions came from.\"\r\n「一体、どこからの指示なのかしらね」]])\r\n\r\nPLAY_VOICE(\"doctor_0016.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"...No hidden motives. We simply intend to continue positive treatment to help Marika wake.\"\r\n「……他意はありません。私たちもマリカさんが目覚められるよう、前向きな治療を続ける方針だというだけです」]])\r\n\r\nPLAY_VOICE(\"mother_0010.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"...Fine. We can’t afford home care anyway. If they cover the costs, then hospitalization it is.\"\r\n「……まぁいいわ。どうせウチには、自宅療養を続ける余裕はないもの。費用面の問題さえ解決してもらえるなら、入院を希望するわ」]])\r\n\r\nPLAY_VOICE(\"doctor_0017.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"Then we’ll handle the details another time.\"\r\n「では、細かな手続きはまた後日に」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ba\")\r\nPLAY_VOICE(\"minato_0067.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, serious \"P-Please tell me... What happened to Marika-neesan? What was she doing at school so late at night!? Who took her to the hospital!?\"\r\n「お、教えてください……マリカ姉さんの身に、何が起きたんですか？一体、深夜の学園で何をしていたんですか！？　誰が病院まで運んでくださったんですか！？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"mother_0011.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"Stop it, Minato. Heidoin-kun wouldn’t understand. Even if he did, he can’t talk about it for his position’s sake.\"\r\n「やめなさい、ミナト。平等院くんにわかるワケがないし、仮に知っていたとしても、立場上話せないわ」]])\r\n\r\nPLAY_VOICE(\"doctor_0018.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"...Sorry. Ms. Ikusa is right. But I’ll give you my personal opinion as a doctor, setting aside my professional stance.\"\r\n「……すみません。伊草さんの言った通りです。ただひとつだけ、医者としての立場を抜きに個人的な見解を述べさせていただきます」]])\r\n\r\nPLAY_VOICE(\"doctor_0019.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"If Marika is physically healthy yet won’t wake, it must be due to a psychological reason.\"\r\n「肉体的には健康そのもののマリカさんに、目覚めない理由があるとすれば、精神的な要因でしょう」]])\r\n\r\nPLAY_VOICE(\"doctor_0020.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"Though medicine offers no explanation, there are many cases where emotions impact life and death.\"\r\n「医学的には説明がつかずとも、感情がヒトの生死に関わった例はいくらでも存在します」]])\r\n\r\nPLAY_VOICE(\"doctor_0021.wav\")\r\n    MSG([[\r\n【Doctor】\r\n \"If the family doesn’t lose hope and continues engaging positively, things should improve.\"\r\n「ご家族の皆さんが望みを捨てず、前向きに接し続ければ、事態は好転していくはずです」]])\r\n\r\n    MSG([[Even the faint hope the doctor gave didn’t sink into my ears at that moment.\r\n主治医の先生が与えてくれたささやかな希望さえ、その時のボクにはとても耳に入らなかった。]])\r\n\r\n    FILTER_SCREEN(0)\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(55,\"\")\r\n    LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\",2000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    -- //effect：セピア加工・終了\r\n--FILTER_SCREEN(0)\r\n--SWITCH_SCREEN(\"mask009\" , 1000,false)\r\n\r\n    MSG([[And so, to the present.\r\nそして、現在に至る。]])\r\n\r\n    -- //BG：病室（夕方）\r\n    LAYER_LOAD(LAYER_BG, \"BG009ba\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    -- //BG：病室（夜）\r\n    LAYER_LOAD(LAYER_BG, \"BG009ca\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    -- //SE： 引き戸の開閉音\r\n    PLAY_SE(\"SEb004.wav\")\r\n    WAIT(500)\r\n\r\n    -- //BU：モブ女性\r\n    LAYER_LOAD(50,\"BU_MOB02aa\")\r\n    LAYER_POSITION(50,100,0)\r\n    LAYER_MOVE_POSITION(50,0,0,500,Ease.OutSine)\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[The hospital room door opened, and mother came in.\r\n病室の扉が開き、母さんが入ってきた。]])\r\n\r\nPLAY_VOICE(\"mother_0012.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"Still here, Minato? Go home and rest. You’re already exhausted from studying for your exams, aren’t you?\"\r\n「まだ帰っていなかったのね、ミナト。\r\n    　早く家に帰って休みなさい。ただでさえ、受験勉強でクタクタでしょう？」]])\r\n\r\n    MSG([[Looking at me like I’m a nuisance, mother sighed deeply.\r\nボクの顔を見て、酷く面倒臭いモノでも見るように、深いタメ息をつく母さん。]])\r\n\r\n    MSG([[A career woman who values efficiency above all, my mother often showed disappointment toward me for being so hopeless.\r\nバリバリのキャリアウーマンで効率を何より重視する母さんは昔から、要領の悪いボクに対して、失望の表情を見せることが多かった。]])\r\n\r\n    MSG([[Surely now she’s more upset about my sister collapsing than about me.\r\nきっと今も、ボクではなく姉さんが倒れたことに落胆しているのだろう。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03aa\")\r\nPLAY_VOICE(\"minato_0068.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, normal \"I want to stay by her side a little longer. You know, sometimes she even responds to my voice. Maybe she notices me...\"\r\n「まだ、姉さんのそばにいたいんだよ。ほら、本当にたまにだけど、ボクの声に反応してくれるから、もしかしたらボクに気付いているのかも、って……」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"mother_0013.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"Didn’t you listen to the doctor? Those are just reflex movements. If her consciousness center worked, she’d wake up.\"\r\n「医者の話を聞いていなかったの？　それは身体が反射的に動いているだけよ。ちゃんと意識中枢が機能しているなら、目を覚ますはずだわ」]])\r\n\r\n    MSG([[She crushed my words and continued.\r\nボクの言葉を無情にも一蹴し、母さんは続ける。]])\r\n\r\nPLAY_VOICE(\"mother_0014.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"Well, she apparently can hear your voice though.\"\r\n「まぁ声は聞こえているらしいけれどね」]])\r\n\r\nPLAY_VOICE(\"mother_0015.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"But they say the reason she won’t wake might be psychological, and until we understand that in detail, there’s no way to fix it. You have to give up for now.\"\r\n「ただ、目覚めない原因は、精神的な問題かもしれないという話だし、その詳細が分からないことには、解決のしようがないわ。今は諦めなさい」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ga\")\r\nPLAY_VOICE(\"minato_0069.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, panic \"The cause... Right! What about Yuriai Academy!? If she was found there, they must know something!\"\r\n「原因……そ、そうだ！　百合愛学園は！？\r\n    　姉さんが見つかった学園なら、何か知っているはずでしょ！？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Mother shook her head, exhausted.\r\n母さんは疲れ切った様子で首を横に振った。]])\r\n\r\nPLAY_VOICE(\"mother_0016.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"I talked to the academy director today... but they said nothing helpful. Marika was popular at school, showed no signs of worry, and they just don’t know the cause.\"\r\n「今日、百合愛学園の理事と話をしてきたけれど……ろくな話はできなかったわ。マリカは学園でも人気者で、悩んでいた様子もなく、原因はわからないの一点張り」]])\r\n\r\nPLAY_VOICE(\"mother_0017.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"They even said they’d cover the medical costs if we keep it confidential.\"\r\n「挙げ句の果てに、治療費を負担するからこの件は内密にして欲しいとまで言ってきてね」]])\r\n\r\nPLAY_VOICE(\"mother_0018.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"I accepted it because I don’t want my daughter caught up in scandal either.\"\r\n「まぁ私としても、娘をスキャンダルの渦中に入れたくはないから、受け入れたけれどね」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ba\")\r\nPLAY_VOICE(\"minato_0070.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, serious \"Eh!? M-Mom, are you okay with that!? After something so awful happened to her, you’re fine not making it public!?\"\r\n「え！？　か、母さんはそれでいいの！？ 姉さんの身にこんな酷いことが起きたのに、表沙汰にしなくても平気だっていうの！？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"mother_0019.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"If it went public, it wouldn’t be seen as a crime, just a tragic accident people talk about for a while. And we can’t afford to keep her hospitalized anyway.\"\r\n「表沙汰にしたところで、事件性が薄いから悲劇の事故としてお茶の間を賑わせて終わりよ。それに、マリカを入院させ続けるお金だって、ウチにはないの」]])\r\n\r\nPLAY_VOICE(\"mother_0020.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"Following the academy’s proposal is the best option to avoid hurting anyone... Though it’s frustrating.\"\r\n「百合愛学園の提案に従うのが、誰も傷つかずに済む最善の選択肢なのよ。……悔しいけれどね」]])\r\n\r\n    MSG([[The irritation showing on mother’s previously calm face. I saw her fists clenched tight.\r\nそれまで冷静な表情であった母さんの顔に、苛立ちの色が滲む。\r\n    　見れば両の拳が、ギュッと強く握りしめられていた。]])\r\n\r\n    MSG([[I’m stupid. My mom is surely frustrated too.\r\nボクはバカだ。\r\n    　母さんだって、悔しいに決まってる。]])\r\n\r\n    MSG([[No parent could be happy with their child going through this.\r\n自分の娘がこんな目に遭って、悲しくない親なんているワケないじゃないか。]])\r\n\r\n    MSG([[I apologized to mother and, as she said, decided to go home and rest.\r\nボクは母さんに謝って、言われた通り、自宅に帰って休むことを決めた。]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\",2000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    -- //BG：病室（朝）\r\n    LAYER_LOAD(LAYER_BG, \"BG009aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 2000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    -- //BG：病室（夜）\r\n    LAYER_LOAD(LAYER_BG, \"BG009ca\")\r\n    SWITCH_SCREEN(\"mask000\" , 2000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    MSG([[Every day after that, I went to my sister’s hospital room.\r\nそれから毎日、ボクは姉さんの病室に通った。]])\r\n\r\n    -- //BG：病室（朝）\r\n    LAYER_LOAD(LAYER_BG, \"BG009aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 2000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    -- //BG：病室（夜）\r\n    LAYER_LOAD(LAYER_BG, \"\")\r\n    SWITCH_SCREEN(\"mask000\" , 2000,false)\r\n\r\n    MSG([[But she never woke.\r\nだけど、姉さんは目覚めなかった。]])\r\n\r\n    -- //BG：病室（朝）\r\n    LAYER_LOAD(LAYER_BG, \"BG009aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 2000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    -- //BG：病室（夜）\r\n    LAYER_LOAD(LAYER_BG, \"BG009ca\")\r\n    SWITCH_SCREEN(\"mask000\" , 2000,false)\r\n\r\n    MSG([[She never woke.\r\nいつまでも、目覚めなかった。]])\r\n\r\n    -- //BG：病室（朝）\r\n    LAYER_LOAD(LAYER_BG, \"BG009aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 2000,false)\r\n\r\n    -- //BG：病室（夜）\r\n    LAYER_LOAD(LAYER_BG, \"BG009ca\")\r\n    SWITCH_SCREEN(\"mask000\" , 2000,false)\r\n\r\n    MSG([[Never.\r\nいつまでも。]])\r\n\r\n    -- //BG：病室（朝）\r\n    LAYER_LOAD(LAYER_BG, \"BG009aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 2000,false)\r\n\r\n    -- //BG：病室（夜）\r\n    LAYER_LOAD(LAYER_BG, \"BG009ca\")\r\n    SWITCH_SCREEN(\"mask000\" , 2000,false)\r\n\r\n    MSG([[Forever――\r\nいつまでも――]])\r\n\r\n    LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000)\r\n    WAIT_INPUT(1000)\r\n\r\n    -- //BG：病室（夕方）\r\n    LAYER_LOAD(LAYER_BG, \"BG009ba\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000)\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ea\")\r\nPLAY_VOICE(\"minato_0071.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, smile \"Marika-neesan, look! I did it! I got an acceptance letter to Yuriai Academy’s boys’ division!\"\r\n「マリカ姉さん、見てよ！　やったんだよ！\r\n    　百合愛学園の男子部への、合格通知がきたんだ！」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I placed the acceptance letter I brought to the hospital by my sister’s bed and proudly snorted.\r\nボクは病室まで持参した百合愛学園の合格通知を姉さんの眠るベッドの脇に置き、得意気に鼻を鳴らした。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ea\")\r\nPLAY_VOICE(\"minato_0072.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, smile \"Now I can go to the same school as you! Hehe. Maybe I’ve finally caught up to you a bit?\"\r\n「これで、姉さんと同じ学校に通えるんだよ！\r\n    　へへ。これでボクも、少しは姉さんに追いつけたかな？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03aa\")\r\nPLAY_VOICE(\"minato_0073.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, normal \"Marika-neesan, do you think I’ve grown since before...?\"\r\n「マリカ姉さん、ボク、昔より成長してるかな……？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    -- //CI：眠り続ける姉 005\r\nLAYER_LOAD(50,\"CI005a\")\r\nSWITCH_SCREEN(\"mask000\",500,false)\r\n\r\n    MSG([[No answer from Marika-neesan. Though she’s right in front of me, she feels so much farther away than when we couldn’t meet at all.\r\nマリカ姉さんから返事はない。\r\n    　目の前にいるのに、会えなかった頃よりもずっと、ずっと遠く離れた場所にいるみたいだ。]])\r\n\r\nLAYER_LOAD(50,\"\")\r\nSWITCH_SCREEN(\"mask000\",500,false)\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03da\")\r\nPLAY_VOICE(\"minato_0074.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, sadness \"Hey, answer me... Marika-neesan. I’ve been trying so hard to catch up to you... This can’t be happening...\"\r\n「ねえ、答えてよ……マリカ姉さん。\r\n    　ボク、ずっと姉さんに追いつきたくてがんばってきたのに……こんなのって、こんなのってないよ……」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[No good. Once I say how I feel out loud, I can’t stop.\r\nダメだ。\r\n    　一度気持ちを口に出してしまうと、もう止められない。]])\r\n\r\n    MSG([[All the feelings I’d been holding back for weeks suddenly flood out with my tears.\r\nこの数週間、ずっと喉元で抑え込んでいた感情が一気に湧き上がってきて、涙と一緒に溢れ出る。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03da\")\r\nPLAY_VOICE(\"minato_0075.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, sadness \"I want to talk again... I want to see you smile... Wake up...! Come back, Marika-neesan!\"\r\n「またお話がしたいよ……笑ってる顔が見たいよ……目を覚ましてよ…！帰ってきてよ、マリカ姉さん！」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I unconsciously grabbed Marika-neesan’s hand.\r\n思わず、マリカ姉さんの手を握りしめた。]])\r\n\r\n    MSG([[Then, at that moment――\r\nすると、その時――]])\r\n\r\n    -- //SE：鼓動\r\n    PLAY_SE(\"SEa025.wav\")\r\n    WAIT(500)\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ca\")\r\nPLAY_VOICE(\"minato_0076.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, surprise \"Eh?\"\r\n「えっ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Marika-neesan grabbed my hand back.\r\nボクの手を、マリカ姉さんが握り返してくれた。]])\r\n\r\n    MSG([[Surely just an unconscious reflex. She didn’t take my hand back by will.\r\nきっとそれは無意識の反射運動。\r\n    　姉さんが自分の意志で、握り返したワケじゃない。]])\r\n\r\n    MSG([[But that warmth was just like the times when she used to lead me home as a child.\r\nだけどその温もりは、子どもの頃に家まで手を引いてくれた、あの頃のままで。]])\r\n\r\n    MSG([[It felt like finally meeting Marika-neesan again after years, and my cheeks softened as I laughed through tears.\r\n数年ぶりに、ようやくマリカ姉さんと再会できたような心地となり、頬がゆるんで、泣きながら笑ってしまう。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ja\")\r\nPLAY_VOICE(\"minato_0077.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, crying smile \"I’m such an idiot.\"\r\n「ボクは、バカだなぁ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Yeah. A total idiot. I worried alone, despaired on my own, gave up. I hadn’t grown at all since those times I was protected by Marika-neesan.\r\nそうだ。大バカだ。 一人で悩んで、勝手に絶望して、諦めて。 マリカ姉さんに守られていた頃から、何も成長できていなかった。]])\r\n\r\n    MSG([[No matter what form, the fact that my sister is right here before me doesn’t change.\r\nどのような形であっても、ボクの目の前に姉さんがいる事実は変わらない。]])\r\n\r\n    MSG([[So what I must do is only one thing――\r\nなら、ボクがやるべきことはただひとつ――]])\r\n\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ja\")\r\nPLAY_VOICE(\"minato_0078.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, crying smile \"Marika-neesan is... still alive. So there’s absolutely no reason to despair. I’ll save her from now on.\"\r\n「マリカ姉さんは……まだ生きている。なら絶望する必要なんてまったくないじゃないか。 ボクがこれから、姉さんを救っちゃえばいいんだから」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[At that moment, the acceptance letter on the bed caught my eye, reminding me of a conversation with Riko-san on exam day.\r\nそこで、ベッド上の合格通知書が視界に入り、入試の日に出会ったリコさんとの会話を思い出した。]])\r\n\r\n\r\n    -- //BG：ハンバーガー屋（セピア加工）\r\n    LAYER_LOAD(LAYER_BG, \"BG001aa\")\r\nFILTER_SCREEN(2)\r\n\r\n    -- //BU：素顔リラ（笑顔）\r\n    LAYER_LOAD(50,\"BU_RIK01ea\")\r\n    SWITCH_SCREEN(\"mask010\" , 1000,false)\r\n\r\nPLAY_VOICE(\"lira_0045.wav\")\r\n    MSG([[\r\n【Riko】\r\nPlain Lira, smile \"At Yuri High, they give the title of ‘Princess’ to the four cutest girls on campus, and let them self-govern.\"\r\n「百合学の高等部ではさ、学内で最高にカワイイ四人の生徒に『姫』の称号を与えて、生徒自身に自治をさせてるんだよ」]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n\r\n    -- //BG：病室（夕方）\r\n    LAYER_LOAD(LAYER_BG, \"BG009ba\")\r\n    FILTER_SCREEN(0)\r\n    SWITCH_SCREEN(\"mask009\" , 1000,false)\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ca\")\r\nPLAY_VOICE(\"minato_0079.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, surprise \"That’s right... If those ‘Princesses’ handle self-governance, maybe they know something about Marika-neesan.\"\r\n「そうだ……自治をしている『姫』ってヒトたちなら、マリカ姉さんのことだって何か知ってるかもしれない」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Even Riko-san, a middle schooler, reacted as if she knew my sister.\r\n中等部の生徒であるリコさんだって、姉さんを知っているような反応だった。]])\r\n\r\n    MSG([[Those called ‘Princesses’ surely know more about the school’s inside than the board or teachers.\r\n『姫』と呼ばれるようなヒトたちなら、少なくとも、理事や教員よりも内情に詳しいことは間違いない。]])\r\n\r\n    MSG([[If there’s a clue to wake Marika-neesan, it has to be at Yuriai Private Academy, where she collapsed unconscious.\r\nマリカ姉さんを目覚めさせる手がかりがあるとすれば、姉さんが意識不明で倒れていたという、私立百合愛学園しか考えれないんだ。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ba\")\r\nPLAY_VOICE(\"minato_0080.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, serious \"I’ve decided, Marika-neesan. I will absolutely uncover the truth behind what happened to you!\"\r\n「決めたよ、マリカ姉さん。\r\n    　ボクは絶対に……姉さんの身に起こった事件の真相を暴き出してみせる！」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\",1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    -- //BG：病室（夜）\r\n    LAYER_LOAD(LAYER_BG, \"BG009ca\")\r\n\r\n    -- //BU：モブ女性\r\n    LAYER_LOAD(50,\"BU_MOB02aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000)\r\n\r\n    MSG([[That night, I honestly told mother my thoughts when she came to the hospital room.\r\nその日の夜、病室へやってきた母さんに、自分の考えを正直に話してみた。]])\r\n\r\n    MSG([[Mother understood, but worried visibly and protested me investigating.\r\n母さんはボクの話に理解は示しつつも、その顔に不安の色を滲ませて、ボクが調査を行うことに反対する。]])\r\n\r\nPLAY_VOICE(\"mother_0021.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"It’s true the school wants to hide something about Marika. But it’s way too dangerous for a student to investigate their secrets.\"\r\n「確かに、学園がマリカについて何かを隠したがっていることは間違いないわ。でも、イチ生徒の立場からその秘密を探ろうだなんて危険過ぎるわよ」]])\r\n\r\nPLAY_VOICE(\"mother_0022.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"The school is a closed environment. As you saw today, they can easily sweep secrets under the rug.\"\r\n「学園はある意味で閉鎖的な場所。\r\n    　今回マリカについての情報を全然訊き出せなかったみたいに、いくらでも秘密は揉み消せてしまうの」]])\r\n\r\nPLAY_VOICE(\"mother_0023.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"If the school finds out your plans, you don’t know what terrible things might happen to you. Do you understand the risks you’re taking?\"\r\n「もし学園側にミナトの考えが知られたら、あなた、どんな酷い目に遭うか分からないのよ？ その危険を承知で言っているの？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ba\")\r\nPLAY_VOICE(\"minato_0081.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, serious \"I know the risks very well. But there’s no other lead. I will find out why Marika fell unconscious at school!\"\r\n「危険は百も承知だよ。でも、手がかりは他にないんだ。 ボクが必ず、姉さんが学校で倒れていた理由を突きとめてみせるよ！」]])\r\n\r\nPLAY_VOICE(\"minato_0082.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, serious \"Please. Until I finish my investigation, hold off on any decision about life-support treatments! I will definitely wake her up!\"\r\n「だからお願い。ボクの調査が終わるまでの間は、延命治療を続けるかどうかの判断は保留にしてよ！ 絶対に、姉さんを目覚めさせてみせるから！」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"mother_0024.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"Haaaah......\"\r\n「はぁ～～～～～……」]])\r\n\r\n    MSG([[Mother stared deeply into my eyes and sighed more deeply than I’ve ever seen.\r\n母さんがボクの目をじっと見つめて、今まで見てきた中で最も深いタメ息をついた。]])\r\n\r\nPLAY_VOICE(\"mother_0025.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"Honestly... You and Marika both never listen once you start in. Fine. Do as you wish.\"\r\n「まったく……アナタもマリカも、言い出したら聞かないんだから。\r\n    　わかったわ。あなたの好きなようにやりなさい」]])\r\n\r\nPLAY_VOICE(\"mother_0026.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"But the decision must be made in one year. I researched a lot too, and if she remains vegetative for more than a year, chances of waking drop even further.\"\r\n「ただし、一年後には結論を出すわよ。 母さんも色々と調べてね、植物状態が一年以上続くと目覚める確率は更に低くなることがわかったの」]])\r\n\r\nPLAY_VOICE(\"mother_0027.wav\")\r\n    MSG([[\r\n【Mother】\r\n \"Delaying the decision beyond that doesn’t help anyone. Not us... nor Marika herself.\"\r\n「それ以上結論を先延ばしにするのは、誰のためにもならないわ。\r\n    　私たちはもちろん……マリカ自身にもね」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ea\")\r\nPLAY_VOICE(\"minato_0083.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual clothes, smile \"...Understood. Thank you, mother. I will save my sister within the year, no matter what!\"\r\n「……わかった。ありがとう、母さん。\r\n    　一年以内に、姉さんを絶対に救ってみせるよ！！」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[And so, my new school life starting in April took on an unbearably heavy purpose.\r\nこうして、ボクの四月からの新たな学園生活に、あまりにも責任重大な目的が生まれた。]])\r\n\r\n    MSG([[To discover within a year the reason why Marika-neesan won’t wake. Yuriai Private Academy surely holds some major secret about her.\r\nそれは一年以内に、マリカ姉さんが目覚めない理由を突き止めること。\r\n    　私立百合愛学園には間違いなく、姉さんに関わる何か重大な秘密があるはずだ。]])\r\n\r\n    MSG([[I will uncover it no matter what. Even if it means making an enemy of the school. No matter how harsh the fate awaiting me. Absolutely.\r\nボクはそれを必ず暴き出す。 たとえ、学園を敵に回すことになろうとも。 どれほど過酷な運命が待ち受けていようとも、絶対に。]])\r\n\r\n    -- 　　　◆\r\nSTOP_BGM(1000)\r\nLAYER_LOAD_FACE(\"\")\r\n    LAYER_LOAD(LAYER_BG, \"\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"EP01_06\")\r\n\r\nend\r\n"
}