{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP02_07",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP02/EP02_07.lua",
  "Text": "function EP02_07()\r\n\r\n    --.承-1【4月第2週】「六条オウガの社長論」\r\n    SaveData.Title = \"六条オウガの社長論\"\r\n\r\n    --//BG：男子部教室（夜）\r\n    LAYER_LOAD(LAYER_BG, \"BG015ca\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM03.wav\",0)\r\n\r\n    MSG([[The boys' division on the day we received a declaration of war from Lira.\r\nリラさんからの宣戦布告を受けた日の男子部。]])\r\n\r\n    --//BU：モブ女性\r\n    LAYER_LOAD(50,\"BU_MOB02aa\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"itoh_0018.wav\")\r\n    MSG([[\r\n【Mr. Ito】\r\n \"――From all of the above, mastering the six conjugations explained this time is the most important in classical Japanese. There will be a quiz next time, so please prepare in advance.\"\r\n「――以上のことから、古文では今回説明した六種類の活用形をマスターすることが最も重要です。次回は小テストをしますから、予習してきてください」]])\r\n\r\nPLAY_VOICE(\"itoh_0019.wav\")\r\n    MSG([[\r\n【Mr. Ito】\r\n \"Well then, that concludes today's class. You have free time until the school building locks, so please be sure to leave properly.\"\r\n「それでは、今日の授業はここまでとします。校舎の施錠時刻までは自由時間としますから、きちんと下校するようにお願いしますね」]])\r\n\r\n    --//BU：なし\r\n    LAYER_LOAD(50,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[Having said that, Mr. Ito hurriedly exited the room.\r\nそれだけ言うと、伊藤先生はそそくさと退室していった。]])\r\n\r\n    MSG([[His attitude toward the boys' division remained as curt as ever. But the classical literature class he taught was easy to follow, well summarized, and left a very careful impression.\r\n相変わらず男子部への対応は素っ気ない。 でも彼女の担当する古典の授業自体は聞き取りやすく、要点もまとめられていて、非常に丁寧な印象だ。]])\r\n\r\n    MSG([[Maybe he's someone responsible who fulfills the work assigned to him properly.\r\n与えられた仕事はしっかりとこなす責任感の強いヒト、なのかもしれない。]])\r\n\r\n    MSG([[But still, not even having a homeroom at the end of the day feels like poor treatment.\r\nでも帰りのホームルームすらないのは、やっぱり扱いが悪いなぁと思った。]])\r\n\r\n    --//BU：オウガ（通常）\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"ogre_0056.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"Minato, you not leaving?\"\r\n通常\r\n    「ミナト、帰らないのか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01fc\")\r\nPLAY_VOICE(\"minato_0258.wav\")\r\n    MSG([[\r\n【Minato】\r\nWry smile \"Ah, sorry. I just... have some things I want to think about.\"\r\n苦笑\r\n    「ああ、ごめんね。ちょっと……考えたいことがあって」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"ogre_0057.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"...I see.\"\r\n通常\r\n    「……そうか」]])\r\n\r\n    --//BU：なし\r\n    LAYER_LOAD(50,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[After Ouga left, leaving me alone in the classroom, I thought about today’s events.\r\nオウガくんが去って一人きりとなった教室で、ボクは今日の出来事について考える。]])\r\n\r\n    LAYER_LOAD(LAYER_BG,\"BG015ce\")\r\n    LAYER_POSITION(LAYER_BG,-500,0)\r\n    LAYER_MOVE_POSITION(LAYER_BG,500,0,30000,Ease.OutSine)\r\n    SWITCH_SCREEN(\"mask000\",1000,false)\r\n\r\n    MSG([[Even during class, I couldn't get Lira out of my head.\r\n授業中も、リラさんのことが頭から離れなかった。]])\r\n\r\n    MSG([[Because I experienced cross-dressing myself, I understood the difference in the class of a girl.\r\n自分が女装を経験したからこそわかる、女の子としての格の違い。]])\r\n\r\n    MSG([[Just when I decided to work hard for Marika-nee-san by cross-dressing, I ended up facing such a fierce rival.\r\nマリカ姉さんのために女装をがんばろうと思った矢先に、アレほど強烈なライバルと争うことになるなんて。]])\r\n\r\n    MSG([[I feel unbearably anxious about what lies ahead.\r\n先行きが不安でたまらない。]])\r\n\r\n    --//BU：オウガ（笑顔）\r\n    LAYER_LOAD(LAYER_BG,\"BG015ca\")\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    SWITCH_SCREEN(\"mask000\",1000,false)\r\n\r\nPLAY_VOICE(\"ogre_0058.wav\")\r\n    MSG([[\r\n【Ouga】\r\nSmile \"I don't know what happened, but wouldn't thinking over it alone just make you stuck?\"\r\n笑顔\r\n    「何があったか知らんが、一人で考え込んでも煮詰まらないのではないか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ca\")\r\nPLAY_VOICE(\"minato_0259.wav\")\r\n    MSG([[\r\n【Minato】\r\nSurprised \"O, Ouga-kun!\"\r\n驚き\r\n    「お、オウガくん」]])\r\n\r\nLAYER_LOAD_FACE(\"\")\r\n    MSG([[Ouga, whom I thought had left, returned to the classroom. In his hands, he held two steaming coffee cups.\r\n帰ったと思っていたオウガくんが教室に戻ってきた。\r\n    　その手には、湯気のたったコーヒーカップがふたつ握られている。]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0059.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"Although it was the first day of class, you seemed out of sorts. Did something happen?\"\r\n通常\r\n    「授業初日だというのに精彩を欠いた様子だったが、何かあったのか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01fa\")\r\nPLAY_VOICE(\"minato_0260.wav\")\r\n    MSG([[\r\n【Minato】\r\nWry smile with sweat \"Yeah... something a bit serious happened.\"\r\n苦笑・汗\r\n    「うん……ちょっと、大変なことになってね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"ogre_0060.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"I see. There's still time before the building locks. If you don't mind, I'll listen.\"\r\n通常\r\n    「そうか。施錠時刻まではまだ余裕がある。オレ様でよければ話を聞こう」]])\r\n\r\nPLAY_VOICE(\"ogre_0061.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"First, drink this coffee and gaze upon my serratus anterior muscles. Your mind will find peace.\"\r\n通常\r\n    「まずはコーヒーを飲んで、オレ様の前鋸筋を見つめるといい。心が安らぐぞ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ea\")\r\nPLAY_VOICE(\"minato_0261.wav\")\r\n    MSG([[\r\n【Minato】\r\nSmile \"Thanks. I'll have some coffee.\"\r\n笑顔\r\n    「ありがとう。コーヒーはいただくね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I thanked Ouga and took the cup.\r\nオウガくんにお礼を言い、カップを受け取った。]])\r\n\r\n    MSG([[Ah, it smells wonderful. Surely he ground the beans and brewed it himself. Above all, that thoughtful gesture warms my heart and calms me.\r\nああ、いい香り。 きっと、わざわざ豆から挽いて淹れてくれたものに違いない。 何より、その心遣いが温かくて、心がホッとする。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ea\")\r\nPLAY_VOICE(\"minato_0262.wav\")\r\n    MSG([[\r\n【Minato】\r\nSmile \"Ouga, even though you're the head of the company, you're good at making coffee and also diligent with household chores. It's really impressive.\"\r\n笑顔 「オウガくんは会社の代表なのにコーヒーを淹れるのも上手いし、家事も丁寧だし、本当にスゴいね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"ogre_0062.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"Hmph, titles don’t matter. There are leaders like me who can handle everything themselves if possible, and others who leave everything to their subordinates.\"\r\n通常 「ふっ、肩書など関係ない。オレ様のように可能ならば何事も自分でこなす代表もいれば、全てを下の者に託す代表もいるだろう」]])\r\n\r\nPLAY_VOICE(\"ogre_0063.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"And I can’t say which is the right way to lead. In the end, a person is not made by their title.\"\r\n通常\r\n    「そしてどちらが上に立つ者として正しいかは断言できん。結局のところ、肩書によってヒトが作られることはないのだ」]])\r\n\r\n    MSG([[Hearing such an unexpected answer from always confident Ouga, I widened my eyes.\r\nいつも自信満々のオウガくんから返ってきた意外な返答に、目を丸くしてしまう。]])\r\n\r\n    MSG([[But since Ouga was born to become a 'leader,' his words carried weight.\r\nでも、生まれながら『上に立つ者』にならなければならなかったオウガくんだけに、その言葉には重みがあった。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01aa\")\r\nPLAY_VOICE(\"minato_0263.wav\")\r\n    MSG([[\r\n【Minato】\r\nNormal \"That’s right. No matter how great a title you get, it doesn’t mean you automatically have the skill or dignity to match it.\"\r\n通常\r\n    「そう、だよね。いくらスゴい肩書を手に入れるチャンスに恵まれたって、それに見合うだけの実力や品格が手に入るワケじゃないもんね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"ogre_0064.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"Exactly. This coffee you’re drinking tastes good, doesn’t it?\"\r\n通常\r\n    「その通りだ。今飲んでいるコーヒー、美味いだろう？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ca\")\r\nPLAY_VOICE(\"minato_0264.wav\")\r\n    MSG([[\r\n【Minato】\r\nSurprised \"Y-yeah. It’s really delicious.\"\r\n驚き\r\n    「え、う、うん。スゴく美味しい」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"ogre_0065.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"These are beans we usually drink in the Rokujou household. We used to use Blue Mountain, but I felt it was just a branded inferior product.\"\r\n通常 「六条家で普段から飲まれている豆を持ってきたんだ。以前はブルーマウンテンを使っていたのだが、名ばかりの粗悪品だと感じてな」]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0066.wav\")\r\n    MSG([[\r\n【Ouga】\r\nSmile \"So I decided to buy beans cheaply from a local old man who roasts them as a hobby. No brand, obviously, but the taste is solid, right? What matters is not the label but the taste.\"\r\n笑顔 「近所の爺さんが道楽で焙煎している豆を格安で購入することにしたんだよ。当然ノーブランドだが、味は確かだろう？　重要なのはラベルではなく、味なのだ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01aa\")\r\nPLAY_VOICE(\"minato_0265.wav\")\r\n    MSG([[\r\n【Minato】\r\nNormal \"Taste, huh...\"\r\n通常\r\n    「味、かあ……」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[My chest hurt. I painfully realized it when facing Lira, another 'Princess' candidate.\r\n胸が痛む。\r\n    　同じ『姫』候補のリラさんと相対して痛感した。]])\r\n\r\n    MSG([[Right now, I am the equivalent of a branded Blue Mountain. Just a package with the 'Princess' candidate label accidentally stuck on, but empty inside.\r\n今のボクは名ばかりのブルーマウンテン。 『姫』候補というラベルを偶然貼ってもらっただけの、中身のないパッケージだ。]])\r\n\r\n    MSG([[If I compete with Lira for the 'Princess' title going forward, I must properly fill that emptiness.\r\nこの先、リラさんと『姫』の座を争うのであれば、その空っぽの中身をしっかりと充実させていかなければならない。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01da\")\r\nPLAY_VOICE(\"minato_0266.wav\")\r\n    MSG([[\r\n【Minato】\r\nSad \"Ouga-kun. I have a weird question.\"\r\n悲しみ\r\n    「オウガくん。変な質問をしちゃうんだけど」]])\r\n\r\nPLAY_VOICE(\"minato_0267.wav\")\r\n    MSG([[\r\n【Minato】\r\nSad \"What if the coffee beans everyone lined up to buy are not brand-name at all, but actually soybeans, and they can’t produce the expected taste? What should be done?\"\r\n悲しみ 「もし予約殺到したコーヒー豆が、ブランドものどころか本当は大豆で、期待された味なんか出せっこない時はどうすればいいのかな？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Ouga looked puzzled but then put his hand to his chin, thought for a moment, and spoke.\r\nオウガくんは怪訝そうに首を傾げたものの、アゴに手を当てて、しばらく考えたあと、口を開いた。]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0067.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"In that case, there are two possibilities.\"\r\n通常\r\n    「その場合ふたつにひとつだろう」]])\r\n\r\nPLAY_VOICE(\"ogre_0068.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"The easiest choice is to apologize early. But that would cause customers to feel indignant, the soybean seller to suffer huge losses, and nobody benefits.\"\r\n通常 「まず最も容易い選択は、早い内に謝罪することだな。 しかし、これでは客は義憤に駆られ、大豆の販売元は大損し、誰も得をしない」]])\r\n\r\nPLAY_VOICE(\"ogre_0069.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"The other choice is to genetically improve the soybeans, so they can be used to brew coffee.\"\r\n通常\r\n    「そしてもう一方の選択は、大豆からコーヒーを抽出できるよう品種改良してしまうことだ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ca\")\r\nPLAY_VOICE(\"minato_0268.wav\")\r\n    MSG([[\r\n【Minato】\r\nSurprised \"G-genetic improvement? Can that really be done?\"\r\n驚き\r\n    「ひ、品種改良？　そんなことできるの？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"ogre_0070.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"Of course, normally it’s impossible. It would fail 100%.\"\r\n通常\r\n    「無論、普通に考えれば不可能だ。１００％失敗する」]])\r\n\r\n    MSG([[Ouga said this as if it were obvious, then smiled mischievously and continued.\r\nオウガくんはさもありなんといった風に言った。\r\n    　それから愉快そうに口角をつり上げて、言葉を続ける。]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01pa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0071.wav\")\r\n    MSG([[\r\n【Ouga】\r\nLoud laugh \"But what if you made the impossible possible? Customers would be delighted without realizing it’s soybean juice! Customers are satisfied, the shop prospers! It’s a win-win!\"\r\n高笑い 「だがもし、その不可能を可能にしたらどうだ？　客たちは大豆汁とは露も知らずに大喜びするだろう！　客は満足し、店は大繁盛！　ウィン・ウィンではないか！」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ca\")\r\nPLAY_VOICE(\"minato_0269.wav\")\r\n    MSG([[\r\n【Minato】\r\nSurprised \"Make the impossible, possible.\"\r\n驚き\r\n    「不可能を、可能に」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Somehow, those words thrilled me. It sounds like a dream, but if realized, everyone would be happy.\r\n何だか、スゴく胸が躍る言葉だ。\r\n    　夢みたいな話だけれど、確かに実現できればみんなが幸せになれる。]])\r\n\r\n    MSG([[It might be the same with this situation. If the fake me wins against a genuine beautiful girl, everything will be solved.\r\n今の状況だって同じかもしれない。\r\n    　偽物のボクが本物の美少女に勝てば、すべて解決するんだ。]])\r\n\r\n    MSG([[I may not have the ability worthy of the 'Princess' title now, but I resolve to do my best.\r\n今のボクには『姫』の称号に見合う実力なんてないかもしれないけれど、精いっぱいがんばってみようと思った。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ea\")\r\nPLAY_VOICE(\"minato_0270.wav\")\r\n    MSG([[\r\n【Minato】\r\nSmile \"Thank you, Ouga-kun. I feel like I can clear my head now.\"\r\n笑顔\r\n    「ありがとう、オウガくん。何だか吹っ切れそうだよ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0072.wav\")\r\n    MSG([[\r\n【Ouga】\r\nSmile \"That’s good. Since your cousin will be competing with a Princess Gal, you have a lot on your mind.\"\r\n笑顔\r\n    「ならばよかった。従妹が姫ギャルとやらと争うことになって、ミナトも気苦労が多いだろうからな」]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01pa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0073.wav\")\r\n    MSG([[\r\n【Ouga】\r\nLoud laugh \"If you have any worries, anytime, rely on me. Ha---hahaha!\"\r\n高笑い 「頭を悩ますことがあれば、いつでもオレ様を頼るといいぞ。 ハァーーーハッハッハッ！」]])\r\n\r\n    MSG([[He seemed to have seen right through me. Encouraged by his kindness and hearty laughter, I couldn’t help but laugh too.\r\n全部お見通しだったらしい。\r\n    　その優しさと豪気な笑い声に励まされ、つられて笑ってしまった。]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0074.wav\")\r\n    MSG([[\r\n【Ouga】\r\nSmile \"Erika is a valuable genuine Yamato Nadeshiko in these modern times. I truly hope she claims the 'Princess' throne.\"\r\n笑顔 「エリカ女史は現代には貴重な、真の大和撫子の逸材だからな。 ぜひ『姫』の座を射止めてもらいたいものだ」]])\r\n\r\n    MSG([[That valuable person is actually a fake—I certainly couldn't say that. If she is believed to be a Yamato Nadeshiko, I’ll play the role to the end. That is the mission entrusted to me who told a lie.\r\nその逸材、実は偽物です――なんて言えるワケもない。 大和撫子だと思われているなら、最後まで演じきろう。 それが、嘘をついてしまったボクの使命だ。]])\r\n\r\n    MSG([[I have no choice but to work hard. With all my might, enough to surpass the real one.\r\n努力するしかない。\r\n    　本物を超えられるくらい、精いっぱい。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01aa\")\r\nPLAY_VOICE(\"minato_0271.wav\")\r\n    MSG([[\r\n【Minato】\r\nNormal \"Oh, by the way, the boys' division seniors will be off probation by late April.\"\r\n通常\r\n    「あ、そう言えば男子部の先輩たち、四月下旬には謹慎が解けるんだって」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0075.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"What? That’s good news. We should prepare some kind of gift to celebrate, for future camaraderie.\"\r\n通常\r\n    「何？　それは朗報だな。今後の親睦のためにも、何かお祝いの品でも用意しておこう」]])\r\n\r\n    MSG([[And so, the first day of school life was somehow safely completed by both the girls' division and the boys' division.\r\nこうして学園生活の一日目は、女子部も男子部も、何とか無事にやり切ることができたのだった。]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n\r\n    --　　　　　　◆\r\nSTOP_BGM(1000)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"EP02_08\")\r\n\r\nend\r\n"
}