{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP02_02",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP02/EP02_02.lua",
  "Text": "function EP02_02()\r\n\r\n    --.起-1【4月第1週】「六条オウガ」\r\n    SaveData.Title = \"六条オウガ\"\r\n\r\nPLAY_BGM(\"BGM03.wav\",0)\r\n\r\n    --//BG：男子部校舎前（夕方）\r\n    LAYER_LOAD(LAYER_BG, \"BG021bb\")\r\n    SWITCH_SCREEN(\"mask002\" , 1000,false)\r\n\r\n    MSG([[The building we were shown as the boys' division was the old building I saw during the day.\r\n男子部の校舎として案内されたのは、昼に見かけた古い建物であった。]])\r\n\r\n    MSG([[Cobwebs were strung, the window glass was cracked, and the exterior looked like it might break if the wind blew. Honestly, I hesitated even to step inside.\r\n蜘蛛の巣が張り、窓ガラスにはヒビが入っていて、風が吹けば壊れてしまいそうな外観だ。 正直、足を踏み入れるのも躊躇われる。]])\r\n\r\n    MSG([[Are we really going to study here from now on...?\r\n本当にここで、これから学んでいくのかな……。]])\r\n\r\n    LAYER_LOAD(50,\"BU_MOB02aa\")\r\n    LAYER_POSITION(50,-400,0)\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"itoh_0016.wav\")\r\n    MSG([[\r\n【Mr. Ito】\r\n \"Isn't it an honor to be able to study in such a historic building?\"\r\n「歴史ある建物で勉学に励めるなんて光栄でしょう？」]])\r\n\r\n    LAYER_LOAD(55,\"BU_OGA01aa\")\r\n    LAYER_POSITION(55,400,0)\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"ogre_0015.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Hmph, that's just one way to put it. It’s obviously a reuse of facilities that had fallen out of use.\"\r\n「ふん、モノは言いようだな。\r\n    　明らかに、使われなくなった施設の再利用ではないか」]])\r\n\r\n    LAYER_LOAD(55,\"BU_OGA01ea\")\r\n    LAYER_POSITION(55,400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0016.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Well, I don't mind. You can't always choose your environment. So I'll just paint it in Orega-sama's colors.\"\r\n「まぁ構わぬさ。いつだって環境は選べぬもの。\r\n    　ならば、オレ様色に染め上げるのみだ」]])\r\n\r\nPLAY_VOICE(\"ogre_0017.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Alright, let’s get to work, Minato.\"\r\n「さぁやるぞ、ミナト」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ca\")\r\nPLAY_VOICE(\"minato_0203.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Huh?\"\r\n「え？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(55,\"\")\r\n\r\n    --//BG：男子部教室（夕方）\r\n    LAYER_LOAD(LAYER_BG, \"BG015ba\")\r\n    SWITCH_SCREEN(\"mask002\" , 1000,false)\r\n\r\n    MSG([[After receiving a brief explanation about future classes from the teacher and getting the materials for upcoming lessons, Ouga and I started cleaning the building together.\r\n先生から今後の授業についての簡単な説明を受け、今後の教材を受け取ったあと、オウガくんとボクは二人で校舎を掃除していた。]])\r\n\r\n    MSG([[While I swept the floor with a broom, Ouga laughed loudly as he wiped the windows.\r\nボクが床を箒で掃く一方で、オウガくんは高笑いをあげながら窓を拭いている。]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"ogre_0018.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Haaaa-ha ha ha! What a marvelous detergent! The grime on the windows is coming off with a squeak!\"\r\n「ハァーーーーハッハッハ！　素晴らしい洗剤だッ！\r\n    　窓の水垢がキュッキュッと落ちていくぞ！」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ea\")\r\nPLAY_VOICE(\"minato_0204.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"That detergent is good, right? I use it at home too.\"\r\n「その洗剤いいでしょ？　ボクも家で使ってるんだ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"ogre_0019.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Hmph, you look like you’d make a fine wife. I’d hire you to work at my mansion.\"\r\n「ふっ、キサマはよい嫁になりそうだな。我が屋敷に雇いたいくらいだぞ」]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0020.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"I cannot overlook the environment being overtaken by mold and dust as a king. I will clean every speck of dust thoroughly!!\"\r\n「周囲の環境がカビやホコリに侵されているなど、王として見過ごせん。\r\n    　チリひとつ残さず掃除してくれるわッ！！」]])\r\n\r\n    MSG([[Saying so, Ouga carefully wiped each window from corner to corner.\r\nそう言ってひとつひとつ、隅から隅まで、丁寧に窓を拭いていくオウガくん。]])\r\n\r\n    MSG([[Contrary to his bold words, his movements were delicate and gentle. He had arranged for a contractor at the start to replace any broken window glass during cleaning, showing excellent planning skills.\r\n豪快な言葉に反して、その手つきは繊細で柔らかい。 最初に業者を手配し、掃除の間に割れた窓ガラスを交換させる等、段取りの付け方も優れている。]])\r\n\r\n    MSG([[Watching him nearby, the arrogant first impression I had of him gradually disappeared.\r\nそばで見ていると、傲慢にも思えた第一印象はどんどん払拭されていった。]])\r\n\r\n    MSG([[He’s a strange person. I feel a different kind of charisma from him than from the \"Four Princesses\". Why on earth did he come to such a unique academy?\r\n不思議なヒトだ。 『姫』の皆さんとは、また違うカリスマ性を感じる。 一体、どうしてこんな特殊な学園に来たんだろう。]])\r\n\r\nPLAY_VOICE(\"ogre_0021.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Minato, why did you come to this academy?\"\r\n「ミナトは何故この学園に来たのだ？」]])\r\n\r\n    MSG([[Just as I was wondering that, Ouga asked me instead.\r\nなどと思っていたら、逆にオウガくんから訊ねられた。]])\r\n\r\nPLAY_VOICE(\"ogre_0022.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Moderate conversation improves efficiency in simple tasks. If you don’t mind, please tell me.\"\r\n「適度な会話は単純作業の能率を向上させる。もしよければ聞かせてくれ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01fa\")\r\nPLAY_VOICE(\"minato_0205.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"It’s… not a big reason. I just wanted to attend the same academy as someone I admire.\"\r\n「ボクは……大した理由じゃないよ。\r\n    　ただ憧れの人と同じ学園に、通いたかっただけだから」]])\r\n\r\nPLAY_VOICE(\"minato_0206.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"I’ve always been trying hard to catch up to that person, both now and in the past.\"\r\n「その人に追いつきたくて、ボクは今も昔も、がんばっているんだ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"ogre_0023.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"A worthy ambition. Admiration is the first step toward growth.\"\r\n「よい志だな。憧れは成長の第一歩だ」]])\r\n\r\nPLAY_VOICE(\"ogre_0024.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"The gates of Yuriai Private Academy aren’t wide enough for just anyone to pass on half-hearted ambition.\"\r\n「生半可な志で合格できるほど、百合愛学園の門戸は広くない」]])\r\n\r\nPLAY_VOICE(\"ogre_0025.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Besides, this is a part-time course. Without a strong conviction, you wouldn’t be here now.\"\r\n「その上、この学園は定時制だ。\r\n    　よほど強い信念がなければ、今この場にいないだろう」]])\r\n\r\n    MSG([[Ouga looked me straight in the eyes as he spoke.\r\nオウガくんは真っ直ぐにボクの目を見据えたまま言った。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ea\")\r\nPLAY_VOICE(\"minato_0207.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"...Thank you. I’m glad to hear that. Why did you come to Yuriai Private Academy, Ouga?\"\r\n「……ありがとう。そう言ってもらえて嬉しいよ。\r\n    　オウガくんはどうして百合愛学園に来たの？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"ogre_0026.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Me? My reason is simple. I only have time for part-time courses, so I chose the academy that best fits my conditions and allows me to grow myself.\"\r\n「オレ様か？　オレ様の理由はシンプルだ。 定時制しか通う暇のない身の上なのでな、条件に見合う中で最も己を高められる学園を選んだだけのことよ」]])\r\n\r\n    MSG([[I see. Ouga said he was the representative of his group, so maybe there are few academies he can attend in the first place.\r\nそうか。\r\n    　オウガくんはグループの代表と言っていたし、そもそも通える学園が少ないのか。]])\r\n\r\n    MSG([[The boys’ division has lectures concentrated at night, which might be just right for a busy life.\r\n男子部は夜間に集中して講義が行なわれるし、多忙の身にはちょうどいいのかもしれない。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ea\")\r\nPLAY_VOICE(\"minato_0208.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"You said you’re the representative of the Rokujou Group, right? So does that mean you work at the company during the day and go to school at night?\"\r\n「六条グループの代表って言っていたよね？ じゃあ昼は会社で、夜は学校に通ってるってこと？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"ogre_0027.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"That’s right. Of course, there is a system in place to contact me in emergencies. I can’t afford to miss work under the pretext of studying.\"\r\n「その通りだ。無論、緊急時には連絡が入るよう体制は整えている。 学業を理由に業務に穴を空けるなど許されんからな」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ca\")\r\nPLAY_VOICE(\"minato_0209.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Amazing. I can’t even imagine that world at all.\"\r\n「スゴいなぁ。ボクでは全然イメージできない世界だよ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"ogre_0028.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"It’s not amazing. I was simply born with a king’s throne reserved for me.\"\r\n「スゴくはないさ。生まれながらに、王の椅子が用意されていただけだ」]])\r\n\r\nPLAY_VOICE(\"ogre_0029.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Those around me follow the golden chair I sit in, not me personally.\"\r\n「オレ様の周囲の者どもは、まだオレ様自身にではなく、オレ様の座る黄金の椅子に従っている」]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0030.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"But one day, I’ll make them bow to me. For that reason, I can’t cut corners on any task in front of me.\"\r\n「だがいずれ必ず、オレ様にこうべを垂らさせてやるさ。そのためにも、オレ様は目の前のひとつひとつのことに手を抜くワケにはいかない」]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01pa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0031.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Once I decide to sit in the king’s chair... I must grow into a man worthy of that seat!\"\r\n「王の椅子に座ると決断した以上……その椅子に見合うだけの男に成長する他ないのだ！」]])\r\n\r\n    MSG([[Ouga laughed loudly again as he carefully scraped away the fine dirt at the corners of the windows with a cloth.\r\nオウガくんがまた高笑いをあげながら、窓の角の細かな汚れを雑巾で丁寧にこそぎ落としていく。]])\r\n\r\n    MSG([[I couldn’t help but laugh at his seemingly bold yet delicate behavior.\r\nその豪快なのか繊細なのかわからない様子に、ボクはつい笑ってしまった。]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n    SWITCH_SCREEN(\"mask017\",1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    --//BG：男子部教室（夜）\r\n    LAYER_LOAD(LAYER_BG, \"BG015ca\")\r\n    SWITCH_SCREEN(\"mask017\" , 1000,false)\r\n\r\n    MSG([[After several hours of cleaning, we managed to get the first floor clean.\r\n掃除を続けること数時間。\r\n    　何とか、一階は清潔な状態にまで掃除できた。]])\r\n\r\n    MSG([[Ouga and I quickly wiped away our sweat, brewed coffee in the home economics room, and took a break in the classroom.\r\nボクとオウガくんは汗を簡単に拭うと、家庭科室でコーヒーを淹れ、教室で一休みすることにした。]])\r\n    --//BU：オウガ（通常）\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"ogre_0032.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Yes, the air has become quite fresh. A sound mind dwells in a sound body. And a sound body is nurtured by a sound environment.\"\r\n「うむ、随分と空気が美味くなったな。 健全なる精神は健全なる肉体に宿る。 そして健全なる肉体は、健全なる環境が育む」]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01pa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0033.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"In this environment, the cells composing my body will surely spring to life! Haaaa-ha ha ha ha!\"\r\n「この環境ならば、オレ様の肉体を構成する細胞たちも躍動してくれることだろう！\r\n    　ハァーーーーハッハッハッ！」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ea\")\r\nPLAY_VOICE(\"minato_0210.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"From here on, our school life begins.\"\r\n「ここから、ボクたちの学園生活が始まるんだね」]])\r\n\r\nLAYER_LOAD_FACE(\"\")\r\n    MSG([[Between my sister, crossdressing, and the commotion at the entrance ceremony, I hadn’t been able to really feel it.\r\n姉さんのことや、女装、入学式の騒動もあって、ずっと実感できずにいたけれど。]])\r\n\r\n    MSG([[But now I really had enrolled in Yuriai Private Academy, the goal I had always aimed for.\r\nボクは本当に、ずっと目標にしていた百合愛学園に入学することができたんだ。]])\r\n\r\n    MSG([[I must not forget my mission to uncover my sister’s secret. Still, my heart naturally fluttered at the prospect of school life with my classmates.\r\n姉さんの秘密を探り出すという使命は、もちろん忘れてはいけない。ただそれでも、同級生との今後の学園生活に、自然と胸が高鳴った。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01aa\")\r\nPLAY_VOICE(\"minato_0211.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"By the way, the boys’ division started last year, right? When classes start, will we get to meet the upperclassmen?\"\r\n「そう言えば、男子部って昨年度からあるんだよね？\r\n    　授業が始まったら、先輩たちとも会うことになるのかな？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0034.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Hmm. Indeed. I’ve heard that classes are credit-based, but I wonder how they’ll proceed with such a small number like this.\"\r\n「む。確かにな。授業は単位制だとは聞いているが、このような少数でどのように授業を進めていくのか気になるところだ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01aa\")\r\nPLAY_VOICE(\"minato_0212.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"By the way, I’ve heard that ‘the boys’ division treatment is worse than Kanikousen.’ Maybe I should ask upperclassmen for survival tips.\"\r\n「そう言えば、『男子部は蟹工船も真っ青なくらい扱いが酷い』って聞いたことがあるよ。 先輩たちから処世術を聞いておいた方がいいかも」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"ogre_0035.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Hmm. That’s useful information. Who told you that? Do you have acquaintances in the academy?\"\r\n「ふむ。それは有用な情報だな。一体誰から聞いたのだ？　学園に知り合いでもいるのか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ca\")\r\nPLAY_VOICE(\"minato_0213.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Huh?\"\r\n「え」]])\r\n\r\nLAYER_LOAD_FACE(\"\")\r\n    MSG([[Who was it again...? As I thought about it, I realized my big blunder.\r\n一体、誰からだったっけ…？\r\n    　少し考えてみたところで、自分の大変なうっかりに気が付いた。]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ga\")\r\nPLAY_VOICE(\"minato_0214.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"R-right! I heard it from Riko on exam day!\"\r\n（そ、そうだ！　入試の日にリコさんから聞いたんだ！）]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01da\")\r\nPLAY_VOICE(\"minato_0215.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"I still haven’t properly apologized to Riko for her sudden departure. I have to apologize...\"\r\n（まだリコさんに急に帰っちゃったことを謝れてない。ちゃんと謝らなきゃ……）]])\r\n\r\nLAYER_LOAD_FACE(\"\")\r\n    MSG([[No matter how much my sister’s matters occupied my mind, forgetting for a whole month was the worst.\r\nいくら姉さんのことで頭がいっぱいだったとは言え、一ヶ月も忘れているなんて最低だ。]])\r\n\r\n    MSG([[Akira is supposed to attend school starting from the upcoming semester. If I see Riko, I’ll ask her to get me her contact info.\r\n週明けの始業式からはアキラも学園に通うはず。\r\n    　リコさんを見かけたら、連絡先を聞いてもらおう。]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"ogre_0036.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Your face is tense. Did you remember something bad?\"\r\n「顔が引きつっているぞ？　よくないことでも思い出したのか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ga\")\r\nPLAY_VOICE(\"minato_0216.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Uh! N-no... yeah.\"\r\n「え！　あ、いや……うん」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0037.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"You’re obvious. I also have a maid attending the girls’ division, but I lack information overwhelmingly. Let’s share the information we each know from now on.\"\r\n「わかりやすい奴め。オレ様も、メイドを一人女子部に通わせてはいるが、情報は圧倒的に不足している。 今後は互いの知る情報を共有し合おうではないか」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ea\")\r\nPLAY_VOICE(\"minato_0217.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Of course. I’ll share any new information I find out.\"\r\n「もちろんだよ。ボクも新しい情報を知ったら伝えるね」]])\r\n\r\nLAYER_LOAD_FACE(\"\")\r\n    MSG([[Ouga and I shook hands again. I’m glad to have someone as reliable as Ouga as a classmate.\r\nボクとオウガくんは改めて握手をした。\r\n    　オウガくんみたいな頼りになるヒトがクラスメイトでよかった。]])\r\n\r\n    MSG([[It felt like I’d gained an ally.\r\n味方が一人増えたような心地だ。]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0038.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"By the way, the maid mentioned something that might be related to you, Minato.\"\r\n「ところで、メイドから聞いた話の中に、ミナトに関係がありそうな内容があったぞ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ca\")\r\nPLAY_VOICE(\"minato_0218.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Huh? Me? What kind of information?\"\r\n「え？　ボクに？　一体どんな情報？」]])\r\n\r\nLAYER_LOAD_FACE(\"\")\r\n    MSG([[Just when I thought the future looked bright, Ouga’s words cast a dark cloud over it.\r\n今後の先行きは明るいと思った矢先。\r\n    　オウガくんの一言で未来が暗雲に包まれる。]])\r\n\r\nPLAY_VOICE(\"ogre_0039.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"There’s a girl named Erika Ikusa among the new students who is apparently being pushed as a ‘Princess’ candidate.\"\r\n「新入生の伊草エリカという女子が、『姫』候補に推されているらしい」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ga\")\r\nPLAY_VOICE(\"minato_0219.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Fugya!?\"\r\n「ふぎゃ！？」]])\r\n\r\nLAYER_LOAD_FACE(\"\")\r\n    MSG([[I couldn’t help but scream.\r\n思わず悲鳴をあげてしまった。]])\r\n\r\n    MSG([[Huh? Huh? What does that mean? It’s not referring to Akira, is it?\r\nえ？　え？　どういうこと？\r\n    　アキラのことを指している……ワケではないよね？]])\r\n\r\n    MSG([[My crossdressed self as Erika Ikusa is a ‘Princess’ candidate? What has happened while I was away?!\r\nボクの女装した姿、伊草エリカが、『姫』候補？\r\n    　ボクがいない間にどうなってしまったって言うの！？]])\r\n\r\nPLAY_VOICE(\"ogre_0040.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"That reaction says you didn’t know. Erika’s popularity reached its peak in just one day.\"\r\n「その反応、やはり知らなかったらしいな。伊草エリカの人気はたった一日で最高潮に達したそうだ」]])\r\n\r\nPLAY_VOICE(\"ogre_0041.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Even your presence in the boys’ division is a topic as her cousin.\"\r\n「男子部のお前の存在まで、従兄として話題になっているらしいぞ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ca\")\r\nPLAY_VOICE(\"minato_0220.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"My... cousin Erika? Why? What happened?\"\r\n「ボク……の従妹のエリカが？　一体どうして？　何があったの？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"ogre_0042.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Have you really heard nothing? Well, I haven’t heard everything myself, but...\"\r\n「本当に何も聞いていないのか？　まぁオレ様もすべてを聞いたワケではないが……」]])\r\n\r\n    MSG([[With that, Ouga began to explain the circumstances.\r\nそう言って、オウガくんは事のいきさつを語り始める。]])\r\n\r\nPLAY_VOICE(\"ogre_0043.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"There was an incident at this morning’s entrance ceremony where a man with a weapon, a madman, caused a disturbance. Erika Ikusa is said to have elegantly handled it.\"\r\n「今朝の入学式で、凶器を手にした変質者の男による乱入騒ぎが起こったらしいのだが、伊草エリカが華麗に解決してみせたらしい」]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,false)\r\n\r\n    --//CI：王子のごとく華麗に敵を倒す雑エリカ 018\r\nLAYER_LOAD(50,\"CI018a\")\r\nLAYER_ALPHA(50,0)\r\nLAYER_POSITION(50,0,-400)\r\nLAYER_MOVE_ALPHA(50,255,500,Ease.OutCubic)\r\nLAYER_MOVE_POSITION(50,0,0,500,Ease.OutCubic)\r\nWAIT(500)\r\n\r\nPLAY_SE(\"SEc025.wav\")\r\n\r\nLAYER_EFFECT(50,6,30,30,800,false)\r\nWAIT(1000)\r\n\r\nLAYER_MOVE_ALPHA(50,0,500,Ease.InCubic)\r\nLAYER_MOVE_POSITION(50,0,400,500,Ease.InCubic)\r\nWAIT(500)\r\n\r\n--SWITCH_SCREEN(\"mask000\",1000,false)\r\n--WAIT(1000)\r\n--LAYER_LOAD(50,\"\")\r\n--SWITCH_SCREEN(\"mask000\",1000,false)\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    SWITCH_SCREEN(\"mask000\",500,false)\r\n\r\nPLAY_VOICE(\"ogre_0044.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Not only that, she shielded students who couldn’t escape, declared ‘I absolutely will protect,’ and successfully caught the culprit.\"\r\n「しかも、ただ解決しただけではない。逃げ遅れた生徒の盾となり、『絶対に守り抜く』と宣言した上で、犯人を見事に捕縛してみせたそうだ」]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0045.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Despite her arm being slashed by the weapon, she reportedly said, ‘The entrance ceremony is more important than myself,’ and went to the hospital alone, ignoring the teachers’ attempts to stop her.\"\r\n「そして凶器で腕を裂かれたにも関わらず、『自分のことより入学式を』と言って、教師が止めるのも聞かずに病院に一人で向かったそうだぞ」]])\r\n\r\nPLAY_VOICE(\"ogre_0046.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Heh heh heh. Your cousin is quite the handsome one, Minato! I don't care for weak females, but I admit I was thrilled by this story!\"\r\n「ふふふ。オマエの従妹は随分と男前ではないか、ミナト！　軟弱なメスには興味がないが、この話には流石にオレ様も心躍ったぞ！」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01fa\")\r\nPLAY_VOICE(\"minato_0221.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Ha, hahaha.\"\r\n「は、ははは」]])\r\n\r\nLAYER_LOAD_FACE(\"\")\r\n    MSG([[The general gist is correct, but it’s heavily dramatized.\r\n大筋は合ってるけど、随分と脚色されている。]])\r\n\r\n    MSG([[Especially when she ran out from the entrance ceremony venue.\r\n特に入学式の会場から飛び出る時。]])\r\n\r\n    MSG([[I did want her to prioritize the entrance ceremony, but more than that, she just wanted to run away... really.\r\n確かに入学式を優先して欲しいとは思ってたけど、それ以上に、ただただ逃げ出したかっただけなんだけどな……。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ca\")\r\nPLAY_VOICE(\"minato_0222.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"(Huh? In this situation, can Akira really attend school as Erika? Is this... a much worse situation than I thought...?)\"\r\n（あれ？　こんな状況でアキラはエリカとして登校できるのかな？　これってまさか……思ったよりずっとマズい状況……？）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"ogre_0047.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"You don’t look pleased. Is there a reason you’re unhappy your cousin gained popularity?\"\r\n「浮かない顔じゃないか。従妹に人気が出て、嬉しくない事情でもあるのか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01fa\")\r\nPLAY_VOICE(\"minato_0223.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Ah, no... Erika didn’t act for popularity, and she’ll probably be confused by all this...\"\r\n「あ、いや……エリカは人気が欲しくて行動したワケじゃないし、きっと困惑するだろうなぁ……って」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"ogre_0048.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"I see. Well, that’s how others’ evaluations are. Not my story, but very few get to sit in the chair they want.\"\r\n「なるほど。まぁ他者からの評価などそういうものだろう。オレ様の話ではないが、自分が座りたい椅子に座れる者はごく僅かだ」]])\r\n\r\nPLAY_VOICE(\"ogre_0049.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Sometimes you end up seated in a chair you don’t want. When Lady Erika is struggling, you should support her.\"\r\n「気付けば、自分の望まぬ椅子に座らざるを得ない時もある。エリカ女史が辛そうな時には、キサマが支えてやるといい」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ea\")\r\nPLAY_VOICE(\"minato_0224.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"...Thank you.\"\r\n「……ありがとう」]])\r\n\r\nLAYER_LOAD_FACE(\"\")\r\n    MSG([[He probably speaks from experience. His words were convincing.\r\n恐らく実体験も踏まえた言葉なんだろう。\r\n    　オウガくんのその言葉には、説得力があった。]])\r\n\r\n    MSG([[I’ll do my best to support her. ...And myself.\r\nがんばって支えていこうと思う。\r\n    　……自分自身を。]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ba\")\r\nPLAY_VOICE(\"minato_0225.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"First, I’ll talk to Akira. After this, I’ll go to Akira’s house and have a strategy meeting.\"\r\n（まずはアキラに相談だね。このあとアキラの家に行って、作戦会議をしよう）]])\r\n\r\nLAYER_LOAD_FACE(\"\")\r\n    MSG([[After chatting for a while, Ouga and I left the classroom.\r\nそのあと、しばらく談笑してからオウガくんとボクは教室をあとにした。]])\r\n\r\n    STOP_BGM(1000)\r\n\r\n    LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\",1000,false)\r\n\r\n    --//BG：男子部校舎前（夜）\r\n    LAYER_LOAD(LAYER_BG, \"BG021ca\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    --//BU：オウガ（通常）\r\n    --LAYER_LOAD(50,\"BU_OGA01aa\")\r\n\r\n    MSG([[The moment we stepped out of the building, I was reminded that I had underestimated the influence of being a 'Princess.'\r\nそして校舎から足を踏み出した途端、自分が「姫」という存在の影響力を甘く考えていたことを思い知らされる。]])\r\n\r\n    PLAY_BGM(\"BGM07.wav\",0)\r\n\r\n    --//BU：オウガ（通常）、モブ女子生徒Ａ・Ｂ・Ｃ\r\n    --LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    SWITCH_SCREEN(\"mask000\",0,false)\r\n    LAYER_LOAD(55,\"BU_MOB04aa\")\r\n    LAYER_LOAD(60,\"BU_MOB05aa\")\r\n    LAYER_LOAD(65,\"BU_MOB06aa\")\r\n    LAYER_POSITION(55,-400,0)\r\n    LAYER_POSITION(60,200,0)\r\n    LAYER_POSITION(65,800,0)\r\n    LAYER_ALPHA(55,0)\r\n    LAYER_ALPHA(60,0)\r\n    LAYER_ALPHA(65,0)\r\n    LAYER_MOVE_ALPHA(55,255,500,Ease.OutCubic)\r\n    LAYER_MOVE_ALPHA(60,255,500,Ease.OutCubic)\r\n    LAYER_MOVE_ALPHA(65,255,500,Ease.OutCubic)\r\n    LAYER_MOVE_POSITION(55,-600,0,500,Ease.OutCubic)\r\n    LAYER_MOVE_POSITION(60,0,0,500,Ease.OutCubic)\r\n    LAYER_MOVE_POSITION(65,600,0,500,Ease.OutCubic)\r\n    WAIT(500)\r\n\r\nPLAY_VOICE(\"schoolgirl_0028.wav\")\r\n    MSG([[\r\n【Female Student】\r\n \"They came out! Erika Ikusa’s cousin!\"\r\n「出てきたわ！　伊草エリカさんの従兄よ！」]])\r\n\r\nPLAY_VOICE(\"schoolgirl_0029.wav\")\r\n    MSG([[\r\n【Female Student】\r\n \"Wait! We have questions for you!\"\r\n「お待ちなさい！　アナタに聞きたいことがありますわ！」]])\r\n\r\nPLAY_VOICE(\"schoolgirl_0030.wav\")\r\n    MSG([[\r\n【Female Student】\r\n \"What kind of person is Erika Ikusa? Explain in detail!\"\r\n「伊草エリカさんはどのような方ですの？\r\n    　詳しく説明なさい！」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ca\")\r\nPLAY_VOICE(\"minato_0226.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"U-uh!\"\r\n「う、うわぁ！」]])\r\n\r\nLAYER_LOAD_FACE(\"\")\r\n    MSG([[Girls pressed up with such force I stumbled back.\r\n後ずさってしまうような圧で、女の子たちが迫ってきた。]])\r\n\r\n    MSG([[All of them held what looked like voice recorders or notebooks. Do they want to ask about Erika?\r\n全員ボイスレコーダーらしき機械やメモ帳を手にしている。\r\n    　エリカのことを聞きたい、のかな？]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ga\")\r\nPLAY_VOICE(\"minato_0227.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"I-I don't have anything to answer about that...\"\r\n「ボ、ボクから答えられることは、ないんですけどぉ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"schoolgirl_0031.wav\")\r\n    MSG([[\r\n【Female Student】\r\n \"Answer anything you can!\"\r\n「何でもいいから答えるのです！」]])\r\n\r\nPLAY_VOICE(\"schoolgirl_0032.wav\")\r\n    MSG([[\r\n【Female Student】\r\n \"We’re the newspaper club, and we have an obligation to investigate and publish information on ‘Princess’ candidates as quickly as possible!\"\r\n「我々新聞部は『姫』候補の情報を一刻も早く調べ上げて公開する義務があるんですの！」]])\r\n\r\nPLAY_VOICE(\"schoolgirl_0033.wav\")\r\n    MSG([[\r\n【Female Student】\r\n \"Height? Weight? Likes and hobbies? Do they have a boyfriend or girlfriend? Tell us everything you know before we let you pass!\"\r\n「身長は？　体重は？　好きなものや趣味は？　彼氏、もしくは彼女はいるんですの？　アナタが知っていることをすべて話すまで、通しませんわ！」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01da\")\r\nPLAY_VOICE(\"minato_0228.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Eek...\"\r\n「ひぃ…」]])\r\n\r\nLAYER_LOAD_FACE(\"\")\r\n    MSG([[The girls surrounded me as if to block my way. Although I doubt it, the atmosphere made it seem like they’d beat me up if I resisted.\r\n通せん坊するみたいにボクを囲う女の子たち。\r\n    　流石にないとは思うけど、歯向かおうものなら袋叩きにされそうな雰囲気すらある。]])\r\n\r\n    MSG([[Erika Ikusa’s popularity might be much higher than I thought.\r\n伊草エリカの人気は、ボクが思ったよりもずっと高まっているのかもしれない。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01da\")\r\nPLAY_VOICE(\"minato_0229.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"I can’t exactly say, ‘It’s me!’... what should I do...?\"\r\n（まさか、ボク自身です！　なんて言えないし……どうすればいいんだろう……）]])\r\n\r\nPLAY_VOICE(\"minato_0230.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"This is punishment for giving in to my emotions at the entrance ceremony... ugh, I’m such an idiot...\"\r\n（入学式で感情に身をまかせてしまった罰だよね……ううっ、ボクはなんてバカなんだ……）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(55,\"\")\r\n    LAYER_LOAD(60,\"\")\r\n    LAYER_LOAD(65,\"\")\r\n    LAYER_LOAD(LAYER_BG,\"BG021ce\")\r\n    LAYER_LOAD(50,\"BUL_OGA01pa\")\r\n    SWITCH_SCREEN(\"mask025\",500,false)\r\n\r\nPLAY_VOICE(\"ogre_0050.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Haaaa-ha ha ha!!\"\r\n「ハァーーーーハッハッハ！！」]])\r\n\r\n    MSG([[While I was at a loss, Ouga suddenly opened his jacket. Myself and the girls jumped in surprise at this unexpected act.\r\n困り果てていると、おもむろに隣のオウガくんが服の前側を開き、はだけ始めた。\r\n    　予想外の行動にボクも女の子たちも思わず跳び上がる。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ca\")\r\nPLAY_VOICE(\"minato_0231.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Ouga!?\"\r\n「オウガくん！？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(LAYER_BG,\"BG021ca\")\r\n    LAYER_LOAD(50,\"BU_OGA01pa\")\r\n    LAYER_POSITION(50,-700,0)\r\n    LAYER_LOAD(55,\"BU_MOB04aa\")\r\n    LAYER_LOAD(60,\"BU_MOB05aa\")\r\n    LAYER_LOAD(65,\"BU_MOB06aa\")\r\n    LAYER_POSITION(55,0,0)\r\n    LAYER_POSITION(60,400,0)\r\n    LAYER_POSITION(65,800,0)\r\n    SWITCH_SCREEN(\"mask000\",500,false)\r\n\r\nPLAY_VOICE(\"schoolgirl_0034.wav\")\r\n    MSG([[\r\n【Female Student】\r\n \"Kyaaahhhhh!?\"\r\n「きゃーーーーーーー！？」]])\r\n\r\nPLAY_VOICE(\"schoolgirl_0035.wav\")\r\n    MSG([[\r\n【Female Student】\r\n \"W-what is this guy doing!?\"\r\n「な、何をしていますのコイツーーーー！？」]])\r\n\r\nPLAY_VOICE(\"schoolgirl_0036.wav\")\r\n    MSG([[\r\n【Female Student】\r\n \"H-hide your body quickly and button up! You beast!\"\r\n「さ、さっさとボタンをしめて身体を隠しなさい！　このケダモノ！」]])\r\n\r\n    MSG([[Ouga crept closer to the girls who shouted with mingled anger and fear.\r\n怒りと恐怖が混じった声をあげる女の子たちへ、オウガくんがじりじりとにじり寄る。]])\r\n\r\nPLAY_VOICE(\"ogre_0051.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Rejoice! There are no ‘Princess’ candidates here, but the King is present! Take as many pictures as you want of my well-trained body!\"\r\n「喜べ！　『姫』候補はいないが、王はいるぞ！　オレ様のこの鍛え上げた肉体を存分に写真に収めるといい！」]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    LAYER_POSITION(50,-700,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0052.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Today’s recommendation is definitely these forearm extensors. Burn this beautiful muscle, reminiscent of a Roman sculpture, into your eyes!\"\r\n「本日のオススメは何といってもこの前腕伸筋群だな。さぁ、まるでローマの彫刻像を思わせるこの美しい筋肉を目に焼きつけるがいいッ！」]])\r\n\r\nPLAY_VOICE(\"schoolgirl_0037.wav\")\r\n    MSG([[\r\n【Female Student】\r\n \"Gyaaaaaaaaahhhhhhh!!!!!!!\"\r\n「ぎゃあああああああああああああああ！！！！」]])\r\n\r\n    SWITCH_SCREEN(\"mask000\",0,false)\r\n    LAYER_MOVE_ALPHA(55,0,500,Ease.InCubic)\r\n    LAYER_MOVE_ALPHA(60,0,500,Ease.InCubic)\r\n    LAYER_MOVE_ALPHA(65,0,500,Ease.InCubic)\r\n    LAYER_MOVE_POSITION(55,200,0,500,Ease.InCubic)\r\n    LAYER_MOVE_POSITION(60,600,0,500,Ease.InCubic)\r\n    LAYER_MOVE_POSITION(65,1000,0,500,Ease.InCubic)\r\n    LAYER_MOVE_POSITION(50,0,0,1000,Ease.OutQuad)\r\n    WAIT_INPUT(1000)\r\n    LAYER_LOAD(55,\"\")\r\n    LAYER_LOAD(60,\"\")\r\n    LAYER_LOAD(65,\"\")\r\n\r\n    --//BU：オウガ（高笑い）\r\n    LAYER_LOAD(50,\"BU_OGA01pa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\n    MSG([[The girls fled in all directions. I exhaled in relief, having escaped a crisis.\r\n女の子たちは一目散に逃げていった。\r\n    　何とか窮地を脱することができて、ボクはホッと胸を撫で下ろす。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ea\")\r\nPLAY_VOICE(\"minato_0232.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Thanks, Ouga. You saved me.\"\r\n「ありがとう、オウガくん。おかげで助かったよ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0053.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Don’t mention it. I just dislike such immodest females.\"\r\n「気にするな。あのような慎みのないメスどもは好かんだけのこと」]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"ogre_0054.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Tell Lady Erika: the outcome may have been unwanted. She may face hardships and turmoil from now on.\"\r\n「エリカ女史に伝えておいてくれ。望まぬ結果となったかもしれぬ。これから苦労し、思い悩むことになるかもしれぬ」]])\r\n\r\nPLAY_VOICE(\"ogre_0055.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"But even so! Your actions were right!\"\r\n「だがそれでも！　貴女の行動は正しかった！　とな」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01aa\")\r\nPLAY_VOICE(\"minato_0233.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"...Yeah. Thanks, really. I’ll tell her. Erika will definitely be glad.\"\r\n「……うん。ありがとう、本当に。伝えておくね。\r\n    　エリカも絶対に喜んでくれるよ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[Ouga was right. There’s no use regretting it.\r\nオウガくんの言う通りだ。\r\n    　後悔したって仕方がない。]])\r\n\r\n    MSG([[What I did at the entrance ceremony was the best option. If I hadn’t rushed out, Hiyu might have been injured.\r\nあの入学式ではアレが最善だった。\r\n    　ボクが飛び出さなきゃ、ヒユさんが怪我をしていたかもしれないんだ。]])\r\n\r\n    MSG([[Rather than regret, I should think about what to do next.\r\n後悔するよりも、これからどうするかを考えよう。]])\r\n    --　　　　　◆\r\n\r\nSTOP_BGM(1000)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"EP02_03\")\r\n\r\nend\r\n"
}