{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP03_09",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP03/EP03_09.lua",
  "Text": "function EP03_09()\r\n    --.起-7【7月第4週】「異変」\r\n    SaveData.Title = \"異変\"\r\n\r\n    --//BG：男子部教室\r\n    LAYER_LOAD(LAYER_BG, \"BG015aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM03.wav\")\r\n\r\n    MSG([[Today, the boys' club gathered earlier than usual and started preparing the necessary documents for the Hakuyou Festival event.\r\n今日の男子部は、普段よりも早い時間から集合し、白陽祭の出し物の必要書類の準備に取り掛かった。]])\r\n    --//BU：オウガ（通常）、先輩たち（通常）\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    LAYER_POSITION(50,400,0)\r\n    LAYER_LOAD(55,\"BU_MAA01aa\")\r\n    LAYER_POSITION(55,-400,0)\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"ogre_0136.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"Alright, all that's left is to submit the documents.\"\r\n通常\r\n    「よし、あとは書類を提出するだけだな」]])\r\n\r\nPLAY_VOICE(\"ogre_0137.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"Thanks to Minato working with Miss Erika to fill out the sections that the girls' club needed, it really helped.\"\r\n通常\r\n    「ミナトがエリカ女史と協力し、女子部側での記入が必要な項目を埋めてくれたおかげで助かったぞ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ea\")\r\nPLAY_VOICE(\"minato_0444.wav\")\r\n    MSG([[\r\n【Minato】\r\nSmile \"The girls' club seems really cooperative too. Maybe everyone wanted to cooperate with the boys' club somewhere deep down.\"\r\n笑顔\r\n    「女子部側もスゴく協力的らしいよ。みんなどこかで、男子部との協力を望んでいたのかもしれないね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"senpai1_0048.wav\")\r\n    MSG([[\r\n【Mask Senpai #1】\r\nNormal \"Don’t let your guard down.\"\r\n通常\r\n    「油断は禁物だぞ」]])\r\n\r\n    MSG([[Mask Senpai #1 warned me seriously.\r\n１号先輩が真面目な口調でボクに忠告した。]])\r\n\r\nPLAY_VOICE(\"senpai1_0049.wav\")\r\n    MSG([[\r\n【Mask Senpai #1】\r\nNormal \"The first-years being cooperative is all thanks to Miss Erika.\"\r\n通常\r\n    「１年生が協力的なのはエリカ殿のおかげだ」]])\r\n\r\nPLAY_VOICE(\"senpai2_0029.wav\")\r\n    MSG([[\r\n【Mask Senpai #2】\r\nNormal \"The second-years and above, who witnessed our sexual harassment incident firsthand, surely hold deep hostility toward the boys' club.\"\r\n通常 「我らのセクハラ事件を目の当たりにした２年生以上は、男子部に対して深い敵意を抱いているでござろう」]])\r\n\r\nPLAY_VOICE(\"senpai3_0032.wav\")\r\n    MSG([[\r\n【Mask Senpai #3】\r\nNormal \"Though we are the culprits... it's not really our place to say that.\"\r\n通常\r\n    「張本人のオレたちが……言うことではないがな」]])\r\n\r\nPLAY_VOICE(\"ogre_0138.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"Exactly right. You guys are one reason the girls' club dislikes us.\"\r\n通常\r\n    「まったくその通りだ。女子部に嫌われた一因はキサマらであろうが」]])\r\n\r\nPLAY_VOICE(\"mix_0006\")\r\n    MSG([[\r\n【Seniors】\r\nNormal \"Yes...\"\r\n通常\r\n    「はい…」]])\r\n    --//BU：オウガ（通常）、先輩たち（通常）\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    LAYER_POSITION(50,400,0)\r\n    LAYER_LOAD(55,\"BU_MAA01aa\")\r\n    LAYER_POSITION(55,-400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01da\")\r\nPLAY_VOICE(\"minato_0445.wav\")\r\n    MSG([[\r\n【Minato】\r\nSadness \"Ouga-kun, that’s too harsh. The seniors are reflecting on it now, you know.\"\r\n悲しみ\r\n    「オウガくん、言い過ぎだよ。先輩たちも、今は反省しているんだから」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"ogre_0139.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"I know that too. Because the current boys' club troubles stem from our past debts, I'm saying we must give it our all.\"\r\n通常\r\n    「それもわかっている。今の男子部の苦境が、我々の過去の負債に起因しているからこそ、全力で臨むと言っているのだ」]])\r\n\r\n    MSG([[Ouga confidently poked his thick chest with his thumb. Then, as usual, he wore a confident smile.\r\nオウガくんが自信満々に自らの分厚い胸板へ親指を突きつける。\r\n    　そしていつも通り、自信たっぷりの笑みを浮かべた。]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    LAYER_POSITION(50,400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0140.wav\")\r\n\r\n    MSG([[\r\n【Ouga】\r\nSmile \"I'll provide the seniors with the best chance to redeem themselves from infamy by putting on a joint play with the girls' club.\"\r\n笑顔 「女子部との合同での演劇という最高の汚名返上の機会を、先輩らに設けてみせよう」]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01pa\")\r\n    LAYER_POSITION(50,400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0141.wav\")\r\n\r\n    MSG([[\r\n【Ouga】\r\nLaughter \"Leave everything to me! Haaa—hahaha!\"\r\n高笑い\r\n    「このオレ様にすべてまかせておけばいいのだ！\r\n    　ハァーーーハッハッハッハァッ！」]])\r\n\r\n    MSG([[Hearing that usual laugh, I felt a little relieved. Ouga had genuinely thought about the seniors in his own way.\r\nそのいつも通りの笑い声を聞き、少し安心する。\r\n    　オウガくんなりに、ちゃんと先輩たちのことも考えてくれていたんだ。]])\r\n\r\n    LAYER_LOAD(55,\"\")\r\n    LAYER_LOAD(50,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,false)\r\n\r\n    --//SE：引き戸の音\r\nPLAY_SE(\"SEb004.wav\")\r\nWAIT(300)\r\n\r\n    --//BU：ダリア（通常）\r\n    LAYER_LOAD(55,\"BU_DAR01aa\")\r\n    LAYER_POSITION(55,600,0)\r\n    LAYER_MOVE_POSITION(55,400,0,500,Ease.OutSine)\r\n    SWITCH_SCREEN(\"mask000\",500,false)\r\n\r\nPLAY_VOICE(\"dahlia_0120.wav\")\r\n    MSG([[\r\n【Daria】\r\nNormal \"Sorry to keep you waiting. I got permission, so it’s okay to enter the girls' club building now.\"\r\n通常\r\n    「やあ、おまたせ。許可をもらってきたから、今なら女子部の校舎へ入っても大丈夫だよ」]])\r\n\r\n    MSG([[Daria opened the classroom door and appeared. The boys' club are generally prohibited from contacting the girls' club and entering their building.\r\nダリアさんが教室の戸を開いて現れた。 男子部は原則女子部との接触は禁止であり、校舎も立ち入り禁止。]])\r\n\r\n    MSG([[To submit the documents inside, prior staff permission was necessary.\r\n書類を提出しに校舎へ入るためにも、職員の事前の許可が必要なんだ。]])\r\n\r\nPLAY_VOICE(\"dahlia_0121.wav\")\r\n    MSG([[\r\n【Daria】\r\nNormal \"Uran is still organizing the documents in the Japanese-style room, so if the representative goes to submit, there shouldn’t be any problem receiving them.\"\r\n通常 「今ウランくんが和室に残って書類の整理をしているから、代表者が提出に向かえば問題なく受理してもらえるはずだ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ea\")\r\nPLAY_VOICE(\"minato_0446.wav\")\r\n    MSG([[\r\n【Minato】\r\nSmile \"Thank you very much, Daria-san! To do this much for the boys' club...\"\r\n笑顔\r\n    「ありがとうございます、ダリアさん！　男子部のために、ここまでしてくれるなんて……」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(55,\"BU_DAR01ea\")\r\n    LAYER_POSITION(55,400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0122.wav\")\r\n\r\n    MSG([[\r\n【Daria】\r\nSmile \"Don’t say such formal things. You and I play together almost every day, don't we?\"\r\n笑顔 「水臭いことを言わないでくれよ。 私とキミたちは、毎日のように戯れる仲じゃないか」]])\r\n\r\n    LAYER_LOAD(55,\"BU_DAR01aa\")\r\n    LAYER_POSITION(55,400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0123.wav\")\r\n\r\n    MSG([[\r\n【Daria】\r\nNormal \"As I hold the position of ‘Princess’, I can’t openly promote interaction with the boys' club, but this level of cooperation is no trouble at all.\"\r\n通常 「私にも『姫』という立場がある以上、大々的に男子部との交流を促すのは難しいけれど、この程度の協力はお安い御用さ」]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    LAYER_POSITION(50,-400,0)\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\nPLAY_VOICE(\"ogre_0142.wav\")\r\n\r\n    MSG([[\r\n【Ouga】\r\nSmile \"Thanks for your cooperation, Daria Himegami. I’ll repay this debt tenfold in tonight’s game.\"\r\n笑顔\r\n    「協力に感謝する、姫神ダリア。この借りは今夜のゲームで十倍にして返そう」]])\r\n\r\n    LAYER_LOAD(55,\"BU_DAR01ea\")\r\n    LAYER_POSITION(55,400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0124.wav\")\r\n\r\n    MSG([[\r\n【Daria】\r\nSmile \"Your debts are almost at their limit. I expect early repayment from you.\"\r\n笑顔\r\n    「キミへの貸しもそろそろ限度いっぱいだ。早期の返済をよろしく頼みたいものだね」]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(55,\"\")\r\n    LAYER_LOAD(60,\"\")\r\n    LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n    SWITCH_SCREEN(\"mask001\",1000,false)\r\n\r\n    --//BG：男子部校舎前\r\n    LAYER_LOAD(LAYER_BG, \"BG021ba\")\r\n    SWITCH_SCREEN(\"mask001\" , 1000,false)\r\n\r\n    --//BG：校舎前\r\n    LAYER_LOAD(LAYER_BG, \"BG011ba\")\r\n    SWITCH_SCREEN(\"mask001\" , 1000,false)\r\n\r\n    --//BG：1F廊下（夕方）\r\n    LAYER_LOAD(LAYER_BG, \"BG013ba\")\r\n    SWITCH_SCREEN(\"mask001\" , 1000,false)\r\n\r\n    MSG([[Representing the boys' club, Ouga and I headed to the girls' club to submit the documents.\r\n男子部を代表して、オウガくんとボクとで女子部に書類の提出に向かうこととなった。]])\r\n\r\n    MSG([[We walked side by side down the first-floor hallway with the Japanese-style room. Though I’m used to this hallway now, walking here with my real face for the first time since the entrance ceremony felt a little fresh. My heart was pounding.\r\n和室のある一階の廊下を、オウガくんと二人で並んで歩いていく。 もうすっかり歩きなれた廊下だけど、素顔で歩くのは入学式以来なので、ちょっと新鮮。胸がドキドキしてしまう。]])\r\n\r\n    --//BU：オウガ（通常）\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[But Ouga, who should be walking here for the first time, was as composed as ever—a truly strong heart.\r\nでもボクの隣のオウガくんは、初めて歩くはずなのに普段通り堂々としていて、流石の強心臓だ。]])\r\n\r\nPLAY_VOICE(\"ogre_0143.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"Hold your chest high, Minato. We have nothing to be ashamed of.\"\r\n通常\r\n    「胸を張れ、ミナト。オレ様たちは何も後ろ暗いことはしていないのだ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01fc\")\r\nPLAY_VOICE(\"minato_0447.wav\")\r\n    MSG([[\r\n【Minato】\r\nWry smile \"Y-yeah, that’s true.\"\r\n苦笑\r\n    「う、うん、そうだよね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"ogre_0144.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"By the way, I’ve wondered since the boys' club, why have you been carrying your bag tucked under your arm all day?\"\r\n通常\r\n    「ところで、男子部の時から気になっていたのだが、どうして今日は常にバッグを小脇に抱えているんだ？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ga\")\r\nPLAY_VOICE(\"minato_0448.wav\")\r\n    MSG([[\r\n【Minato】\r\nFlustered \"Th-this? Well, umm, actually Erika asked me to run an errand for a book. I’m carrying the bag to make sure I don’t forget the book I bought.\"\r\n焦り 「こ、これ？　え、えーっと実は、エリカから本のお使いを頼まれてて。買った本を忘れて帰らないよう、このバッグに入れて持ち歩いてるというか、なんというか」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0145.wav\")\r\n\r\n    MSG([[\r\n【Ouga】\r\nSmile \"I see. Since you sometimes make silly mistakes, that’s a smart precaution.\"\r\n笑顔\r\n    「なるほど。ミナトは時おり凡ミスをするからな。いい対策だ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ga\")\r\nPLAY_VOICE(\"minato_0449.wav\")\r\n    MSG([[\r\n【Minato】\r\nFlustered \"Ah, hahaha.\"\r\n焦り\r\n    「あ、あはは」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I was startled by the unexpected comment. The bag is actually packed with my uniform and makeup items for cross-dressing.\r\n思わぬ指摘にドキリとしてしまった。\r\n    　実はバッグの中には制服やメイク道具などの女装用具がぎっしり詰まっている。]])\r\n\r\n    MSG([[Today, there was a discussion scheduled right after the girls' club in the boys' club, so I couldn’t return home. I undressed from cross-dressing in the multipurpose restroom.\r\n今日は女子部の直後に男子部で話し合いの予定があって、家に帰る時間がとれなかった関係上、多目的トイレで女装を解いたんだ。]])\r\n\r\n    MSG([[I managed to remove everything without issue, but after becoming my real self, I realized I hadn’t thought at all about where to hide the discarded uniform and cross-dressing items.\r\n大きな問題もなく女装は解けたけど、脱いだ制服と女装用具の隠し場所をまったく考えていなかったことに、素顔になってから気が付いた。]])\r\n\r\n    MSG([[In the end, I decided to carry them with me at all times—that’s how today went.\r\nそして結局、肌身離さず持ち歩くことにした……というのが今日の経緯。]])\r\n\r\n    MSG([[As Ouga said, I am too careless.\r\nオウガくんの言う通り、ボクはうっかり屋過ぎると思う。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01fc\")\r\nPLAY_VOICE(\"minato_0450.wav\")\r\n    MSG([[\r\n【Minato】\r\nWry smile \"But still, Ouga-kun is amazing. Even though it’s his first time walking in the girls' club, he’s so confident.\"\r\n苦笑\r\n    「でも、やっぱりオウガくんはスゴいよ。女子部を歩くなんて初めてのはずなのに、そんなに堂々としていて」]])\r\n\r\nPLAY_VOICE(\"minato_0451.wav\")\r\n    MSG([[\r\n【Minato】\r\nWry smile \"I’m scared, and my legs are shaking right now.\"\r\n苦笑\r\n    「ボクなんか、怖くて今にも足が震えそうなのに」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0146.wav\")\r\n\r\n    MSG([[\r\n【Ouga】\r\nNormal \"Hmph, I think you and Miss Erika are the impressive ones.\"\r\n通常\r\n    「ふっ、お前やエリカ女史の方が大したモノだと思うがな」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ca\")\r\nPLAY_VOICE(\"minato_0452.wav\")\r\n    MSG([[\r\n【Minato】\r\nSurprised \"W-what do you mean?\"\r\n驚き\r\n    「ど、どういうこと？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    --//SE：乱暴に頭を撫でる音\r\nPLAY_SE(\"SEa029.wav\")\r\nWAIT(500)\r\n\r\n    MSG([[Ouga laughed, patting my head roughly.\r\nオウガくんがボクの頭をガシガシと撫でて笑う。]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0147.wav\")\r\n\r\n    MSG([[\r\n【Ouga】\r\nSmile \"I can tell just by watching that your family has a timid nature. But both you and Miss Erika take a step forward when it counts, right?\"\r\n笑顔 「お前たち一家が臆病な気質であることは見ていればわかる。しかし、ミナトもエリカ女史も、肝心な時には一歩前に踏み出すであろう？」]])\r\n\r\nPLAY_VOICE(\"ogre_0148.wav\")\r\n    MSG([[\r\n【Ouga】\r\nSmile \"Just like you’re beside me now. Just like Miss Erika fought through the Princess Election. You move forward on shaky legs.\"\r\n笑顔\r\n    「今オレ様の横へ付いてきてくれているように。エリカ女史が姫選挙を戦い抜いたように。お前たちは震える足で前に進むのだ」]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0149.wav\")\r\n\r\n    MSG([[\r\n【Ouga】\r\nNormal \"That fearful step forward is heavy. It’s different from a fearless man born as a king like me—it's genuine courage.\"\r\n通常\r\n    「恐れながらも踏み出すその一歩は重い。オレ様のように王として生まれ、怖い者なしの男とはまた違う、等身大の勇気だ」]])\r\n\r\nPLAY_VOICE(\"ogre_0150.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"Even if others don’t see it, I appreciate it. Having a brave friend like you makes me truly happy.\"\r\n通常\r\n    「他の者が見ていずともオレ様が評価しよう。お前のような勇敢な友人を持てて、オレ様は心から嬉しく思うぞ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ja\")\r\nPLAY_VOICE(\"minato_0453.wav\")\r\n    MSG([[\r\n【Minato】\r\nCry laugh \"Ouga-kun...\"\r\n泣き笑い\r\n    「オウガくん……」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0151.wav\")\r\n\r\n    MSG([[\r\n【Ouga】\r\nSmile \"That crybaby trait is a bit annoying though. Now, before today’s class starts, let’s quickly deliver the documents to Uran Ryuguuin.\"\r\n笑顔 「その泣き虫だけは少々いただけないがな。さぁ、今日の授業が始まる前に、さっさと書類を龍宮院ウランに届けてしまうぞ」]])\r\n\r\n    MSG([[And while chatting, we arrived at the Japanese-style room. Ouga instructed me to wait outside and went in alone holding the documents.\r\nそして雑談をしている間に和室へ到着。\r\n    　オウガくんはボクに部屋の前で待つよう指示し、書類を片手に一人で入ろうとする。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ga\")\r\nPLAY_VOICE(\"minato_0454.wav\")\r\n    MSG([[\r\n【Minato】\r\nFlustered \"A-alone is okay? Isn’t it smoother if I, Erika’s cousin, go in with you...?\"\r\n焦り\r\n    「ひ、一人で平気？　エリカの従兄のボクも入った方が、話がスムーズなんじゃ……」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"ogre_0152.wav\")\r\n    MSG([[\r\n【Ouga】\r\nSmile \"With your legs shaking? Don’t be stubborn.\"\r\n笑顔\r\n    「足が震えているのにか？　強がるのはよせ」]])\r\n\r\n    MSG([[Pointed out, I finally noticed my trembling legs.\r\n指摘されて、やっと自分の足の震えに気が付いた。]])\r\n\r\n    MSG([[I had been trying not to think about it, but talking up close to Uran in my real face carried a high risk of being discovered.\r\n考えないようにしていたことだけど、素顔でウランさんと間近で話すのは、正体がバレるリスクを多分に含んでいる。]])\r\n\r\n    MSG([[My body might be reacting out of fear.\r\n身体が怯えてしまっているのかもしれない。]])\r\n\r\nPLAY_VOICE(\"ogre_0153.wav\")\r\n    MSG([[\r\n【Ouga】\r\nSmile \"You don’t need to push yourself just to hand over one document. Wait outside the room.\"\r\n笑顔\r\n    「書類を１枚出すのに無理することもあるまい。ミナトは部屋の前で待機していてくれ」]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0154.wav\")\r\n\r\n    MSG([[\r\n【Ouga】\r\nNormal \"Besides... Uran Ryuguuin and I have a complicated situation. Since this is a good chance, I’ll talk to her alone.\"\r\n通常\r\n    「それに……龍宮院ウランとオレ様の間には、少々込み入った事情があってな。せっかくの機会だから二人で話をするのもいいさ」]])\r\n\r\n    MSG([[Saying that, Ouga opened the door and entered the room.\r\nそう言うと、オウガくんは和室の扉を開けて入室した。]])\r\n\r\n    MSG([[Just before the door closed, he said to me:\r\n扉が閉まる直前に、ボクにこう言い残して。]])\r\n\r\nPLAY_VOICE(\"ogre_0155.wav\")\r\n    MSG([[\r\n【Ouga】\r\nNormal \"If anything happens, I’m counting on you, Minato.\"\r\n通常\r\n    「万が一何かあった時はよろしく頼むぞ、ミナト」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ba\")\r\nPLAY_VOICE(\"minato_0455.wav\")\r\n    MSG([[\r\n【Minato】\r\nSerious \"Yeah, leave it to me.\"\r\n真剣\r\n    「うん、まかせて」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nSTOP_BGM(1000)\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\",1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    --//BG：1F廊下（夜）\r\n    LAYER_LOAD(LAYER_BG, \"BG013ca\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    --//SE：虫の鳴き声\r\nPLAY_SE(\"SEe005.wav\")\r\nWAIT(500)\r\n\r\n    MSG([[However, Ouga didn’t come back for a long time. The sun had already set, and the boys' club class start time had long passed.\r\nしかし、オウガくんはなかなか戻ってこなかった。\r\n    　もうすっかり日は沈み、男子部の授業開始時刻もとうに過ぎている。]])\r\n\r\n    MSG([[Could something have happened? I felt an unusual unease that wouldn’t stop.\r\n何かがあったのだろうか。\r\n    　何だか、妙な胸騒ぎがして、止まらない。]])\r\n\r\nSTOP_SE(\"SEe005.wav\")\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ba\")\r\nPLAY_VOICE(\"minato_0456.wav\")\r\n    MSG([[\r\n【Minato】\r\nSerious (It’s taking way too long. Maybe I should go inside... but then again, I might not be of any help once I’m inside.)\r\n真剣\r\n    （流石に時間がかかり過ぎだ。ボクも中に入った方がいいかな……いやでも、ボクが入ったところで、何の手助けにもならないかもしれない）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Should I act or not? Time passed while I kept debating when suddenly—\r\n行動を起こすべきか否か。\r\n    　悩み続け、時間ばかりが過ぎていた、その時――]])\r\n\r\nPLAY_VOICE(\"ogre_0156.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"I said this is no time to worry about home!\"\r\n「家のことは今関係がないと言っているだろうが！」]])\r\n\r\nPLAY_VOICE(\"uran_0119.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Your arrogance is what troubles us!\"\r\n「アナタのその傲慢さが我々を苦しめると言っているのです！」]])\r\n\r\nPLAY_VOICE(\"uran_0120.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"It seems you will have no choice but to be suspended after all!\"\r\n「やはりアナタには謹慎していただく他ないようですわね！」]])\r\n\r\n    MSG([[From inside the Japanese-style room came the angry voices of two familiar people. Moreover, the conversation included the ominous word ‘suspension.’\r\n和室の中からよく知る二人の怒声が聞こえてきた。 しかもその会話の中には、『謹慎』という不穏なワードまで含まれていた。]])\r\n\r\n    --//SE：暴れる音（ドタバタ）\r\nPLAY_SE(\"SEa027.wav\")\r\nWAIT(800)\r\n\r\n    MSG([[Then sounds of a violent struggle could be heard.\r\n更に、暴れ回るような音まで聞こえてくる。]])\r\n\r\n    MSG([[Clearly something’s wrong. I can’t just leave it be.\r\n明らかに様子が変だ。\r\n    　もう放ってなんていられない。]])\r\n\r\n    MSG([[Although Uran is a ‘Princess’, and I might not be able to do anything in my real face, I must enter the room immediately!\r\n相手が『姫』であるウランさんである以上、素顔のボクじゃ何もできないかもしれないけれど。\r\n    　今すぐに、部屋の中へと入らないと！]])\r\n\r\n    MSG([[But then—another option appeared in my head.\r\nでもその時――頭の中にもうひとつの選択肢が生まれた。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ca\")\r\nPLAY_VOICE(\"minato_0457.wav\")\r\n    MSG([[\r\n【Minato】\r\nSurprised \"If I were in Erika’s form... maybe I could resolve this trouble.\"\r\n驚き\r\n    「エリカの姿でなら……トラブルを解決できるんじゃ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[That’s right. I have no power at all.\r\nそうだ。\r\n    　ボクには何の力もない。]])\r\n\r\n    MSG([[But ‘Erika Ikusa’ has the same authority as Uran-san.\r\nでも“伊草エリカ”には、ウランさんと同等の権力がある。]])\r\n\r\n    MSG([[And fortunately, the bag I’m holding contains my cross-dressing tools.\r\nそして幸運なことに、今ボクが手に持つカバンには、女装用具があるじゃないか。]])\r\n\r\n    MSG([[If I go to the multipurpose restroom on the field now, cross-dress, and come back, that should be enough time.\r\n今からグラウンドの多目的トイレに行って、女装して戻ってくるまで恐らく十分。]])\r\n\r\n    MSG([[It’s do or die: enter the room now, or take the time to cross-dress and return.\r\nイチかバチか、今すぐに部屋の中へ入るか。\r\n    　時間をかけてでも、女装をして戻ってくるか。]])\r\n\r\n    MSG([[In this clearly dangerous situation, what I should do was obvious.\r\nこの明らかにマズい状況で、自分のとるべき行動は明白だった。]])\r\n\r\n    -- //SE：走る音\r\n    PLAY_SE(\"SEa015.wav\")\r\n\r\n    MSG([[As soon as I decided, I started running. I couldn’t afford to worry about appearances anymore.\r\n決めると同時に走り出す。\r\n    　もう今はなりふり構っていられない。]])\r\n\r\n    MSG([[Right now, I must cross-dress and, as Erika Ikusa, save Ouga-kun from his crisis.\r\n今すぐに女装して、“伊草エリカ”として、オウガくんの窮地を救うんだ。]])\r\n\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask030\" , 500,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"EP03_10\")\r\n\r\nend\r\n"
}