{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP03_12",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP03/EP03_12.lua",
  "Text": "function EP03_12()\r\n    --.承-2【8月第1週】「分裂」\r\n    SaveData.Title = \"分裂\"\r\n\r\n    --//BG：1-A教室（昼）\r\n    LAYER_LOAD(LAYER_BG, \"BG014aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM02.wav\")\r\n\r\n    MSG([[One week has passed since summer vacation began. The script has been completed, and the casting has been decided smoothly.\r\n夏休みが始まって一週間。\r\n    　台本の仕上げが完了し、順調に配役も決定。]])\r\n\r\n    MSG([[Finally, we reached the stage where we split into two groups: the actors and the backstage crew, and started working.\r\nようやく、演者班と裏方班との二班にわかれて、作業を行う段階を迎えた。]])\r\n    --//BU：オウガ（通常）、ヒユ（驚き）\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    LAYER_POSITION(50,400,0)\r\n    LAYER_LOAD(55,\"BU_HIY01ca\")\r\n    LAYER_POSITION(55,-400,0)\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[Ouga-kun from the boys' division is also scheduled to join the actors' group. Today, I—Erika—was to introduce him and join the practice with 1-A.\r\n演者班には、男子部からオウガくんも参加予定で。 今日はボク――エリカの紹介で、１－Ａの練習に合流する取り決めとなっていた。]])\r\n\r\n    MSG([[But everyone in 1-A was tense about Ouga-kun’s arrival. Even though we had talked it over beforehand, it was natural that the appearance of a disliked boy from the boys' division would cause a stir.\r\nでも１－Ａのみんなはオウガくんの登場に戦々恐々としている。 いくら事前に話を通しているとは言え、嫌われ者の男子部が登場すれば、波紋が生まれて当然だろう。]])\r\n\r\n    MSG([[I wondered if Ouga-kun would antagonize them again— but surprisingly, he bowed deeply and spoke in a gentlemanly tone.\r\nオウガくんがまた挑発をしてしまうかな――と思いきや。\r\n    　意外にも、頭を深々と下げて、紳士的な口調で語り出した。]])\r\n\r\nPLAY_VOICE(\"ogre_0173.wav\")\r\n    MSG([[\r\n【Ouga】\r\n通常 \"I’m Ouga Rokujou, playing the beast role. I regret intruding on your girls’ practice, but I hope you’ll take care of me.\"\r\n通常\r\n    「野獣役を務める六条オウガだ。キミたち女子部の練習に混じってしまい心苦しく思うが、どうかよろしく頼む」]])\r\n\r\nPLAY_VOICE(\"ogre_0174.wav\")\r\n    MSG([[\r\n【Ouga】\r\n通常 \"I’m not familiar with the rules of the girls’ division, so I might cause some trouble. Please don’t hesitate to point it out. I will do my best to improve.\"\r\n通常 「女子部のルールは知らないことが多いので、キミたちに迷惑をかけることもあるだろう。その時はかまわず指摘をしてくれ。改善に善処する」]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    LAYER_POSITION(50,400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0175.wav\")\r\n\r\n    MSG([[\r\n【Ouga】\r\n笑顔 \"Let’s create the best stage together.\"\r\n笑顔\r\n    「共に最高の舞台を作り上げようじゃないか」]])\r\n    --//SE：拍手\r\nPLAY_SE(\"SEa021.wav\")\r\nWAIT(300)\r\n\r\n    MSG([[The class responded to Ouga-kun’s greeting with warm applause.\r\nオウガくんのあいさつに対して、クラスのみんなが好意的な拍手を返してくれた。]])\r\n\r\n    MSG([[I quietly approached Ouga-kun and whispered in his ear.\r\nボクはオウガくんにそっと近づいて、耳打ちする。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01aa\")\r\nPLAY_VOICE(\"erika_0559.wav\")\r\n    MSG([[\r\n【Erika】\r\n通常 \"W-Why? You seem different than usual.\"\r\n通常\r\n    「ど、どうしたんですか？　普段と様子が違うようですけど」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    LAYER_POSITION(50,400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0176.wav\")\r\n\r\n    MSG([[\r\n【Ouga】\r\n通常 \"How rude. My muscles are fine today, you know? Look at the bulging biceps on these mighty forearms.\"\r\n通常\r\n    「心外だな。オレ様の筋肉は今日も快調だぞ？　このたくましい前腕二頭筋の膨張を見てみてくれ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01fc\")\r\nPLAY_VOICE(\"erika_0560.wav\")\r\n    MSG([[\r\n【Erika】\r\n苦笑 \"N-No, I just meant you didn’t laugh loudly or call us 'females' today.\"\r\n苦笑\r\n    「あ、いえ。高笑いしたり、『メス』呼ばわりしないな、って」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    LAYER_POSITION(50,400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0177.wav\")\r\n\r\n    MSG([[\r\n【Ouga】\r\n笑顔 \"If I acted like that, everyone in the girls’ division would be scared.\"\r\n笑顔\r\n    「そんな行動に出れば、女子部の皆々が怯えるではないか」]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    LAYER_POSITION(50,400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0178.wav\")\r\n\r\n    MSG([[\r\n【Ouga】\r\n通常 \"My fate was intertwined with yours, Erika. I can’t cause unnecessary trouble with the girls’ division anymore.\"\r\n通常\r\n    「オレ様の運命はエリカ女史に繋いでもらったもの。これ以上、変に女子部と波風を立たせるワケにはいかん」]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    LAYER_POSITION(50,400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0179.wav\")\r\n\r\n    MSG([[\r\n【Ouga】\r\n笑顔 \"Both you, Erika, and Minato pushed yourselves to save me, right? I can push myself a little too.\"\r\n笑顔\r\n    「エリカ女史もミナトも、オレ様を救うために無理をしてくれたろう？オレ様とて、無理のひとつやふたつ、こなしてみせるさ」]])\r\n\r\n    MSG([[Looking closely, his calm smile looked a bit strained. His mouth twitched as if he was about to burst out laughing loudly, as usual.\r\nよく見ると、その穏やかな笑顔も、口元がピクついている。\r\n    　今にも大きく開き、いつものように高笑いをあげてしまいそうだ。]])\r\n\r\n    MSG([[Ouga-kun was doing his best to avoid intimidating the girls.\r\nオウガくんなりに、女の子たちを威圧してしまわないよう、最大限の配慮をしてくれているのだろう。]])\r\n\r\n    LAYER_LOAD(55,\"BU_HIY01da\")\r\n    LAYER_POSITION(55,-400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"hiyu_0211.wav\")\r\n\r\n    MSG([[\r\n【Hiyu】\r\n悲しみ \"We actors are probably fine... but what about the backstage crew? I heard that the three seniors who caused the sexual harassment incident before are in charge there.\"\r\n悲しみ 「私たち演技班は別に平気そうですけど……裏方班は大丈夫でしょうか？ 確か、以前にセクハラ騒ぎを起こした三名の先輩が担当しているって」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ea\")\r\nPLAY_VOICE(\"erika_0561.wav\")\r\n    MSG([[\r\n【Erika】\r\n笑顔 \"It’s okay. From what Minato’s told me, those seniors seem to have completely reformed. They shouldn’t make the same mistakes again.\"\r\n笑顔 「大丈夫ですよ。ミナトから話を聞く限り、先輩たちはもうすっかり改心しているようです。過ちを繰り返したりはしないはずです」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01aa\")\r\nPLAY_VOICE(\"erika_0562.wav\")\r\n    MSG([[\r\n【Erika】\r\n通常 \"Besides, Daria and her knights are supporting the backstage crew. If any trouble arises, they should be able to stop it.\"\r\n通常\r\n    「それに裏方班には、ダリアさんとその騎士がサポートに入ってくれていますからね。万が一にもトラブルが起きた場合には、止めてくれるかと思います」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Since Daria and her group are also performing at the Shirahisai Festival, we will be working together in the gym on stage props and costumes.\r\nダリアさんたちも白陽祭ではステージ発表を行うため、体育館で舞台装置や衣装の制作をご一緒させてもらうこととなった。]])\r\n\r\n    MSG([[Daria’s 'knights' apparently include many from the drama club, so if we get stuck on production, they’ll help out. That’s a great relief. I think the backstage crew can proceed with a perfect setup.\r\nダリアさんの『騎士』には演劇部も多いらしく、制作に行き詰ったらフォローをしてくれるとのことで、大助かりだ。 裏方班は万全の体制で進んでいけると思う。]])\r\n\r\n    LAYER_LOAD(55,\"BU_HIY01ga\")\r\n    LAYER_POSITION(55,-400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"hiyu_0212.wav\")\r\n\r\n    MSG([[\r\n【Hiyu】\r\n焦り \"I-I hope so... A-Also! Is it really true that Uran and you will be competing in the Princess Election? Why?\"\r\n焦り\r\n    「そ、それならいいんですけど……あ、あの！　ウランさまと姫選挙で対決をなさるというお話は本当なのですか？　一体どうして？」]])\r\n\r\n    MSG([[Hiyu asked cautiously. Looking around at the classmates, I noticed several with worried expressions like hers.\r\nヒユさんが恐る恐る問いかけた。\r\n    　クラスメイトの皆さんの顔を見渡すと、ヒユさんのように不安げな表情を浮かべている子がちらほら。]])\r\n\r\n    MSG([[They must have already heard rumors about the Princess Election.\r\nきっと既に、ウワサで姫選挙の話を耳にしてしまっていたのだろう。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01fc\")\r\nPLAY_VOICE(\"erika_0563.wav\")\r\n    MSG([[\r\n【Erika】\r\n苦笑 \"Please don’t worry. We’re just following tradition to let the Princess Election decide whether to allow a joint performance with the boys’ division.\"\r\n苦笑 「心配しないでください。ただ、男子部の皆さんとの合同を認めるべきか否か、伝統に則って姫選挙で判断を仰ぐだけです」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01aa\")\r\nPLAY_VOICE(\"erika_0564.wav\")\r\n    MSG([[\r\n【Erika】\r\n通常 \"If I lose, neither Ouga-kun nor I will participate in the play. So just in case, we should prepare an understudy.\"\r\n通常\r\n    「もし私が負けた場合は、私とオウガくんの劇への参加はなしになります。ですから、万が一には代役を立てられる状態にはしておきましょう」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(55,\"BU_HIY01da\")\r\n    LAYER_POSITION(55,-400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"hiyu_0213.wav\")\r\n\r\n    MSG([[\r\n【Hiyu】\r\n悲しみ \"No way! Why would you put yourself at risk for the boys’ division, even you, Sister...\"\r\n悲しみ 「そんな！ どうして男子部のために、お姉さままで……」]])\r\n\r\n    MSG([[After she said this, Hiyu suddenly looked at Ouga-kun sharply.\r\nヒユさんがそう口にしてからハッと気付いたように、オウガくんの顔を見やる。]])\r\n\r\n    MSG([[Ouga-kun smiled faintly.\r\nオウガくんは微苦笑した。]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    LAYER_POSITION(50,400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0180.wav\")\r\n\r\n    MSG([[\r\n【Ouga】\r\n笑顔 \"No need to worry. I was the one who dragged Erika into this. You have every right to blame me.\"\r\n笑顔\r\n    「気を遣う必要はない。エリカ女史を巻き込んだのはオレ様だ。キミたちにはオレ様を責める権利があるだろう」]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01aa\")\r\n    LAYER_POSITION(50,400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0181.wav\")\r\n\r\n    MSG([[\r\n【Ouga】\r\n通常 \"But I have no intention of backing down. Erika and I will face this battle believing firmly that we are in the right and will win.\"\r\n通常 「だが引くつもりもない。エリカ女史もオレ様も、己が正義であることを、必ず勝利することを信じて、この戦いに臨むのだからな」]])\r\n\r\nPLAY_VOICE(\"hiyu_0214.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n悲しみ \"I-I believe Sister Erika will win too!\"\r\n悲しみ\r\n    「わ、私だってエリカお姉さまなら勝ってくださると信じています！」]])\r\n\r\nPLAY_VOICE(\"ogre_0182.wav\")\r\n    MSG([[\r\n【Ouga】\r\n通常 \"Then, for now, we just have to practice.\"\r\n通常\r\n    「ならば今は練習あるのみだな」]])\r\n\r\n    MSG([[Ouga-kun took out a script full of sticky notes from his pocket and placed it on the desk.\r\nオウガくんは懐から付箋だらけの台本を取り出して、机の上に乗せた。]])\r\n\r\n    LAYER_LOAD(50,\"BU_OGA01ea\")\r\n    LAYER_POSITION(50,400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0183.wav\")\r\n\r\n    MSG([[\r\n【Ouga】\r\n笑顔 \"With this team, I believe we can put on the best stage presentation in Yuriai Private Academy’s history. Let’s believe in Erika’s victory and focus on practice.\"\r\n笑顔 「このメンバーならば、今までの百合愛学園史上、最も優れたステージ発表ができると信じている。エリカ女史の勝利を信じて、練習に集中をするのだ」]])\r\n\r\nPLAY_VOICE(\"ogre_0184.wav\")\r\n    MSG([[\r\n【Ouga】\r\n笑顔 \"Let’s create a new history for this academy together!\"\r\n笑顔\r\n    「オレ様たちで、この学園に新たな歴史を築こうではないか」]])\r\n\r\n    MSG([[Ouga-kun’s words eased the fear from everyone’s faces.\r\nオウガくんの言葉で、クラスメイトのみんなの表情から恐れの色が引いていく。]])\r\n\r\n    MSG([[Maybe everyone began to believe in my victory. From now on, with the election, Shirahisai preparations, and crossdressing training, I might be overwhelmed, but I’ll do my best.\r\nみんなでボクの勝利を信じてくれたのかもしれない。 ここからは選挙に白陽祭の準備、女装の訓練と、忙殺されるかもしれないけれど、がんばろう。]])\r\n\r\n    MSG([[For the smiles of everyone in 1-A.\r\n１－Ａのみんなの笑顔のためにも。]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(55,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ca\")\r\nPLAY_VOICE(\"erika_0565.wav\")\r\n    MSG([[\r\n【Erika】\r\n驚き \"Huh...? If I recall, there were supposed to be sixteen actors...\"\r\n驚き\r\n    「あれ……？　演者班って確か十六人いたような…」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[That’s when I noticed something.\r\nそこでボクはあることに気が付いた。]])\r\n\r\n    MSG([[One actor was missing. Comparing the printed roster with everyone’s faces, I noticed the name of the missing person, and a bad feeling rose in my chest.\r\n演者班の数が一人足りていない。 プリントされた名簿とみんなの顔を見比べてみて、いない子の名前に気付き、イヤな胸騒ぎが起こる。]])\r\n\r\n    MSG([[The absent one was Yururuin Yuri-san. She was a student who looked like she wanted to say something during the recent decision on the performance.\r\n参加していないのは龍城院友梨さん。 先日の出し物決めの際に、何か言いたげな顔をしていた生徒だった。]])\r\n    --　　　◆\r\nSTOP_BGM(1000)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"EP03_13\")\r\nend\r\n"
}