{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP03_16",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP03/EP03_16.lua",
  "Text": "function EP03_16()\r\n    --.承-6【8月第2週】「乙女のカゴ」\r\n    SaveData.Title = \"乙女のカゴ\"\r\n\r\n    --//BG：ハンバーガー屋\r\n    LAYER_LOAD(LAYER_BG, \"BG001aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM02.wav\")\r\n\r\n    --//BU：モブ女子生徒Ｆ\r\n    LAYER_LOAD(50,\"BU_MOB09aa\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[After meeting up with Uran Ryuguuin in front of the station, I guided her to a hamburger place as a spot for our discussion.\r\n龍城院さんと駅前で合流したボクは、話し合う場としてハンバーガー屋へと案内した。]])\r\n\r\n    MSG([[Not very familiar with the place, Uran followed me awkwardly and sat down facing me at a table.\r\nあまり店に慣れていないのか、龍城院さんはぎこちない動きでボクの後についてきて、テーブル席に向かい合って座る。]])\r\n\r\n    MSG([[After placing the two drinks and nuggets I had bought for us on the table, we continued casual chatter for about ten minutes.\r\nボクの購入した二人分のドリンクとナゲットを並べて、たわいない雑談を続けること十数分。]])\r\n\r\n    MSG([[Then Uran stepped into the main topic.\r\n龍城院さんが本題へと踏み込んだ。]])\r\n\r\nPLAY_VOICE(\"yuri_0008.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"Enough small talk, dear Erika. What is it you want to ask me?\"\r\n「雑談はもうよろしくてよ、エリカお姉さま。私に何を聞きたいのですか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI02ea\")\r\nPLAY_VOICE(\"erika_0582.wav\")\r\n    MSG([[\r\n【Erika】\r\nSummer uniform・smile \"I'm sorry. It had been a while since I'd seen you, so I just got carried away talking.\"\r\n夏服・笑顔\r\n    「ごめんなさい。龍城院さんにお会いするのが久しぶりだったから、ついつい話し込んじゃいましたね」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI02aa\")\r\nPLAY_VOICE(\"erika_0583.wav\")\r\n    MSG([[\r\n【Erika】\r\nSummer uniform・normal \"You probably guessed already, but I invited you here today to hear about Uran-san.\"\r\n夏服・通常\r\n    「もうお察しだと思いますけど、今日はウランさんのお話を伺いたくて、この場に誘いました」]])\r\n\r\nPLAY_VOICE(\"erika_0584.wav\")\r\n    MSG([[\r\n【Erika】\r\nSummer uniform・normal \"Could you tell me why Uran-san is so passionately opposed to coeducation?\"\r\n夏服・通常\r\n    「ウランさんがあれほど熱心に共学に反対する理由を、教えていただけませんか？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"yuri_0009.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"...If you're asking me, that means you already know about Ryugu Holdings and the traditions of the Ryuguuin family, right?\"\r\n「……私に聞くということは、龍宮ホールディングスのことや、龍宮院家の伝統については既にご存知なのですね？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI02aa\")\r\nPLAY_VOICE(\"erika_0585.wav\")\r\n    MSG([[\r\n【Erika】\r\nSummer uniform・normal \"Yes. I understood why Uran-san is hostile towards men. But somehow, it doesn't quite connect for me as a reason to oppose coeducation.\"\r\n夏服・通常 「ええ。ウランさんが男性を敵対視する理由は知ることができました。でも、それがイマイチ自分の中で、共学に反対する理由に繋がらないんです」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI02da\")\r\nPLAY_VOICE(\"erika_0586.wav\")\r\n    MSG([[\r\n【Erika】\r\nSummer uniform・sad \"No matter how much someone dislikes men, spending valuable school life in conflict with the boys' division... I wonder if that's really necessary.\"\r\n夏服・悲しみ 「いくら男性が苦手だからって、男子部との対立に貴重な学園生活を費やしてしまうのはどうなのかなって」]])\r\n\r\nPLAY_VOICE(\"erika_0587.wav\")\r\n    MSG([[\r\n【Erika】\r\nSummer uniform・sad \"We're only together for three years after all, so I don't feel it's such a serious problem...\"\r\n夏服・悲しみ\r\n    「三年間一緒に過ごすだけなのですから、私はそこまで深刻な問題だと感じていないのですが……」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"yuri_0010.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"If Uran-sama thought conservative activities were unnecessary, she would live a freer school life.\"\r\n「ウランさまだって、保守派としての活動が不要ならもっと自由に学園生活を過ごされているでしょう」]])\r\n\r\nPLAY_VOICE(\"yuri_0011.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"But she doesn't only think of herself. She continually works hard for the sake of many women.\"\r\n「ですがあの方は自分だけでなく、多くの女性のためを想って、不断の努力を続けていらっしゃるのですよ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI02da\")\r\nPLAY_VOICE(\"erika_0588.wav\")\r\n    MSG([[\r\n【Erika】\r\nSummer uniform・sad \"M-many women, you say?\"\r\n夏服・悲しみ\r\n    「お、多くの女性、ですか？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"yuri_0012.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"Yes. All women who find men difficult.\"\r\n「ええ。男性を苦手とする女性、そのすべてです」]])\r\n\r\n    MSG([[I didn't quite understand what Uran meant.\r\n龍城院さんの言葉の意味がよくわからなかった。]])\r\n\r\n    MSG([[We only spend three years at Yuriai Private Academy. So why would that connect to saving all women who aren't comfortable around men?\r\n百合愛学園では三年間しか過ごさないはず。\r\n    　それが何故、男性が苦手なすべての女性を救う結果に繋がるのだろうか。]])\r\n\r\nPLAY_VOICE(\"yuri_0013.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"Do you know that Yuriai Private Academy has long been called the ‘Maiden's Cage’?\"\r\n「お姉さまは百合愛学園が、昔から『乙女のカゴ』と呼ばれてきたという話を知っていますか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI02ca\")\r\nPLAY_VOICE(\"erika_0589.wav\")\r\n    MSG([[\r\n【Erika】\r\nSummer uniform・surprised \"Cage? No, that's the first time I've heard that. What does it mean?\"\r\n夏服・驚き\r\n    「カゴ？　いえ、初めて聞きました。どういう意味ですか？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"yuri_0014.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"There are various theories, but the most common one is a pun on the words ‘birdcage’ and ‘protection’.\"\r\n「理由は所説ありますけど、『鳥籠』と『加護』をかけたものだという説が一般的です」]])\r\n\r\nPLAY_VOICE(\"yuri_0015.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"Yuriai Private Academy is a prestigious girls' school, somewhat isolated from the metropolitan area and worldly affairs, with a strong unique character.\"\r\n「百合愛学園は名のあるお嬢様学校の中でも、首都圏から離れていて世俗との関りが薄く、独自色の強い学園」]])\r\n\r\nPLAY_VOICE(\"yuri_0016.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"It was expected to serve as a place to separate maidens from the world and protect them from harmful disasters and impurities that would negatively affect their healthy growth.\"\r\n「乙女を世俗から切り離し、健全なる成長に悪影響な災いやケガレから守る場所としての機能を、期待されていたそうですよ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI02ga\")\r\nPLAY_VOICE(\"erika_0590.wav\")\r\n    MSG([[\r\n【Erika】\r\nSummer uniform・anxious \"So, that’s the ‘cage’ part.\"\r\n夏服・焦り\r\n    「それで、『カゴ』ですか」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[It does make sense.\r\n言い得て妙かもしれない。]])\r\n\r\n    MSG([[Inside that cage is a space isolated from nature. Though unable to fly freely, it’s a safe world without enemies who could harm you.\r\nカゴの中は自然から隔離された空間。\r\n    　空を飛べず不自由かもしれないものの、自分を傷つける外敵のいない安全な世界だ。]])\r\n\r\n    MSG([[You can peacefully live under someone's protection or take the risk and fly out into the free sky. No one can say which is happier.\r\n誰かの庇護の元で平和に過ごすか。 危険を承知で、自由な大空に飛び立つか。 どちらが幸せかなんて、誰にもわからないと思う。]])\r\n\r\nPLAY_VOICE(\"yuri_0017.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"My dear Erika, you may not understand, but there are many women who truly dislike men.\"\r\n「お強いエリカお姉さまには理解できないかもしれませんが、世の中には男性が心底苦手な女性だってたくさんいるのですよ」]])\r\n\r\nPLAY_VOICE(\"yuri_0018.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"I am one of them. I grew up under unspeakable treatment from my father and brother... I get trembling just seeing men.\"\r\n「私自身もそうです。父や兄から筆舌しがたい教育を受けて育って……目にするだけで震えてしまうほど、男性が苦手なのです」]])\r\n\r\nPLAY_VOICE(\"yuri_0019.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"So I asked my mother to let me attend Yuriai Private Academy. Uran-sama, who has been a dear friend since childhood, is also here.\"\r\n「ですからお母さまに頼んで、この百合愛学園を希望したのですよ。幼い頃から仲良くしてくださった、ウランさまもいらっしゃいますしね」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI02ca\")\r\nPLAY_VOICE(\"erika_0591.wav\")\r\n    MSG([[\r\n【Erika】\r\nSummer uniform・surprised \"I-is that the reason?\"\r\n夏服・驚き\r\n    「そ、そんな理由があったんですか？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Learning about Uran's unexpected past, I found myself at a loss for words.\r\n龍城院さんの思わぬ過去を知って、言葉に詰まってしまった。]])\r\n\r\n    MSG([[From her point of view, avoiding boys all this time, my careless proposal to merge with the boys' division must have been infuriating.\r\nこれまで男子を避け続けてきた彼女からすれば、軽々しく男子部との合同を提案したボクの存在は、腹立たしくて仕方がなかったに違いない。]])\r\n\r\nPLAY_VOICE(\"yuri_0020.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"Many students at Yuriai Private Academy, like Uran-sama and myself, have their futures decided by their parents.\"\r\n「百合愛学園に通う生徒にはウランさまや私のように、卒業後の道を親に決められているヒトだって少なくありません」]])\r\n\r\nPLAY_VOICE(\"yuri_0021.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"While in this academy, family obligations and birth status don’t matter. No vile men either. It is a sanctuary where only maidens are allowed.\"\r\n「この学園の中にいる時だけは、家のしがらみも、生まれも関係ない。卑しい男性もいない。乙女だけが踏み入ることを許された聖域」]])\r\n\r\nPLAY_VOICE(\"yuri_0022.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"You said ‘just three years together,’ but for us, those three years at Yuriai Private Academy are irreplaceable time.\"\r\n「エリカお姉さまは『三年間一緒に過ごすだけ』とおっしゃいましたが、私たちにとって、百合愛学園での三年間はかけがえのない時間なのですよ」]])\r\n\r\nPLAY_VOICE(\"yuri_0023.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"Even though eventually we're destined to fly into the cloudy sky... we want at least those three years inside the cage to be happy.\"\r\n「いずれは曇天に飛び立つ運命の雛鳥であろうとも……せめてカゴの中での三年間は幸せでありたい」]])\r\n\r\nPLAY_VOICE(\"yuri_0024.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"That is the humble wish of us conservatives.\"\r\n「それが私たち保守派の、ささやかなる願いなのですよ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI02ca\")\r\nPLAY_VOICE(\"erika_0592.wav\")\r\n    MSG([[\r\n【Erika】\r\nSummer uniform・surprised \"A humble wish... and I...\"\r\n夏服・驚き\r\n    「ささやかなる、願い……それを、私が」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[—I'm trying to ruin it.\r\n――私が台無しにしようとしている。]])\r\n\r\n    MSG([[Saying ‘just three years together’ was far too reckless. I hadn’t understood at all how important those three years at Yuriai are.\r\n『三年間一緒に過ごすだけ』なんて、あまりにも軽率な発言だった。\r\n    　百合愛学園での三年間の大切さを、全然理解できていなかった。]])\r\n\r\n    MSG([[As Uran said, many students find their time at Yuriai a form of salvation.\r\n龍城院さんの言う通り、百合愛学園での時間が救いになる生徒だってたくさんいるんだ。]])\r\n\r\n    MSG([[If coeducation proceeds as it is, that salvation will be completely lost.\r\nこのまま共学化が進んでしまえば、その救いは完全に失われることになる。]])\r\n\r\n    MSG([[That’s why conservative students—and their representative, Uran-san—are fiercely resisting.\r\nだから保守派の生徒――そしてその代表であるウランさんは、必死に抵抗しているのだろう。]])\r\n\r\n    MSG([[It’s not only for themselves. It’s for other girls who might choose Yuriai in the future and who share the same circumstances.\r\n自分だけではない。\r\n    　今後、百合愛学園を志すかもしれない、自分と同じ境遇の女の子たちのために。]])\r\n\r\nPLAY_VOICE(\"yuri_0025.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"Erika, dear? Are you crying?\"\r\n「エリカ、お姉さま？　泣いていらっしゃるのですか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI02ca\")\r\nPLAY_VOICE(\"erika_0593.wav\")\r\n    MSG([[\r\n【Erika】\r\nSummer uniform・surprised \"Huh?\"\r\n夏服・驚き\r\n    「え？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Touching my cheek, I realized I was crying and hurriedly wiped the tears away with a handkerchief.\r\n頬に触れてみて初めて自分が泣いていることに気付き、慌ててハンカチで涙をぬぐう。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI02da\")\r\nPLAY_VOICE(\"erika_0594.wav\")\r\n    MSG([[\r\n【Erika】\r\nSummer uniform・sad \"I-I’m sorry! Truly, I’m sorry...\"\r\n夏服・悲しみ\r\n    「ご、ごめんなさい！　本当に、ごめんなさい……」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I felt pathetic. I had thought that changing myself meant only good things.\r\n自分が情けない。\r\n    　ボクは自分が変われたことで、変わることをよいものばかりと思い込んでいた。]])\r\n\r\n    MSG([[I had shallowly believed that even if change is scary, once you do it, it leads to growth, so there's no problem.\r\n変わる時は怖くても、いざ変われば成長に繋がるのだから問題はないんだと、浅く考えてしまっていた。]])\r\n\r\n    MSG([[What battle princess? She’s the one I should call sister.\r\n何が戦姫だ。お姉さまだ。]])\r\n\r\n    MSG([[I've only been looking at things from my own standpoint. I’m the worst, the biggest fool.\r\n自分の立場でしか物事を見れていなかったなんて。\r\n    　最低の、大バカ野郎じゃないか。]])\r\n\r\nPLAY_VOICE(\"yuri_0026.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"I understand well why Uran-sama doesn't want to oppose you, dear Erika.\"\r\n「……ウランさまが、エリカお姉さまと敵対したくないとおっしゃっている理由はよくわかります」]])\r\n\r\nPLAY_VOICE(\"yuri_0027.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"As her ‘knight’ close to her, I know you are a kindhearted person.\"\r\n「お姉さまが心優しい方だということは、『騎士』としてそばにいた私にはよくわかっています」]])\r\n\r\nPLAY_VOICE(\"yuri_0028.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"But the issue of coeducation is different. This feeling cannot be compromised with anyone. I’m sorry, but this time I cannot stand by your side, dear Erika.\"\r\n「ですが、共学の問題だけは別です。この想いは誰が相手であろうとも譲れないんです。心苦しいですが、今回ばかりはエリカお姉さまの味方はできません」]])\r\n\r\nPLAY_VOICE(\"yuri_0029.wav\")\r\n    MSG([[\r\n【Uran Ryuguuin】\r\n \"Thank you for the nuggets. It was my first time trying them... they’re delicious.\"\r\n「ナゲット、ごちそうさまでしたわ。初めて口にしましたけど……おいしいものですね」]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[Saying that, Uran stood up from the table.\r\nそう言って龍城院さんは席を立った。]])\r\n\r\n    MSG([[Left alone, I gnawed on the now-cold nuggets and, with a foggy mind, pondered the future.\r\n一人残されたボクはすっかり冷めきったナゲットを齧りながら、靄がかかった頭で、今後のことを考える。]])\r\n\r\n    MSG([[The conflict between coeducation supporters and conservatives was a much deeper issue than I had imagined.\r\n共学派と保守派の争いは、ボクが考えていたよりもずっと根が深い問題だった。]])\r\n\r\n    MSG([[To be honest, I want to support Uran and conservative students as an ally.\r\n本心を言えば、ボクもウランさんや龍城院さんの味方として、保守派の力になってあげたい。]])\r\n\r\n    MSG([[But if I do, that means abandoning Ouga-kun and the boys' division.\r\nだけど、そうすればオウガくんや男子部を見捨てることになる。]])\r\n\r\n    MSG([[The boys’ division and the conservatives. Is there really no path to save both?\r\n男子部と保守派。\r\n    　どちらも救える道は本当にないのだろうか――]])\r\n    --//SE：着信音\r\nPLAY_SE(\"SEb011.wav\")\r\nWAIT(500)\r\n\r\n    MSG([[Just then, the phone I use under the name Minato rang. It was an unknown number. Who could it be?\r\nその時、ミナトの名義で使っている方のスマホに電話がかかってきた。\r\n    　知らない番号だけど、一体誰からだろうか。]])\r\n\r\nSTOP_SE(\"SEb011.wav\")\r\nPLAY_SE(\"SEb020.wav\")\r\nWAIT(100)\r\nLAYER_LOAD_FACE(\"BU_ERI02aa\")\r\nPLAY_VOICE(\"erika_0595.wav\")\r\n    MSG([[\r\n【Erika】\r\nSummer uniform・normal \"Hello, this is Minato.\"\r\n夏服・通常\r\n    「はい、ミナトですけど」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nSTOP_BGM(1000)\r\n\r\nPLAY_VOICE(\"hermes_0106.wav\")\r\n    MSG([[\r\n【????】\r\n \"Helloooo~ It's meee<sprite=\"Emoji\" name=\"heart\"> Hehehe<sprite=\"Emoji\" name=\"note\">\"\r\n「もしもーーーーし、わったしっだよー<sprite=\"Emoji\" name=\"heart\">　でへへへ<sprite=\"Emoji\" name=\"note\">」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI02ga\")\r\nPLAY_VOICE(\"erika_0596.wav\")\r\n    MSG([[\r\n【Erika】\r\nSummer uniform・anxious \"Eh!? Th-that voice!?\"\r\n夏服・焦り\r\n    「え！？　そ、その声って！？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I almost fell over at the unexpected voice. Why is this person calling my Minato number and not Erika's?!\r\n思わぬヒトの声で腰を抜かしそうになる。\r\n    　何で、このヒトから、エリカではなくボクの番号に！？]])\r\n\r\nPLAY_VOICE(\"hermes_0107.wav\")\r\n    MSG([[\r\n【Hermes Himegami】\r\n \"Hey, let's have a night date together~<sprite=\"Emoji\" name=\"heart\"> I want to talk to Mina-chan about Marika-chan<sprite=\"Emoji\" name=\"note\">\"\r\n「ちょっと二人で夜のデートをしようよ～<sprite=\"Emoji\" name=\"heart\">　マリカちゃんのことで、ミナちゃんにお話したいことがあるんだ<sprite=\"Emoji\" name=\"note\">」]])\r\n\r\n    MSG([[The caller was Hermes Himegami. An all-national idol’s sudden invitation to a date.\r\n電話の主は姫神エルメス。\r\n    　国民的アイドルからの、あまりにも唐突なデートのお誘いであった。]])\r\n    --　　　◆\r\n\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"EP03_17\")\r\n\r\nend\r\n"
}