{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP03_13",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP03/EP03_13.lua",
  "Text": "function EP03_13()\r\n\r\n    --.承-3【8月第1週】「保守派と共学派」\r\n    SaveData.Title = \"保守派と共学派\"\r\n\r\n    --//BG：体育館\r\n    LAYER_LOAD(LAYER_BG, \"BG018aa\")\r\n    LAYER_LOAD(50,\"BU_DAR01aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM02.wav\")\r\n\r\nPLAY_VOICE(\"dahlia_0125.wav\")\r\n\r\n    MSG([[\r\n【Daria】\r\n \"Hmm. Indeed, the number of absentees is increasing.\"\r\n「ふむ。確かに、欠席者が増えているね」]])\r\n\r\n    MSG([[A few days after the practice started in earnest. As the number of absentees gradually began to rise, I decided to consult Daria-san once.\r\n練習が本格化してから数日。 徐々に欠席者が増え始めたので、ダリアさんに一度相談をしてみることにした。]])\r\n\r\nPLAY_VOICE(\"dahlia_0126.wav\")\r\n    MSG([[\r\n【Daria】\r\n \"Do you have a list of the students who are absent? Could you show it to me for a moment?\"\r\n「欠席している子の一覧はあるかい？　少し見せてもらえるかな」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01aa\")\r\nPLAY_VOICE(\"erika_0566.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Ah, I’ve compiled it in the notes on my phone. Please take a look.\"\r\n「あ、スマホのメモ帳にまとめてあります。コチラをどうぞ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Currently, the absentees include one member of the performer's group and four from the backstage crew.\r\n現在の欠席者は演者班一名に、裏方班に四名。]])\r\n\r\n    MSG([[The performer is Uran Ryuguuin. The backstage crew members are Iruka Soga, Yuhi Takeda, Nanana Shichijo, and Kasaki Miu.\r\n演者班は、龍城院友梨さん。\r\n    　裏方班は、蘇我イルカさん。竹田夕日さん。七条奈々菜さん。美羽花咲里さん。]])\r\n\r\n    MSG([[They are not particularly close friends, and I can’t find any common ground, which is troubling.\r\nあまり親しい仲の五人というワケでもなく、共通点が見えず困っている。]])\r\n\r\n    MSG([[However, it seemed that Daria-san saw something and winked at me.\r\nしかしダリアさんには何かが見えたようで、ボクにウインクしてみせた。]])\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01ib\")\r\n    DARIA_PARTICLE_02(150,0,0,100,500)\r\n\r\nPLAY_VOICE(\"dahlia_0127.wav\")\r\n    MSG([[\r\n【Daria】\r\n \"I see. It’s no wonder you couldn’t notice their commonality.\"\r\n「なるほどね。キミでは共通点に気付けないのも、仕方がないかな」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ca\")\r\nPLAY_VOICE(\"erika_0567.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Eh? Wh-what do you mean?\"\r\n「えっ。ど、どういうことですか？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0128.wav\")\r\n\r\n    MSG([[\r\n【Daria】\r\n \"All of the absent students are part of the escalator system from middle school and belong to the faction called the 'Conservative Group.'\"\r\n「休んでいる子たちは全員が中等部からのエスカレーター組。そして『保守派』と呼ばれる派閥に属している子たちだ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ca\")\r\nPLAY_VOICE(\"erika_0568.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Conservative, faction?\"\r\n「保守、派？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I was confused by the unfamiliar term.\r\n初めて聞く単語に混乱してしまう。]])\r\n\r\n    MSG([[Conservative means to maintain the status quo. The word is often used when discussing ideology, such as \"conservatism.\"\r\n保守と言えば、現状維持を守ること。\r\n    　「保守主義」など、思想を語る時によく使われる言葉だ。]])\r\n\r\n    MSG([[I wondered why such a term would arise at Yuriai Private Academy, a prestigious girls’ school.\r\nそんな言葉が、お嬢様学校である百合愛学園で、一体何故出てくるのだろう。]])\r\n\r\nPLAY_VOICE(\"dahlia_0129.wav\")\r\n    MSG([[\r\n【Daria】\r\n \"If you look at how disliked the boys' division is, Erika-kun, you should understand that the boys are by no means a welcomed presence.\"\r\n「男子部の嫌われぶりを見れば、エリカくんも男子部が決して望まれていない存在であることはわかるね？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01aa\")\r\nPLAY_VOICE(\"erika_0569.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"...Yes. I feel that it’s difficult to change the long-standing traditions of Yuriai Private Academy.\"\r\n「……ええ。やっぱり、長く続いてきたこの百合愛学園の伝統を変えることは難しいのだと感じています」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"dahlia_0130.wav\")\r\n    MSG([[\r\n【Daria】\r\n \"Exactly. But it’s also true that changes have begun. Once change starts, it cannot be stopped.\"\r\n「その通りだ。しかし変わり始めたことも事実。一度始まってしまった変化は止められない」]])\r\n\r\nPLAY_VOICE(\"dahlia_0131.wav\")\r\n    MSG([[\r\n【Daria】\r\n \"Once a single drop of stain settles, it can no longer be called pure white. All we can do is suppress the spread of the stain.\"\r\n「染みが一滴でもついてしまえば、もう純白とは呼べない。できることと言えば、染みの広がりを抑えることだけさ」]])\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01ba\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0132.wav\")\r\n\r\n    MSG([[\r\n【Daria】\r\n \"The students who serve as this deterrent are called the 'Conservative Group.' They continuously say no to the board’s plan to increase the number of boys each year.\"\r\n「そしてその抑止力となる生徒たちのことを『保守派』と呼んでいる。彼女たちは年々男子の数を増やそうと目論む理事会に対して、ノーと言い続けているんだ」]])\r\n\r\nPLAY_VOICE(\"dahlia_0133.wav\")\r\n    MSG([[\r\n【Daria】\r\n \"If it weren’t for the Conservatives, the boys' division would likely be greatly expanded as soon as next year, and Yuriai Private Academy would completely lose its function as a 'prestigious girls’ school.'\"\r\n「保守派がいなければ、きっと来年にも男子部は大幅に拡充され、百合愛学園は『お嬢様学校』としての機能を完全に失うだろうね」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ga\")\r\nPLAY_VOICE(\"erika_0570.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Is the coeducation plan that far along already?\"\r\n「そ、そこまで共学化の話は進んでいるんですか？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Honestly, I was surprised. The boys' division had three seniors before, and this year there are two. Their treatment is extremely poor.\r\n正直、驚いた。 男子部は先輩たちが三人に対して、今年は二人。 扱いだって極めて悪い。]])\r\n\r\n    MSG([[I had somehow assumed their status would remain the same for a while.\r\n当分の間は現状から扱いが変わらないだろうと、何となく考えていたからだ。]])\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0134.wav\")\r\n\r\n    MSG([[\r\n【Daria】\r\n \"The board’s intentions are still mysterious. Yuriai Private Academy prides itself on evolving with the times, so it is said they are acting according to that belief.\"\r\n「理事会の考えは謎が多いがね。百合愛学園は時代に合わせて変化していくことを美徳としているから、その考えに則っているのではないかと言われている」]])\r\n\r\nPLAY_VOICE(\"dahlia_0135.wav\")\r\n    MSG([[\r\n【Daria】\r\n \"In fact, surprisingly many students have no problem accepting coeducation smoothly. That includes myself. I wouldn’t actively push for coeducation, but I would accept it if the school desires it.\"\r\n「実際、共学化をすんなりと受け入れる子も意外と多いんだよ。私自身もそうだ。自ら共学化を働きかけようとは思わないが、学園側が望むなら受け入れるさ」]])\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01ba\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0136.wav\")\r\n\r\n    MSG([[\r\n【Daria】\r\n \"However, the Conservatives label even neutral views like mine as betrayal. They lump us all together as 'Pro-Coeducation' and treat us as enemies.\"\r\n「だが『保守派』からは、私のような中立寄りの考えすらもすべて裏切りと断じられている。 『共学派』と一括りにされ、敵対視されているんだよ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ga\")\r\nPLAY_VOICE(\"erika_0571.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"P-Pro-Coeducation!?\"\r\n「きょ、共学派！？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Having said that much, I realized how precarious my own position was.\r\nそこまで言ったところで、今の自分の立場の危うさに気が付いた。]])\r\n\r\n    MSG([[I had relied on the boys' power in the Princess Election and am planning a joint performance with the boys' division at the Hakuyosai festival.\r\nボクは姫選挙で男子のチカラを借りた上に、白陽祭でも男子部と合同での出し物を計画中だ。]])\r\n\r\n    MSG([[This situation might mean...\r\nこの状況は、もしかしたら……。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ca\")\r\nPLAY_VOICE(\"erika_0572.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Could it be that I’ve unknowingly been counted as one of the 'Pro-Coeducation' group?\"\r\n「まさか私……いつの間にか『共学派』の一人に数えられているんじゃ？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0137.wav\")\r\n\r\n    MSG([[\r\n【Daria】\r\n \"No, not 'could it be'—you definitely are. In fact, you’re treated like the leader of the Pro-Coeducation faction.\"\r\n「いやいや。『まさか』ではなく、『まさしく』だよ。むしろ、共学派の筆頭だと扱われているね」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ca\")\r\nPLAY_VOICE(\"erika_0573.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Ehh!?\"\r\n「ええっ！？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"dahlia_0138.wav\")\r\n    MSG([[\r\n【Daria】\r\n \"Some even suspect you are the board’s secret agent sent from the Pro-Coeducation faction to make coeducation happen—a 'spy'—I hear.\"\r\n「キミのことを理事会が共学の実現のために送り込んだ共学派からの刺客、『潜入者』と疑っている子もいるらしいよ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ga\")\r\nPLAY_VOICE(\"erika_0574.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Ehhhhhhhhhh!?\"\r\n「ええ～～～～～～～～～！？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I was deeply shaken. But from the Conservatives’ point of view, their way of thinking was natural.\r\n激しく動揺してしまう。\r\n    　いやでも、保守派の皆さんからしたら当然の思考回路か。]])\r\n\r\n    MSG([[A newcomer who suddenly becomes 'Princess' and persistently promotes cooperation with the boys' division is suspicious beyond reason. It’s no wonder they assume there’s some hidden agenda.\r\n突然『姫』になった新入生が、やたらと男子部との協力を促し続けているなんて、あまりにも怪し過ぎる。 何か裏があると考えてしまうのも無理はない。]])\r\n\r\n    MSG([[I finally understood the meaning behind the mysterious looks Ryuguuin-san and Uran-san gave me.\r\n龍城院さんやウランさんがボクに対して見せていた、意味深な視線の意味がようやくわかった。]])\r\n\r\n    MSG([[They suspected me of being a 'spy'... an agent from the Pro-Coeducation faction.\r\nアレはボクを『潜入者』……共学派からの刺客なのではないかと、疑っていたんだ。]])\r\n\r\nSTOP_BGM(1000)\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0139.wav\")\r\n\r\n    MSG([[\r\n【Daria】\r\n \"So, what do you say? Are you really a spy?\"\r\n「で、実際どうなんだい？　キミは潜入者なのかい？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ga\")\r\nPLAY_VOICE(\"erika_0575.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"N-no! I have nothing to do with the board!\"\r\n「ち、違いますよ！　私は理事会とは無関係です！」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Well, I am a spy in a certain sense (gender disguise meaning). Actually, I could say I’m in conflict with the board that is trying to cover up secrets about my sister.\r\nいや潜入者ではあるんですけど（女装的な意味で）。_r むしろボクは、姉さんに関する秘密を隠ぺいする理事会とは敵対関係にあると言っていい。]])\r\n\r\n    MSG([[It’s unfair to be thought of as an agent.\r\n刺客と思われるのは心外だ。]])\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0140.wav\")\r\n\r\n    MSG([[\r\n【Daria】\r\n \"I figured as much. It’s clear you’re a genuine good person. Hermes and Uran like you and trust you.\"\r\n「まぁそうだろうね。キミが生粋の善人なのは見ていてわかるよ。エルメスもウランくんも、キミのことは好いているし、信じているさ」]])\r\n\r\nPLAY_BGM(\"BGM09.wav\")\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0141.wav\")\r\n\r\n    MSG([[\r\n【Daria】\r\n \"But Uran is the head of the Conservatives. She can never accept Erika’s position.\"\r\n「ただウランくんは『保守派』の筆頭。エリカくんとは決して相容れない立場にいるんだ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ca\")\r\nPLAY_VOICE(\"erika_0576.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Uran-san... is the leader of the Conservatives?\"\r\n「ウランさんが……保守派の筆頭？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"dahlia_0142.wav\")\r\n    MSG([[\r\n【Daria】\r\n \"Yes. Because she must lead the Conservatives, she must completely sever connections with the boys' division.\"\r\n「ああ。保守派をまとめなければならない立場である以上、男子部との繋がりは完全に断たなければならない」]])\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01ba\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0143.wav\")\r\n\r\n    MSG([[\r\n【Daria】\r\n \"Even if that means opposing someone close to her, like you.\"\r\n「たとえ、親しいキミと敵対してでもね」]])\r\n\r\n    MSG([[—So that’s what it means.\r\n――そういうことか。]])\r\n\r\n    MSG([[Conservatives versus Pro-Coeducation. The suspicious eyes aimed at me. Uran-san’s sudden change and harsh crackdown on the boys' division.\r\n保守派と共学派。 向けられる疑念の目。 ウランさんの豹変と、強引な男子部への弾圧。]])\r\n\r\n    MSG([[It all made sense.\r\nすべてが、繋がった気がした。]])\r\n\r\n    MSG([[Uran-san’s concern about cooperating with the boys was inevitable given her position.\r\nウランさんが男子部との協力を危険視するのも、彼女の立場なら仕方がない。]])\r\n\r\n    MSG([[At that moment, Uran-san was not acting on her own will. She was representing the many who want to protect Yuriai Private Academy’s culture, objecting to me.\r\nあの時のウランさんは、彼女一人の意志ではなく。 百合愛学園の文化を守ろうとしている大勢の代表として、ボクに異議を申し立てていたんだ。]])\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0144.wav\")\r\n\r\n    MSG([[\r\n【Daria】\r\n \"Apparently, all this past month she’s been trying in her own way to win you over as an ally.\"\r\n「まぁこの一ヶ月の間、エリカくんを仲間に引き込めないものかと、彼女なりに努力していたようだがね」]])\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01ba\")\r\nPLAY_VOICE(\"dahlia_0145.wav\")\r\n    MSG([[\r\n【Daria】\r\n \"Like I once was. The closer you get to know the bond between you and the boys’ division, the more Uran must have felt heartbroken.\"\r\n「かつての私がそうであったように。キミと男子部の繋がりの強さは……知れば知るほど実感できてしまう。ウランくんはさぞ悲しかったことだろう」]])\r\n\r\n    --//CI：ウランBU（悲しみ）目元切り抜き 055\r\nLAYER_LOAD(200,\"BG000ab\")\r\nLAYER_LOAD(201,\"BUL_RYU01da\")\r\nLAYER_POSITION(201, 0, -25)\r\nSET_CUTIN_01_XL(150,500)\r\n\r\n    MSG([[I outright rejected her efforts. That’s probably why Uran showed such a sad expression.\r\nそんな彼女の努力をボクは真っ向から否定した。\r\n    　だからこそ、ウランさんはアレほど悲しそうな顔を見せたんだろう。]])\r\n\r\nRESET_CUTIN_01(150, 500)\r\nSWITCH_SCREEN(\"mask000\",1000,false)\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01da\")\r\nPLAY_VOICE(\"erika_0577.wav\")\r\n    MSG([[\r\n【Erika】\r\n (Uran-san... you were suffering, weren’t you?)\r\n（ウランさん……アナタは、苦しんでいたんですね）]])\r\n\r\nPLAY_VOICE(\"erika_0578.wav\")\r\n    MSG([[\r\n【Erika】\r\n (I said such thoughtless things, without knowing anything...)\r\n（何も知らずにボクは……なんて心ない言葉を言ってしまったんだ）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[But now, I can’t take back my words. I can’t back down either.\r\nでも今更、言葉を取り消すことなんてできない。\r\n    　ボクだって引くワケにはいかない。]])\r\n\r\n    MSG([[Like Uran-san, I have a position. I represent the boys' division, class 1-A, and many knights—as a 'Battle Princess.'\r\nウランさんと同様に、ボクにも立場がある。\r\n    　男子部と１－Ａ、その他の多くの騎士を代表する存在――『戦姫』としての立場が。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ba\")\r\nPLAY_VOICE(\"erika_0579.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Once the Princess Election ends, I will tell Uran-san my true intentions. That I am not an agent of the board.\"\r\n「ウランさんには、姫選挙が終わったら真意を伝えます。\r\n    　私が、理事会側の回し者ではないということを」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0146.wav\")\r\n\r\n    MSG([[\r\n【Daria】\r\n \"That’s a good look. Makes me want to jump into bed with you right away.\"\r\n「実にいい顔だ。今すぐにでもベッドインしたくなるよ」]])\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0147.wav\")\r\n\r\n    MSG([[\r\n【Daria】\r\n \"Honestly, I thought you’d lose your fighting spirit if I told you this story, so I held back. But that turned out to be an unfounded worry.\"\r\n「正直に言うとね、キミにこの話を聞かせたら戦意を喪失するのではないかと思って、話さないでおいたんだ。しかし、それは杞憂だったらしい」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01fc\")\r\nPLAY_VOICE(\"erika_0580.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"...Thank you. Honestly, I might have withdrawn from the election before.\"\r\n「……ありがとうございます。実際、以前までの私なら、選挙を辞退していたかもしれません」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I didn’t have the courage to fight on behalf of many others besides myself.\r\n以前のボクには、自分以外の大勢のヒトを代表して戦う勇気なんてなかった。]])\r\n\r\n    MSG([[But now it’s different. Many knights and friends support me now.\r\nでも今は違う。\r\n    　今のボクの背中は多くの『騎士』に。友人に。支えられているんだ。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ba\")\r\nPLAY_VOICE(\"erika_0581.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"I won’t say which side is right. Both have convictions and justice, so it can only be decided through earnest battle.\"\r\n「どちらが正義とは言いません。どちらにも信念があって、正義があるのだから、真剣勝負で決める他にないんです」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0148.wav\")\r\n\r\n    MSG([[\r\n【Daria】\r\n \"That’s the spirit. I’ll be cheering for you. Do your best, Erika-kun.\"\r\n「その意気だ。応援しているよ。がんばりたまえ、エリカくん」]])\r\n\r\n    MSG([[Hearing those words, Daria-san warmly encouraged me from behind.\r\nそう語るボクの背中を、ダリアさんもまた、温かく押してくれるのであった。]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    --　　　　◆\r\nSTOP_BGM(1000)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"EP03_14\")\r\nend\r\n"
}