{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP03_28_03",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP03/EP03_28_03.lua",
  "Text": "function EP03_28_03()\r\n  --.結-3C【9月第4週】「アナタの隣に恋焦がれ」\r\n  SaveData.Title = \"アナタの隣に恋焦がれ\"\r\n\r\n  --//BG：病院の廊下\r\n  LAYER_LOAD(LAYER_BG, \"BG010aa\")\r\n  SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM06.wav\")\r\n\r\n  MSG([[After Minato headed to the academy, I decided to visit the hospital where Marika was admitted.\r\n私はミナちんが学園に向かった後、マリっちょの入院している病院を訪れることにした。]])\r\n\r\n  MSG([[There were two purposes. First, to tidy up Marika's surroundings on behalf of busy Minato.\r\n目的はふたつ。\r\n  　まず、忙しいミナちんに代わって、マリっちょの身の回りをキレイにしてあげること。]])\r\n\r\n  MSG([[And second, to have Marika listen to these hazy feelings filling my chest right now.\r\nもうひとつは、今胸の中を埋め尽くしているこのモヤモヤした気持ちを、マリっちょに聞いてもらうためだ。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_AKI01da\")\r\nPLAY_VOICE(\"akira_0486.wav\")\r\n  MSG([[\r\n【Akira】\r\nSadness \"Haa... Coming all the way to the hospital to vent to Sleeping Beauty, I can no longer laugh at Minato anymore.\"\r\n悲しみ\r\n  「ハァ……眠り姫に弱音を聞いてもらおうと病院まで来るなんて、もうミナちんを笑えませんね」]])\r\n\r\nPLAY_VOICE(\"akira_0487.wav\")\r\n  MSG([[\r\n【Akira】\r\nSadness \"But if Marika listens to me, maybe this haze in my chest will ease a little...\"\r\n悲しみ\r\n  「だけど、マリっちょに話を聞いてもらえたら、少しはこの胸のモヤモヤも……」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[While muttering to myself as if to wipe away my anxiety, I arrived in front of Marika's hospital room.\r\n不安を拭い去るように独り言を口にしながら歩いている間に、マリっちょの病室の前に到着。]])\r\n\r\n  MSG([[I reached to open the sliding door, but then I noticed voices coming from inside the room.\r\n中に入ろうと、引き戸の取っ手を握ったものの、そこで病室の中から誰かの話し声がすることに気が付いた。]])\r\n\r\n  --//SE：誰かの囁く声\r\n\r\nLAYER_LOAD_FACE(\"BU_AKI01ca\")\r\nPLAY_VOICE(\"akira_0488.wav\")\r\n  MSG([[\r\n【Akira】\r\nSurprise \"Besides Minato and me, who else could it be...?\"\r\n驚き\r\n  「ミナちんや私以外に、一体誰が……？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[I quietly opened the sliding door just a crack and peeked inside._r There, a somewhat familiar woman was standing in front of Marika's bed.\r\nこっそりと引き戸を少しだけ開けて、中を覗いてみた。_r すると、マリっちょのベッドの前に、どこか見覚えのある女性が立っている。]])\r\n\r\n  MSG([[Apparently, she was speaking to the perpetually sleeping Marika.\r\nその女性はどうやら、眠り続けるマリっちょに何かを語りかけているようだ。]])\r\n\r\n  MSG([[Eavesdropping, I just barely caught what she was saying――\r\n聞き耳を立てると、その内容をかろうじて聞き取ることができた――]])\r\n  --//SE：誰かの囁く声\r\n\r\nLAYER_LOAD_FACE(\"BU_AKI01ga\")\r\nPLAY_VOICE(\"akira_0489.wav\")\r\n  MSG([[\r\n【Akira】\r\nFlustered (…Eh!? Did she just say that she’s the one who cornered Marika?)\r\n焦り\r\n  （……え！？　今、自分がマリっちょを追い詰めた、って）]])\r\n\r\nPLAY_VOICE(\"akira_0490.wav\")\r\n  MSG([[\r\n【Akira】\r\nFlustered (Right. That person is from Yuriai Private Academy... No way...)\r\n焦り\r\n  （そうだ。あのヒトって、百合愛学園の……。そんな、まさか）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[Even the part I managed to hear sent a chill down my spine. I never imagined that \"she\" would be the one who pressured Marika.\r\n何とか聞き取れた一部の内容だけでも、背筋が凍りついてしまう。\r\n  　まさか“彼女”が、マリっちょを追い詰めた犯人だなんて。]])\r\n\r\n  MSG([[I can't even imagine how shocked kind-hearted Minato would be if he found out by accident.\r\nもしお人好しのミナちんが不意に知ってしまったらどれほどショックを受けてしまうか、想像もつかない。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_AKI01ba\")\r\nPLAY_VOICE(\"akira_0491.wav\")\r\n  MSG([[\r\n【Akira】\r\nSerious \"I mustn’t let Minato suffer any more... I have to tell him myself.\"\r\n真剣\r\n  「ミナちんをこれ以上苦しめちゃいけない……わ、私の口からミナちんに伝えないと」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[Without letting \"her\" notice, I quietly left the hospital room.\r\n“彼女”に気付かれないよう、私はそっと病室をあとにした。]])\r\n\r\n  MSG([[Just as I was about to head back to Yuriai Private Academy, I suddenly remembered this morning's events.\r\nそして百合愛学園へと向かおうとしたところで、ふと今朝の出来事を思い出す。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_AKI01ga\")\r\nPLAY_VOICE(\"akira_0492.wav\")\r\n  MSG([[\r\n【Akira】\r\nFlustered (After what happened earlier... how am I supposed to face him?)\r\n焦り\r\n  （あ、あんな出来事があったのに……どんな顔をして会えばいいんですか）]])\r\n\r\nLAYER_LOAD_FACE(\"BU_AKI01da\")\r\nPLAY_VOICE(\"akira_0493.wav\")\r\n  MSG([[\r\n【Akira】\r\nSadness (Knowing Minato, he might have been waiting for me... Ugh, getting all emotional right before the important Princess Election—ugh, I’m such an idiot, idiot, idiot!)\r\n悲しみ （ミナちんのことだから私が来るのを待ってる可能性もありえそうですが……うう、大事な姫選挙の前にメンヘラっちゃうなんて私のバカバカバカ）]])\r\n\r\nPLAY_VOICE(\"akira_0494.wav\")\r\n  MSG([[\r\n【Akira】\r\nSadness \"No good... I can’t be any more of a burden to Minato.\"\r\n悲しみ\r\n  「ダメです……これ以上ミナちんの負担にはなれません」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[Meeting Minato with this fragile state of mind and snapping at him would be terrible.\r\n今の弱ったメンタルでミナちんと会って、悪態をついちゃったら最悪だ。]])\r\n\r\n  MSG([[After much hesitation, I gave up on going to Yuriai Private Academy.\r\n迷いに迷った末に、百合愛学園に行くことは諦めた。]])\r\n\r\n  MSG([[But what I said this morning must be troubling Minato. I don’t want to continue being a burden to him.\r\nだけど、今朝の発言はミナちんを悩ませているはず。\r\n  　このまま彼の負担になり続けたくはない。]])\r\n\r\n  MSG([[Feeling exasperated at my own weakness, I called Minato.\r\n私は自分の心の弱さに呆れ果てつつ、ミナちんに電話をかけるのであった。]])\r\n  --　　　　　◆\r\nSTOP_BGM(1000)\r\n  LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n  SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n  --//BG：校門前\r\n  LAYER_LOAD(LAYER_BG, \"BG005aa\")\r\n  SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM09.wav\")\r\n\r\n  MSG([[Unconsciously, I had walked up to the deserted school gate.\r\nボクは無意識の内に、人気のない校門まで歩いてきた。]])\r\n\r\n  MSG([[There’s no way I’ll meet Akira here.\r\nこんなところに歩いてきたってアキラに会えるワケはない。]])\r\n\r\n  MSG([[Because I left her behind and came to Yuriai Private Academy.\r\nだってボクは、彼女を置いて百合愛学園に来てしまったのだから。]])\r\n\r\n  MSG([[Even though she was suffering, I prioritized everyone at the academy.\r\nアキラが苦しんでいたというのに、学園のみんなを優先してしまったというのに。]])\r\n\r\n  MSG([[I held on to a faint hope that maybe she would come after me.\r\nもしかしたらボクを追いかけてきてくれるかもしれないなんて、淡い希望を抱いている。]])\r\n\r\n  MSG([[I can’t help but feel pathetic about myself.\r\nそんな自分が情けなくて仕方がない。]])\r\n  --//SE：着信音\r\nPLAY_SE(\"SEb011.wav\")\r\nWAIT(500)\r\n\r\n  MSG([[Noticing the ringtone, I looked at my phone and saw Akira's name displayed.\r\n着信音に気付いてスマホを見てみると、そこにはアキラの名前が表示されていた。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ga\")\r\nPLAY_VOICE(\"erika_0762.wav\")\r\n  MSG([[\r\n【Erika】\r\nFlustered \"H-Hello!? Akira!?\"\r\n焦り\r\n  「も、もしもし！　アキラ！？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[I hurriedly answered the call, hearing Akira’s faint voice.\r\n慌てて電話に出ると、か細いアキラの声が聞こえてきた。]])\r\n\r\nPLAY_VOICE(\"akira_0495.wav\")\r\n  MSG([[\r\n【Akira】\r\n \"Minato, I’m sorry for worrying you this morning. I’m calmer now, so please leave me alone.\"\r\n「ミナちん、今朝は心配をかけてしまってごめんなさい。今はもう落ち着いたので、私のことは放っておいてください」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ca\")\r\nPLAY_VOICE(\"erika_0763.wav\")\r\n  MSG([[\r\n【Erika】\r\nSurprise \"L-Leave you alone!? That’s impossible!\"\r\n驚き\r\n  「ほ、放っておけって、何それ！？　そんなことできるはずないじゃない！」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"akira_0496.wav\")\r\n  MSG([[\r\n【Akira】\r\n \"...I realized something. The biggest burden to Minato is me.\"\r\n「……気付いたんですよ。誰よりもミナちんの負担になっているのは私だって」]])\r\n\r\nPLAY_VOICE(\"akira_0497.wav\")\r\n  MSG([[\r\n【Akira】\r\n \"Looking at Minato recently, there’s someone else he wants to spend the school festival with besides me, right? You should make memories with that person.\"\r\n「最近のミナちんを見ていたらわかります。一緒に学園祭を過ごしたい子が、私以外にいるでしょう？　その子と想い出でも作るといいですよ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ba\")\r\nPLAY_VOICE(\"erika_0764.wav\")\r\n  MSG([[\r\n【Erika】\r\nSerious \"That’s not true—Akira is not a burden at all. I want to watch the school festival with you, and I want you to watch the Princess Election too.\"\r\n真剣 「あ、アキラが負担だなんてそんなことない。一緒に学園祭を観て回りたいし、姫選挙だって観てもらいたいよ」]])\r\n\r\nPLAY_VOICE(\"erika_0765.wav\")\r\n  MSG([[\r\n【Erika】\r\nSerious \"Hiyu and Lira have reserved seats so you can watch the Princess Election with peace of mind. Being with them will make you feel safe.\"\r\n真剣 「アキラが姫選挙を安心して観られるよう、ヒユさんやリラさんに席を用意してもらってあるんだ。彼女たちと一緒に観れば安心だよ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01da\")\r\nPLAY_VOICE(\"erika_0766.wav\")\r\n  MSG([[\r\n【Erika】\r\nSadness \"So please... don’t say such sad things. Come to Yuriai Private Academy.\"\r\n悲しみ\r\n  「だからお願い……悲しいことを言わずに、百合愛学園に来てよ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"akira_0498.wav\")\r\n  MSG([[\r\n【Akira】\r\n \"...Understood. There are things I have to tell you, so after I’ve sorted my feelings out, I’ll come to watch the Princess Election. But that’s the limit.\"\r\n「……わかりました。伝えなければいけないこともありますし、気持ちの整理がついたら姫選挙は観に行きます。ですがそれが限界です」]])\r\n\r\nPLAY_VOICE(\"akira_0499.wav\")\r\n  MSG([[\r\n【Akira】\r\n \"Minato... please enjoy your youth properly. My greatest happiness is seeing you smile.\"\r\n「ミナちんは……ちゃんと青春を謳歌してくださいね。私にとっての何よりの幸せは、アナタが笑っていることなのですから」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ga\")\r\nPLAY_VOICE(\"erika_0767.wav\")\r\n  MSG([[\r\n【Erika】\r\nFlustered \"A-Akira!? When you get to the academy, contact me, okay!? Akira, Akira――\"\r\n焦り\r\n  「あ、アキラ！？　学園に着いたら連絡を頂戴ね！？　アキラ、アキラ――」]])\r\nLAYER_LOAD_FACE(\"\")\r\n  --//SE：通話の切れる音\r\nPLAY_SE(\"SEb020.wav\")\r\nWAIT(500)\r\n\r\n  MSG([[The call ended without a word, leaving me standing there stunned.\r\n有無も言わさず通話が切れて、ボクはその場に立ち尽くす。]])\r\n\r\n  MSG([[It’s true that when I thought about who I want to watch the White Sun Festival with, someone other than Akira came to mind.\r\n白陽祭を誰と一緒に見て回りたいか考えた時、アキラ以外のヒトが頭に浮かんだのは事実だ。]])\r\n\r\n  MSG([[Maybe Akira had noticed my true feelings.\r\nもしかしたら、アキラはボクの本心に気付いていたのかもしれない。]])\r\n\r\n  MSG([[That someone becoming more important to me than Akira and Marika Onee-san.\r\nボクの中でアキラやマリカ姉さん以上に、大切なヒトが生まれ始めている事実に。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01da\")\r\nPLAY_VOICE(\"erika_0768.wav\")\r\n  MSG([[\r\n【Erika】\r\nSadness \"I’m sorry for making you feel lonely, Akira.\"\r\n悲しみ\r\n  「寂しい想いをさせてごめんね、アキラ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[I can’t keep crying. Akira went out of her way to worry about me. Sobbing here would ruin everything.\r\n泣いてちゃダメだ。 せっかくアキラがボクを気遣ってくれたのに。 こんなところでメソメソしてたら、台無しじゃないか。]])\r\n\r\n  MSG([[Akira said her greatest happiness is seeing me smile.\r\nアキラの何よりの幸せはボクが笑うことだって言っていた。]])\r\n\r\n  MSG([[For Akira’s sake, I need to properly switch my feelings and enjoy the White Sun Festival.\r\nアキラのためにも、ちゃんと気持ちを切り替えて、白陽祭を楽しまないと。]])\r\n\r\n  MSG([[Because that is the only thing I can do for her as family right now.\r\nそれが彼女の家族として、今のボクに唯一してあげられることなのだから。]])\r\n\r\nSTOP_BGM(1000)\r\n\r\nPLAY_VOICE(\"uran_0180.wav\")\r\n  MSG([[\r\n【????】\r\n \"Erika-san...? Why are you crying?\"\r\n「エリカさん……？　どうして、泣いていらっしゃるのですか？」]])\r\n  --//ウラン\r\n\r\n  --//BU：ウラン（メイド・驚き）\r\n  LAYER_LOAD(50,\"BU_RYU04ca\")\r\n  SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_BGM(\"BGM16.wav\")\r\n\r\n  MSG([[Looking up, there stood Uran-san dressed differently than usual.\r\n顔をあげると、そこには普段と異なる衣服を着たウランさんが立っていた。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ca\")\r\nPLAY_VOICE(\"erika_0782.wav\")\r\n  MSG([[\r\n【Erika】\r\nSurprise \"U-Uran-san, that outfit...?\r\n驚き\r\n  「う、ウランさん、その恰好は……？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04aa\")\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0181.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Normal \"Our group is running a <r=メイド>Meido</r> Café as an attraction. I'm wearing <r=メイド>Meido</r> clothes along with everyone else.\"\r\nメイド・通常 「わたくしの組は出し物として、<r=メイド>冥土</r>喫茶をやっていまして。わたくしも皆さんと一緒に、<r=メイド>冥土</r>の服を着ていますの」]])\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04ea\")\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0182.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Smile \"It’s my first time learning, but apparently when you fulfill your destiny and walk the Meido, you wear such adorable Western-style clothes.\"\r\nメイド・笑顔 「わたくしも初めて知ったのですが、天命を全うして冥土を歩む際は、これほど可愛らしい洋装を身にまとうのですね」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01fa\")\r\nPLAY_VOICE(\"erika_0783.wav\")\r\n  MSG([[\r\n【Erika】\r\nWry smile, sweat \"I’m sure that’s a different kind of maid.\"\r\n苦笑・汗\r\n  「きっとそれは、メイド違いだと思います」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[Uran-san’s silly comment made me laugh.\r\nウランさんのおとぼけ発言に、つい笑ってしまった。]])\r\n\r\n  MSG([[My heavy heart felt a little lighter.\r\n沈んでいた心が少しだけ軽くなる。]])\r\n\r\n  MSG([[Whether it’s her personality or presence, I always feel at ease beside Uran-san, even when down.\r\n人柄のおかげか、佇まいのおかげか。\r\n  　やっぱりウランさんのそばにいると、心が沈んでいても、ホッと落ち着いてしまうから不思議だ。]])\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04aa\")\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0183.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Normal \"What happened? I saw Erika-san with a downcast face leaving the school building, so I came over out of concern.\"\r\nメイド・通常\r\n  「どうかなさったのですか？　校舎から浮かない顔でエリカさんが外に出ていかれるのを拝見して、気になって来てみたのですが」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01da\")\r\nPLAY_VOICE(\"erika_0784.wav\")\r\n  MSG([[\r\n【Erika】\r\nSadness \"I-I'm sorry to worry you. It’s just a quarrel with my sister, so don’t mind it.\"\r\n悲しみ\r\n  「そ、そうでしたか、心配をかけてしまってすみません。妹と喧嘩をしてしまっただけですから、気にしないでください」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ja\")\r\nPLAY_VOICE(\"erika_0785.wav\")\r\n  MSG([[\r\n【Erika】\r\nTearful smile \"Seeing Uran-san’s face gave me some strength. Even though we’ll be opponents at the Princess Election soon... thank you for your kindness.\"\r\n泣き笑い 「ウランさんの顔を見たら、何だか元気が出てきました。あと少ししたら姫選挙で敵対するのに……お気遣いありがとうございます」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04fc\")\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0184.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Wry smile \"Nonsense. As I told you recently, we are friends before we are rivals. It’s only natural to worry.\"\r\nメイド・苦笑\r\n  「何をおっしゃいますか。先日も申し伝えた通り、わたくしたちは敵対する以前に友人同士。心配するのは当たり前です」]])\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04ea\")\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0185.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Smile \"Since it’s a special occasion, why don’t you come to our shop? As one who <r=いざな>guides</r> souls to the Meido, I will serve you plenty.\"\r\nメイド・笑顔 「せっかくですから、わたくしたちのお店に来てくださいませんか？　冥土へ<r=いざな>誘</r>う者として、たっぷりご奉仕させていただきますわ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01fa\")\r\nPLAY_VOICE(\"erika_0786.wav\")\r\n  MSG([[\r\n【Erika】\r\nWry smile, sweat \"Serving to guide to the Meido sounds a bit scary.\"\r\n苦笑・汗\r\n  「冥土に誘うご奉仕って、何だかコワい響きですね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[Laughing, I placed my hand over the one Uran-san offered. The warmth calmed me even more.\r\n笑いつつ、ウランさんが差し出してくれた手に自分の手を重ねる。\r\n  　その温もりに触れると、心が更に安らいでいく。]])\r\n\r\n  MSG([[I realized once again how much Uran-san is becoming an important presence to me.\r\nボクの中でウランさんが如何に大きな存在になりつつあるかを、改めて実感した。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ha\")\r\nPLAY_VOICE(\"erika_0787.wav\")\r\n  MSG([[\r\n【Erika】\r\nBlushing (After all, the one I want to walk the White Sun Festival with... is only Uran-san.)\r\n赤面\r\n  （やっぱり、ボクが白陽祭を一緒に回りたい相手は……ウランさんしかいない）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[The thought crossed my mind, but I gave up since we are rivals now.\r\n頭に浮かびはしたけれど、今は敵対関係だからと諦めていた。]])\r\n\r\n  MSG([[But meeting Uran-san now like this can’t be a coincidence. I want to believe it’s not. Surely Akira gave me a push.\r\nだけど今こうしてウランさんと出会えたことは、きっと偶然じゃない。偶然じゃないと思いたい。きっとアキラが背中をあと押ししてくれたおかげだ。]])\r\n\r\n  MSG([[Bracing myself for rejection, I mustered the courage to invite Uran-san.\r\nボクは断られるのを覚悟で、勇気を振り絞ってウランさんを誘ってみることにした。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01aa\")\r\nPLAY_VOICE(\"erika_0788.wav\")\r\n  MSG([[\r\n【Erika】\r\nNormal \"Uran-san, if you don’t mind, would you accompany me around the White Sun Festival?\"\r\n通常\r\n  「ウランさん、もしよければ私と一緒に、白陽祭を回っていただけませんか？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04ca\")\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0186.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Surprise \"Eh...?\"\r\nメイド・驚き\r\n  「え……？」]])\r\n\r\n  MSG([[Uran-san looked puzzled. Such an invitation is normally impossible, so that reaction was natural.\r\nウランさんがキョトンとする。\r\n  　普通ならありえない誘いなのだから、その反応も当たり前だ。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01fa\")\r\nPLAY_VOICE(\"erika_0789.wav\")\r\n  MSG([[\r\n【Erika】\r\nWry smile, sweat \"I’m sorry for saying something strange even though we’re about to face off in the Princess Election.\"\r\n苦笑・汗\r\n  「もうすぐ姫選挙で戦うというのに、変なことを言い出してしまって、ごめんなさい」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ea\")\r\nPLAY_VOICE(\"erika_0790.wav\")\r\n  MSG([[\r\n【Erika】\r\nSmile \"But I want to enjoy the White Sun Festival with dear friend Uran-san. This year’s festival can only be seen now.\"\r\n笑顔\r\n  「ですが、大切な友人であるウランさんと一緒に、白陽祭を見て回りたいんです。今年の白陽祭は今しか見られませんから」]])\r\n\r\nPLAY_VOICE(\"erika_0791.wav\")\r\n  MSG([[\r\n【Erika】\r\nSmile \"If I don’t go around with Uran-san now, I feel I’ll regret it forever.\"\r\n笑顔\r\n  「今ウランさんと一緒に見て回らないと、一生後悔してしまう気がするんです」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[Uran-san covered her mouth and looked around awkwardly.\r\nウランさんは口元に手を当てたまま、困ったように視線を泳がせる。]])\r\n\r\n  MSG([[After a while of silence, she slowly nodded.\r\nそれからしばらく黙っていたかと思うと、ゆっくりと首を縦に振った。]])\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04aa\")\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0187.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Normal \"...I would be delighted to accept, if that is your wish, Erika-san. It’s a great honor.\"\r\nメイド・通常\r\n  「……喜んで、お受けいたしますわ。エリカさんがそうおっしゃってくださるなら、わたくしとしても大歓迎です」]])\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04ea\")\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0188.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Smile \"Honestly, I too wished to see the festival with Erika-san.\"\r\nメイド・笑顔\r\n  「わたくしも本心では、エリカさんと一緒に白陽祭を回りたいと願っていましたからね」]])\r\n\r\nPLAY_VOICE(\"uran_0189.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Smile \"Shall we go then?\"\r\nメイド・笑顔\r\n  「それではまいりましょうか」]])\r\n\r\n  MSG([[Hand in hand with Uran-san, we began walking. Thus started an unexpected friendly outing with Uran-san.\r\nウランさんに手を引かれて、二人で歩き出す。\r\n  　こうして想いもしていなかった、ウランさんと二人での物見遊山が始まるのであった。]])\r\n\r\n  LAYER_LOAD(50,\"\")\r\n\r\n  --　　　　◆\r\nSTOP_BGM(2000)\r\n  LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n  SWITCH_SCREEN(\"mask002\" , 1000,false)\r\n\r\n  --//BG：メインストリート（学園祭）\r\n  LAYER_LOAD(LAYER_BG, \"BG019da\")\r\n  SWITCH_SCREEN(\"mask002\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM08.wav\")\r\n\r\n  --//BU：モブ女子生徒Ａ・Ｂ・Ｃ\r\n  LAYER_LOAD(50,\"BU_MOB04aa\")\r\n  LAYER_POSITION(50,600,0)\r\n  LAYER_LOAD(55,\"BU_MOB05aa\")\r\n  LAYER_POSITION(55,-600,0)\r\n  LAYER_LOAD(60,\"BU_MOB06aa\")\r\n  SWITCH_SCREEN(\"mask000\",500,false)\r\n\r\nPLAY_VOICE(\"schoolgirl_0115.wav\")\r\n  MSG([[\r\n【Female Student】\r\n \"It’s the famous Yuriai Academy ‘Extra Veggie Chicken Bowl’! Those who finish it within five minutes receive a ‘Battle Princess’ bromide――\"\r\n「百合愛学園名物『ヤサイマシマシ鶏ちゃん丼』ですよー！　五分以内に完食できた方には、『戦姫』のブロマイドを差し上げ――」]])\r\n\r\nPLAY_VOICE(\"schoolgirl_0116.wav\")\r\n  MSG([[\r\n【Female Student】\r\n \"E-Erika Onee-sama and Uran-sama!? Why is this legendary pairing appearing!? Is this a dream…!?\"\r\n「え、エリカお姉さまとウランさま！？　もはや幻と語られていたカップリングが何故！？　もしや、これは夢…！？」]])\r\n\r\nPLAY_VOICE(\"schoolgirl_0117.wav\")\r\n  MSG([[\r\n【Female Student】\r\n \"K-Keep your composure! This is reality! The pure pair from Yuriai Academy is right here before you!\"\r\n「き、気をしっかり持ちなさい！　アレは現実ですわ！　百合愛学園の清楚ペアがちゃんと目の前におりますわよ！？」]])\r\n\r\nPLAY_VOICE(\"schoolgirl_0118.wav\")\r\n  MSG([[\r\n【Female Student】\r\n \"Aaaaah... The most Yamato Nadeshiko of the academy and rumored returnee Erika-sama together... such a beautiful sight.\"\r\n「あ、ああああ……学園一の大和撫子と、帰国子女と噂されるエリカさまのコントラスト……なんと麗しい光景」]])\r\n\r\n  LAYER_LOAD(50,\"\")\r\n  LAYER_LOAD(55,\"\")\r\n  LAYER_LOAD(60,\"\")\r\n  SWITCH_SCREEN(\"mask000\",500,false)\r\n\r\n  --//BU：ウラン（メイド・苦笑）\r\n  LAYER_LOAD(50,\"BU_RYU04fc\")\r\n  SWITCH_SCREEN(\"mask000\",500,false)\r\n\r\nPLAY_VOICE(\"uran_0190.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Wry smile \"Just us getting along makes everyone so excited.\"\r\nメイド・苦笑\r\n  「わたくしたちが仲良くしているだけで、皆さん大騒ぎしてくださいますね」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01fa\")\r\nPLAY_VOICE(\"erika_0792.wav\")\r\n  MSG([[\r\n【Erika】\r\nWry smile, sweat \"Since people don’t know the situation, they probably think we’re quarreling. Oh well.\"\r\n苦笑・汗\r\n  「事情を知らない皆さんは、きっと仲違いしたと思っていますからね。仕方ありません」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01aa\")\r\nPLAY_VOICE(\"erika_0793.wav\")\r\n  MSG([[\r\n【Erika】\r\nNormal \"There are lots of stalls; would you like to eat something?\"\r\n通常\r\n  「たくさんお店がありますし、何か食べていかれますか？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04ea\")\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0191.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Smile \"May I? I’ve been interested in that stall over there.\"\r\nメイド・笑顔\r\n  「よろしいのですか？　実はわたくし、あちらのお店がとても気になっておりまして」]])\r\n\r\n  MSG([[Uran-san pointed at a stall labeled ‘Demon World Style French Fries.’\r\nウランさんが指差した先には、『魔界風フレンチフライ』と書かれた出店があった。]])\r\n\r\n  MSG([[Apparently, they sell fries with a spicy special sauce.\r\nどうやら辛口の特別ソースつきのフライドポテトを売っているみたいだ。]])\r\n\r\n  MSG([[The fries sizzle in the fryer, and the aroma of fried food is rich.\r\nフライヤーの中でポテトがジュワジュワと音を立て、漂ってくる揚げ物の香りが香ばしい。]])\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04aa\")\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0192.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Normal \"French and potatoes—I know those. France and potatoes, yes?\"\r\nメイド・通常\r\n  「フレンチとポテトでしたら、わたくしでもわかりますわ。おフランスとお芋のことですよね？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01fc\")\r\nPLAY_VOICE(\"erika_0794.wav\")\r\n  MSG([[\r\n【Erika】\r\nWry smile \"Yes. Adding ‘Demon World Style’ feels redundant though—it’s like saying ‘French-style potatoes of the Demon World.’\"\r\n苦笑\r\n  「ええ、そうです。『魔界風』をつけたら、『魔界風のフランス風のお芋』って、意味が重複してしまう気もしますけど」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04ea\")\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0193.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Smile \"At home, potatoes are for simmered dishes; I’ve never eaten fried potatoes, so I’ve been curious.\"\r\nメイド・笑顔\r\n  「実家ではお芋と言えば煮物ですし、揚げたお芋など口にしたことがありませんから、ずっと気になっていましたの」]])\r\n\r\n  MSG([[Uran-san’s eyes sparkled as she spoke to the student frying the potatoes.\r\nウランさんは目を輝かせて、ポテトを揚げている生徒に話しかけた。]])\r\n\r\n  --//BU：モブ女子生徒Ｇ、ウラン（メイド・笑顔）\r\n  --LAYER_LOAD(50,\"BU_RYU04ea\")\r\n  --LAYER_POSITION(50,400,0)\r\n  LAYER_LOAD(55,\"BU_MOB10aa\")\r\n  LAYER_POSITION(55,-600,0)\r\n  SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"uran_0194.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Smile \"One order of Demon World Style French Fries, please.\"\r\nメイド・笑顔\r\n  「魔界風フレンチフライ、おひとつくださいな」]])\r\n\r\nPLAY_VOICE(\"schoolgirl_0119.wav\")\r\n  MSG([[\r\n【Female Student】\r\n \"U-Uran Hime!? And Erika Hime too!? Pl-please, take as much as you want!\"\r\n「う、ウラン姫！？　それにエリカ姫まで！？　ど、どうぞどうぞ！　いくらでも持って帰ってくださいまし！」]])\r\n\r\n  MSG([[Students rushed out of the stall and stopped Uran-san from pulling out her wallet.\r\n屋台の中から生徒たちが飛び出してきて、懐から財布を取り出そうとしたウランさんを制止。]])\r\n\r\n  MSG([[With beast-like agility, they handed over a cup of freshly fried fries with bright red sauce.\r\n獣みたいに俊敏な動きで、揚げたてのポテトと真っ赤なソースの入った紙コップを手渡した。]])\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04ga\")\r\n  LAYER_POSITION(50,0,0)\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0195.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Flustered \"P-please let me pay properly!\"\r\nメイド・焦り\r\n  「そ、そんな。きちんと対価を払わせてくださいまし！」]])\r\n\r\nPLAY_VOICE(\"schoolgirl_0120.wav\")\r\n  MSG([[\r\n【Female Student】\r\n \"We can’t accept money from the two about to enter the Princess Election! If our fries give you strength, that’s the best payment!\"\r\n「これから姫選挙に臨むお二人からお金など受け取れません！　私たちのポテトがお二人の活力になるのでしたら、それが何よりの対価です！」]])\r\n\r\n  MSG([[Uran-san tried to pay, but they refused firmly. After expressing our thanks, we hurried on.\r\nウランさんがお金を支払おうとするものの、頑として受け取ってくれない。\r\n  　きちんとお礼を伝えて、ボクらは先を急ぐことにした。]])\r\n\r\n  LAYER_LOAD(50,\"\")\r\n  LAYER_LOAD(55,\"\")\r\n  LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n  SWITCH_SCREEN(\"mask006\",1000,false)\r\n\r\n  LAYER_LOAD(LAYER_BG,\"BG019da\")\r\n  SWITCH_SCREEN(\"mask006\",1000,false)\r\n\r\n  --//BU：ウラン（メイド・驚き）\r\n  LAYER_LOAD(50,\"BU_RYU04ca\")\r\n  SWITCH_SCREEN(\"mask000\",500,false)\r\n\r\nPLAY_VOICE(\"uran_0196.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Surprise \"Eating while walking is bad manners. Erika-san, shall we sit on those chairs and eat first?\"\r\nメイド・驚き\r\n  「あ、食べ歩きは無作法ですね。エリカさん、あちらの椅子に座って、食べ終わってからまいりましょうか」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ca\")\r\nPLAY_VOICE(\"erika_0795.wav\")\r\n  MSG([[\r\n【Erika】\r\nSurprise \"Y-You’re right. Sorry.\"\r\n驚き\r\n  「そ、そうでしたね。失礼しました」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  LAYER_LOAD(50,\"\")\r\n  LAYER_LOAD(LAYER_BG,\"BG019de\")\r\n  LAYER_POSITION(LAYER_BG,-700,200)\r\n  SWITCH_SCREEN(\"mask000\",1000,false)\r\n\r\n  MSG([[Sitting side by side on a bench Uran-san found, we began nibbling the fries.\r\nウランさんの見つけたベンチに並んで座り、二人でポテトをつまみ始める。]])\r\n\r\n  MSG([[I hadn’t really been mindful that eating while walking is impolite.\r\n食べ歩きが無作法だなんて、普段あまり意識できていない。]])\r\n\r\n  MSG([[When sitting down, Uran-san casually pulled a thin cloth from her pocket and laid it where she would sit.\r\n今ベンチに座る際も、ウランさんは手慣れた様子で懐から薄手の布を取り出して、自分の座る場所に敷いた。]])\r\n\r\n  MSG([[Though I’ve been at Yuriai for only six months, Uran-san, raised as a noble, clearly has much more refinement.\r\n百合愛学園に通い始めてまだ半年のボクと、生まれついてのお嬢様であるウランさんとでは、やっぱり教養に大きな差があるんだ。]])\r\n\r\n  LAYER_LOAD(50,\"BUL_RYU04ea\")\r\n  SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"uran_0197.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Smile \"Erika-san, these are delicious. They’re even better dipped in this sauce; please try it.\"\r\nメイド・笑顔\r\n  「エリカさん、おいしいですね。こちらのタレにつけると更においしいですよ、ぜひお試しくださいまし」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01fc\")\r\nPLAY_VOICE(\"erika_0796.wav\")\r\n  MSG([[\r\n【Erika】\r\nWry smile \"Thank you.\"\r\n苦笑\r\n  「ありがとうございます」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[I reached into the paper bag on Uran-san's lap, grabbed some fries, dipped them in the sauce in the cup also on her lap, and bit in.\r\nウランさんの膝上に置かれた紙袋に手を入れ、ポテトを取り出し、同じく膝上の紙コップのソースに少しつけて頬張る。]])\r\n\r\n  MSG([[Mmm, the sweet and sour tomato blends with the spicy chili—it’s tasty. The color looks fiery, so I was worried, but it’s like chili sauce.\r\nうん、トマトの甘酸っぱさと唐辛子の辛さが合わさって美味しい。とても辛そうな色だから少し心配だったけれど、どうやらチリソースみたいだ。]])\r\n\r\nPLAY_VOICE(\"uran_0198.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Smile \"I’m a messenger of the Meido now. Shall I carry some potatoes for you, Erika-san?\"\r\nメイド・笑顔\r\n  「今のわたくしは冥土の使いですから。エリカさんにお芋を運んで差し上げましょうか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ga\")\r\nPLAY_VOICE(\"erika_0797.wav\")\r\n  MSG([[\r\n【Erika】\r\nFlustered \"N-no! That’s too much honor!\"\r\n焦り\r\n  「い、いえいえ！　そんな、恐れ多すぎます！」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  LAYER_LOAD(50,\"BUL_RYU04oa\")\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0199.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Yandere \"Don’t hesitate. Master, please open your mouth. Here, aahn<sprite=\"Emoji\" name=\"heart\">\"\r\nメイド・ヤンデレ\r\n  「遠慮なさらずに。旦那様、お口を開けてくださいまし。はい、あ～ん<sprite=\"Emoji\" name=\"heart\">」]])\r\n\r\n  -- //CI：あーんしてポテトを食べるエリカとウラン 068\r\n  LAYER_LOAD(55,\"CI068a\")\r\n  SWITCH_SCREEN(\"mask000\",1000,false)\r\n  WAIT(500)\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ga\")\r\nPLAY_VOICE(\"erika_0798.wav\")\r\n  MSG([[\r\n【Erika】\r\nFlustered \"A-Aahn...\"\r\n焦り\r\n  「あ、あ～ん…」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  LAYER_LOAD(55,\"\")\r\n  SWITCH_SCREEN(\"mask000\",800,false)\r\n\r\n  LAYER_LOAD(50,\"BUL_RYU04ea\")\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0200.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Smile \"Ufufu<sprite=\"Emoji\" name=\"heart\"> Thank you for the food.\"\r\nメイド・笑顔\r\n  「うふふ<sprite=\"Emoji\" name=\"heart\">　お粗末様でした」]])\r\n\r\n  MSG([[As we ate fries, casual chatter continued.\r\nポテトを食べ進めつつ、他愛ない雑談が続く。]])\r\n\r\n  MSG([[It felt strange to be eating fries side by side when just a few hours later we’d be opponents on stage.\r\nあと数時間もしたら、ステージ上でぶつかり合うというのに、並んでポテトを食べているなんて不思議な気分。]])\r\n\r\n  MSG([[But it was a very pleasant time.\r\nでも、とても心地のいい時間だった。]])\r\n\r\n  LAYER_LOAD(50,\"\")\r\n  LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n  SWITCH_SCREEN(\"mask000\",1000,false)\r\n  WAIT_INPUT(1000)\r\n\r\n  --//BG：3F廊下\r\n  LAYER_LOAD(LAYER_BG, \"BG013ac\")\r\n  SWITCH_SCREEN(\"mask007\" , 1000,false)\r\n\r\n  MSG([[Then we visited various stalls around the school together.\r\nそれからボクたちは、校内の色んな出店を二人で見て回った。]])\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04da\")\r\n  SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"uran_0201.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Sadness \"The haunted house by Class 2-D was rumored to be scary, so I was looking forward to it.\"\r\nメイド・悲しみ\r\n  「２年Ｄ組のお化け屋敷はコワいと評判でしたから、とても楽しみにしていたのですが」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01fa\")\r\nPLAY_VOICE(\"erika_0799.wav\")\r\n  MSG([[\r\n【Erika】\r\nWry smile, sweat \"The ghosts were so polite that they didn’t scare us at all.\"\r\n苦笑・汗\r\n  「お化けの皆さん、私たちに恐縮しきりでコワがらせてくれませんでしたね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"uran_0202.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Sadness \"Being a ‘Princess’ comes with inconveniences. If there’s a next time, I’ll hide my face with bandages to enter.\"\r\nメイド・悲しみ\r\n  「『姫』とは不便なのものですね。もし次の機会があるなら、包帯などで顔を隠して入りましょう」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ca\")\r\nPLAY_VOICE(\"erika_0800.wav\")\r\n  MSG([[\r\n【Erika】\r\nSurprise \"T-That would make you blend in with the ghosts…!?\"\r\n驚き\r\n  「そ、それはお化け側に紛れちゃうのでは……！？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  LAYER_LOAD(50,\"\")\r\n\r\n  --//BG：1-B教室\r\n  LAYER_LOAD(LAYER_BG, \"BG014ab\")\r\n  SWITCH_SCREEN(\"mask006\" , 1000,false)\r\n\r\n  LAYER_LOAD(55,\"BU_RIR04ia\")\r\n  LAYER_POSITION(55,-600,0)\r\n  LAYER_MOVE_POSITION(55,-400,0,500,Ease.OutSine)\r\n  SWITCH_SCREEN(\"mask000\",500,false)\r\nPLAY_VOICE(\"lira_0409.wav\")\r\n\r\n  MSG([[\r\n【Lira】\r\nGym Clothes - Wink \"Good job! Erika out on a date with the academy’s top lady-good-for-you!<sprite=\"Emoji\" name=\"note\">\"\r\n体操服・ウインク\r\n  「お疲れーッス！　エリカってば学園一のお嬢様とデートなんて、いいご身分じゃーん<sprite=\"Emoji\" name=\"note\">」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01fa\")\r\nPLAY_VOICE(\"erika_0801.wav\")\r\n  MSG([[\r\n【Erika】\r\nWry smile, sweat \"I’m probably the most envied person in the academy right now.\"\r\n苦笑・汗\r\n  「多分今の私、この学園で一番の嫉妬の的ですね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  --LAYER_POSITION(55,-400,0)\r\n  LAYER_LOAD(50,\"BU_RYU04da\")\r\n  LAYER_POSITION(50,400,0)\r\n  SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"uran_0203.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Sadness \"I’m sorry, Lira-san, for taking the rights to run the ‘Meido Café’ during attraction selection.\"\r\nメイド・悲しみ\r\n  「出し物決めでは『冥土喫茶』の権利をいただいてしまってごめんなさいね、リラさん」]])\r\n\r\n  LAYER_LOAD(55,\"BU_RIR04ea\")\r\n  LAYER_POSITION(55,-400,0)\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"lira_0410.wav\")\r\n\r\n  MSG([[\r\n【Lira】\r\nGym Clothes - Smile \"Don’t worry about it. Thanks to that, it became a fun store making customers cosplay.\"\r\n体操服・笑顔\r\n  「気にしないでくださいよ。そのおかげで、お客さんにもコスプレさせる面白い店になったし」]])\r\n\r\n  LAYER_LOAD(55,\"BU_RIR04ia\")\r\n  LAYER_POSITION(55,-400,0)\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"lira_0411.wav\")\r\n\r\n  MSG([[\r\n【Lira】\r\nGym Clothes - Wink \"How about you two cosplay at the festival? Well... Uran-senpai already is.\"\r\n体操服・ウインク\r\n  「どう？　せっかくだから、お二人さんもコスプレしてかない？　って……ウラン先輩はコスプレ済みだけど」]])\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04ea\")\r\n  LAYER_POSITION(50,400,0)\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0204.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Smile \"Is that alright? Then, Erika-san, I’ll provide you with Meido clothes.\"\r\nメイド・笑顔\r\n  「よろしいんですか？　それでは、エリカさんにも冥土の服を」]])\r\n\r\n  LAYER_LOAD(55,\"BU_RIR04ea\")\r\n  LAYER_POSITION(55,-400,0)\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"lira_0412.wav\")\r\n\r\n  MSG([[\r\n【Lira】\r\nGym Clothes - Smile \"Okay~<sprite=\"Emoji\" name=\"star\">\"\r\n体操服・笑顔\r\n  「オッケ～<sprite=\"Emoji\" name=\"star\">」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ga\")\r\nPLAY_VOICE(\"erika_0802.wav\")\r\n  MSG([[\r\n【Erika】\r\nFlustered \"W-Wait! I have bad memories of maid costumes…\"\r\n焦り\r\n  「ちょ、ちょっと待ってください！　私、メイド服にはあまりいい思い出がなくて……」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04aa\")\r\n  LAYER_POSITION(50,400,0)\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0205.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Normal \"Earlier I called you ‘Master,’ Erika-san, yes? I too want to be called ‘Master’ by Erika-san once.\"\r\nメイド・通常\r\n  「先ほどはわたくしが、エリカさんを旦那様と仰ぎましたでしょう？　わたくしも一度は、エリカさんから『旦那様』と呼ばれてみたいのですが」]])\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04da\")\r\n  LAYER_POSITION(50,400,0)\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0206.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Sadness \"...Would you please wear it?\"\r\nメイド・悲しみ\r\n  「……着て、いただけませんか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01da\")\r\nPLAY_VOICE(\"erika_0803.wav\")\r\n  MSG([[\r\n【Erika】\r\nSadness \"Ugh... th-that's...\"\r\n悲しみ\r\n  「うっ……そ、それはぁ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[Uran-san, that look is unfair._r But it’s embarrassing to show up in maid clothes in front of so many people.\r\nウランさん、その顔はズルいです。_r\r\n  　でも、この大勢の前でメイド姿を披露するなんて恥ずかしい。]])\r\n\r\n  MSG([[Above all, wearing maid clothes in front of someone I respect like Uran-san...\r\n何より、いくらウランさんの頼みとは言え、尊敬するウランさんの目の前でメイド服だなんて……。]])\r\n\r\n  LAYER_LOAD(55,\"BU_RIR04da\")\r\n  LAYER_POSITION(55,-400,0)\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"lira_0413.wav\")\r\n\r\n  MSG([[\r\n【Lira】\r\nGym Clothes - Sadness \"Sorry, Uran-senpai, but all the maid outfits are currently lent out.\"\r\n体操服・悲しみ\r\n  「ごめん、ウラン先輩。ちょうどメイド服、全部貸し出し中だったわ」]])\r\n\r\nPLAY_VOICE(\"uran_0207.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Sadness \"I see. I’d have liked to see Erika-san in those Meido clothes at least once.\"\r\nメイド・悲しみ\r\n  「そう、でしたか。冥土服を着たエリカさんを、一度拝見してみたかったのですが」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01fa\")\r\nPLAY_VOICE(\"erika_0804.wav\")\r\n  MSG([[\r\n【Erika】\r\nWry smile, sweat \"...Phew.\"\r\n苦笑・汗\r\n  「……ホッ」]])\r\n  LAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[Heaven hasn't abandoned me. I’m truly grateful for such unexpected luck.\r\n天はボクを見放してはいなかった。\r\n  　思わぬ幸運に、ボクは心から感謝する。]])\r\n\r\n  MSG([[However――\r\nところが――]])\r\n\r\n  LAYER_LOAD(55,\"BU_RIR04eb\")\r\n  LAYER_POSITION(55,-400,0)\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"lira_0414.wav\")\r\n\r\n  MSG([[\r\n【Lira】\r\nGym Clothes - Smile \"Instead, how about a fashion show at my shop with everyone’s costumes during the next holiday?\"\r\n体操服・笑顔\r\n  「その代わりと言っちゃなんだけど、今度の休みにみんなで集まって、ウチの店に集まった衣装でエリカのファッション・ショーを開かない？」]])\r\n\r\n  LAYER_LOAD(55,\"BU_RIR04ia\")\r\n  LAYER_POSITION(55,-400,0)\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"lira_0415.wav\")\r\n\r\n  MSG([[\r\n【Lira】\r\nGym Clothes - Wink \"Erika can pull off any clothes, not just maid suits.\"\r\n体操服・ウインク\r\n  「エリカならメイド服だけじゃなく、どんな服だって着こなせちゃうだろうしさ」]])\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04oa\")\r\n  LAYER_POSITION(50,400,0)\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0208.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Yandere \"That's wonderful. Let's make it happen. The Ryuguuin family will give full support.\"\r\nメイド・ヤンデレ\r\n  「それは素敵ですね。ぜひ実現させましょう。龍宮院家が総力をもって助力いたしますわ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01da\")\r\nPLAY_VOICE(\"erika_0805.wav\")\r\n  MSG([[\r\n【Erika】\r\nSadness \"W-Why does it have to become such a big deal!?\"\r\n悲しみ\r\n  「ど、どうしてそんな大事になるんですかー！？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[I pulled Uran-san’s hand and hurriedly left Lira’s shop as if escaping.\r\nボクはウランさんの手を引いて、逃げるようにリラさんのお店をあとにした。]])\r\n\r\n  LAYER_LOAD(50,\"\")\r\n  LAYER_LOAD(55,\"\")\r\n  LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n  SWITCH_SCREEN(\"mask029\",1000,false)\r\n  WAIT_INPUT(1000)\r\n\r\n  --//BG：和室\r\n  LAYER_LOAD(LAYER_BG, \"BG022aa\")\r\n  LAYER_LOAD(50,\"BU_RYU04ea\")\r\n  SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_VOICE(\"uran_0209.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Smile \"Thank you for your company. I had a wonderful time.\"\r\nメイド・笑顔\r\n  「お付き合いありがとうございます。とても楽しい時間が過ごせましたわ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ea\")\r\nPLAY_VOICE(\"erika_0806.wav\")\r\n  MSG([[\r\n【Erika】\r\nSmile \"Thank you as well. I had fun spending time with you, Uran-san.\"\r\n笑顔\r\n  「こちらこそありがとうございます。ウランさんと一緒に回ることができて、私も楽しかったですよ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[I was shown into the Japanese-style room where Uran-san’s class was running the maid café, and given a cup of tea.\r\nウランさんのクラスがメイド喫茶店を開いている和室へと案内され、一杯のお茶を差し出された。]])\r\n\r\n  MSG([[Like before, the tea vessel was filled with pale brown liquid. Could it be the milk tea made with the kelp tea from last time?!\r\nいつかと同様に、和風の茶器に薄茶色の液体が満ちている。\r\n  　これはまさか、例の昆布茶で作ったミルクティー！？]])\r\n\r\nPLAY_VOICE(\"uran_0210.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Smile \"Rest assured. This time it’s a proper milk tea.\"\r\nメイド・笑顔\r\n  「ご安心くださいまし。今度はちゃんとした“みるくてぃ”でございますわ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ca\")\r\nPLAY_VOICE(\"erika_0807.wav\")\r\n  MSG([[\r\n【Erika】\r\nSurprise \"I-I see. Then, thank you.\"\r\n驚き\r\n  「そ、そうですか。それでは、いただきます」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[Even as Uran-san said that, I couldn’t help but feel nervous recalling that unpleasant fishy taste from before.\r\nウランさんからそう言われつつも、過去に苦しんだ磯臭さがフラッシュバックされ、やっぱりドキドキしてしまう。]])\r\n\r\n  MSG([[I cautiously lifted the tea cup, trying not to smell it, and sipped.\r\n茶器を手に取って、ニオイを嗅がないよう注意しつつ、恐る恐る口をつけてみた。]])\r\n  --//SE：飲む音\r\nPLAY_SE(\"SEa010.wav\")\r\nWAIT(500)\r\n\r\n  MSG([[What spread in my mouth was a rich milk flavor blending with the full-bodied aroma of tea leaves.\r\n口の中に広がったのは、濃厚なミルクの風味と、そこに溶け込む芳醇な茶葉の香り。]])\r\n\r\n  MSG([[The milk stands out strongly, but the tea is not overwhelmed—instead, they combine harmoniously.\r\nミルクが強く感じられるけれど、その濃い味わいに茶葉が負けていなくて、ひとつに合わさっている。]])\r\n\r\n  MSG([[This isn’t just tea with milk added. They must have carefully selected tea leaves strong enough to stand up to the milk and slowly brewed them in milk to achieve this flavor.\r\nこれは、紅茶にミルクを加えた味わいじゃない。 ミルクの味に負けない茶葉を厳選した上で、時間をかけて丁寧にミルクで茶葉を煮出さないと出せない味だ。]])\r\n\r\n  MSG([[I was simply moved by this delicious surprise.\r\nいい意味で期待を裏切る美味しさに、ボクはただただ感動するばかりだった。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ea\")\r\nPLAY_VOICE(\"erika_0808.wav\")\r\n  MSG([[\r\n【Erika】\r\nSmile \"Amazing... Uran-san, this tea’s flavor is something special.\"\r\n笑顔\r\n  「スゴい……スゴいですよ、ウランさん。このお茶の味はなかなか出せるものじゃありません」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04aa\")\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0211.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Normal \"Thanks to your guidance, Erika-san and Lira-san.\"\r\nメイド・通常\r\n  「エリカさんとリラさんのご指導のおかげですわ」]])\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04ea\")\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0212.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Smile \"I’m sorry for the terrible tea last time. It was my first time properly studying Western tea, and I found it a different kind of enjoyment from Japanese tea.\"\r\nメイド・笑顔 「先日は目も当てられないお茶を出してしまってごめんなさいね。西洋のお茶をきちんと学んだのは初めてでしたが、日本茶とは違った楽しみがありました」]])\r\n\r\nPLAY_VOICE(\"uran_0213.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Smile \"Please continue teaching me many things. After the Princess Election ends, let’s have another tea party—\"\r\nメイド・笑顔\r\n  「これからも、わたくしにたくさんのことを教えてくださいまし。姫選挙が終わったら、またお茶会を――」]])\r\n\r\nSTOP_BGM(2000)\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04ca\")\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0214.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Surprise \"Ah...\"\r\nメイド・驚き\r\n  「あ……」]])\r\n\r\n  MSG([[Remembering the Princess Election, Uran-san fell silent.\r\n姫選挙のことを思い出したのか、ウランさんが押し黙る。]])\r\n\r\n  MSG([[In less than two hours, it will begin. If Uran-san wins, I’ll be suspended for half a year.\r\nあと二時間もすれば姫選挙が始まる。\r\n  　そこでウランさんが勝った場合、ボクは半年間の謹慎。]])\r\n\r\n  MSG([[Naturally, I wouldn’t be able to join any tea parties then.\r\n当然、お茶会に参加なんてできなくなるんだ。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ea\")\r\nPLAY_VOICE(\"erika_0809.wav\")\r\n  MSG([[\r\n【Erika】\r\nSmile \"...No matter the outcome, our friendship remains unchanged. Let’s share tea again.\"\r\n笑顔\r\n  「……どのような結果に終わろうとも、私たちが友人であることに変わりはありません。またお茶をご一緒させてくださいね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04da\")\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0215.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Sadness \"Yes... Of course. I’ll study more tea before the ‘next time’ to please you, Erika-san.\"\r\nメイド・悲しみ\r\n  「ええ……もちろん、ですわ。エリカさんに喜んでいただけるよう、“次”までにもっと多くの紅茶を学んでおきますね」]])\r\n\r\n  MSG([[For a while, Uran-san and I sat facing each other, silent.\r\nそれからしばらくの間、ボクとウランさんは向かい合ったまま何も話さなかった。]])\r\n\r\n  MSG([[Uran-san’s milk tea really is delicious. The harmony of milk and tea leaves is perfect.\r\nウランさんのミルクティーは、やっぱり美味しい。\r\n  　ミルクと茶葉の合わさった味が見事に調和している。]])\r\n\r\n  MSG([[Could the conservatives and us boys also blend together like this milk tea?\r\n保守派とボクたち男子部も、このミルクティーみたいに合わさることができるだろうか。]])\r\n\r\n  MSG([[No, I will make it happen. If two distinct flavors can merge well, they can bring out an even better flavor.\r\nいや、ボクの手で合わせてみせる。\r\n  　二つの異なる味同士を上手く溶け合わせられたなら、もっと素敵な味わいを引き出すことができるのだから。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ea\")\r\nPLAY_VOICE(\"erika_0810.wav\")\r\n  MSG([[\r\n【Erika】\r\nSmile \"Thank you for the milk tea. Uran-san, see you later.\"\r\n笑顔\r\n  「ミルクティー、ごちそうさまでした。それではウランさん、またあとで」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  LAYER_LOAD(50,\"BU_RYU04aa\")\r\n  SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0216.wav\")\r\n  MSG([[\r\n【Uran】\r\nMaid - Normal \"Yes. Until we meet again.\"\r\nメイド・通常\r\n  「ええ。また……あとでお会いしましょう」]])\r\n\r\n  LAYER_LOAD(50,\"\")\r\n  LAYER_LOAD(LAYER_BG,\"BG000aa\",false)\r\n  SWITCH_SCREEN(\"mask000\",1000,false)\r\n\r\n  --//BG：1F廊下\r\n  LAYER_LOAD(LAYER_BG, \"BG013aa\")\r\n  SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n  MSG([[Parting from Uran-san, I proceeded to the classroom where my ‘knights’ were waiting.\r\nウランさんと別れて、ボクは自分の『騎士』たちが待つ教室へと進み出す。]])\r\n\r\n  MSG([[As I walked, I recalled the sad expression Uran-san wore thinking about the Princess Election with me.\r\n歩きながらも思い出されるのは、ボクとの姫選挙を思い出して、悲しげな表情を浮かべたウランさんの顔。]])\r\n\r\n  MSG([[If I lose in the next Princess Election, I won’t just fail to save Marika Onee-san.\r\n次の姫選挙で負けたら、マリカ姉さんを救うことができなくなるだけじゃない。]])\r\n\r\n  MSG([[I would also burden Uran-san with the heavy guilt of having driven a friend into suspension.\r\nウランさんに、友人を謹慎に追い込んだという重たい罪を背わせてしまうことになるんだ。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ba\")\r\nPLAY_VOICE(\"erika_0811.wav\")\r\n  MSG([[\r\n【Erika】\r\nSerious \"For Uran-san’s sake... I can’t lose.\"\r\n真剣\r\n  「ウランさんのためにも……負けられない」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[For the friend who cares for “Erika Ikusa” more than I do, I once again vowed to win.\r\n“伊草エリカ”をボク以上に大切に想ってくれている友人のためにも、ボクは改めて勝利を誓うのであった。]])\r\n  --　　　　◆\r\n\r\n  LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n  SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n  WAIT_INPUT(1000)\r\n\r\n  ScenarioManager.Next(\"EP03_29\")\r\nend\r\n"
}