{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP03_31",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP03/EP03_31.lua",
  "Text": "function EP03_31()\r\n    --.結-6【9月第4週】「美女と野獣」\r\n    SaveData.Title = \"美女と野獣\"\r\n\r\n    --//BG：大講堂正面（スポットライト無し）\r\n    LAYER_LOAD(LAYER_BG, \"BG020ba\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    MSG([[I visited the great auditorium during Erika Ikusa and her group's performance time.\r\nわたくしは、エリカさんたちの出し物の時間に大講堂を訪れました。]])\r\n\r\n    MSG([[As Erika Ikusa had said, on the front-row seat lay a handwritten paper with \"Uran Ryuguuin\" and my name written on it.\r\nエリカさんのおっしゃっていた通り、最前列の座席の上に、「龍宮院ウランさん」と手書きでわたくしの名前の書かれた紙が置かれていました。]])\r\n\r\n    MSG([[I pocketed the paper, presumably written by Erika Ikusa herself, and took my seat.\r\n恐らくエリカさんの手書きであろうその紙を懐にしまい、着席します。]])\r\n\r\n    MSG([[If I recall correctly, Erika Ikusa’s class was performing a play based on the Western fairy tale \"Beauty and the Beast.\"\r\n確か、エリカさんのクラスは西洋の童話『美女と野獣』を元にした演劇であったはず。]])\r\n\r\n    MSG([[Although it’s a story I’ve loved since childhood and I was looking forward to it, the image of the man playing the Beast crossed my mind, making me feel uneasy.\r\n子どもの頃から大好きな物語なので楽しみな反面、野獣役を演じる殿方の姿が頭によぎって、気分が悪くなりました。]])\r\n\r\n    MSG([[I understand Erika Ikusa’s intent.\r\nエリカさんの狙いはわかります。]])\r\n\r\n    MSG([[\"Beauty and the Beast\" is a love story in which a kind-hearted, brave woman named Belle connects with a Beast who was turned into a hideous form due to his weak heart.\r\n『美女と野獣』は、心の弱さが原因で醜い野獣の姿に変えられてしまった醜い野獣と、気丈な美しい女性ベルが心を通わせる恋物語。]])\r\n\r\n    MSG([[The Beast, who reforms and learns to respect others, ultimately finds true love.\r\n改心して他者を尊ぶようになり、真の愛を手に入れる野獣の姿。]])\r\n\r\n    MSG([[Through Belle, who initially shunned the Beast but gradually deepened her love as she understood his inner self, Erika Ikusa aims to seek understanding for coeducation.\r\n最初は野獣を遠ざけいていたものの、その内面を知って徐々に愛を深めていくベルの姿を通して、共学への理解を求めようというのでしょう。]])\r\n\r\n    MSG([[However, such a sermon won’t shake the hearts of the conservatives.\r\nですが、そのような説教では、保守派の心は揺れ動きません。]])\r\n\r\n    MSG([[No matter that Erika Ikusa won the Princess Election, they won’t change their ideology.\r\nいくら姫選挙でエリカさんが勝利したとは言っても、思想までは変えられないのです。]])\r\n\r\n    MSG([[Once this play ends, Erika Ikusa and I will be enemies again. But, for this moment alone, I want to purely enjoy the stage she has created.\r\nこの演劇が終われば、またエリカさんとは敵同士。\r\n    　ですが、今この瞬間だけは、純粋に彼女の作り上げた舞台を楽しみたいと思います。]])\r\n\r\n    MSG([[Surely Erika Ikusa has no ulterior motive; she must have invited me to this performance simply to entertain me.\r\nエリカさんはきっと他意などなく、わたくしを楽しませるために、この出し物に招待してくれたに違いないのですから。]])\r\n\r\nPLAY_VOICE(\"erika_0901.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Everyone, thank you very much for waiting. We will now begin the stage presentation of 1-A and the boys’ division joint performance of the play ‘Beauty and the Beast.’\"\r\n「皆さん、大変長らくお待たせしました。これより、１年Ａ組と男子部合同によるステージ発表、演劇『美女と野獣』を開始いたします」]])\r\n\r\n    --//BG：大講堂正面\r\n    LAYER_LOAD(LAYER_BG, \"BG020aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 300,true)\r\n\r\n    MSG([[As Erika Ikusa finished her announcement, the lights on the stage illuminated.\r\nエリカさんによる案内が終わると同時に、舞台上の照明に明かりが灯りました。]])\r\n\r\n    MSG([[Then, a surprising casting choice appearing in the center of the stage caused murmurs of astonishment throughout the venue.\r\nそして舞台中央に現れた人物の意外な配役に、会場中から驚きの声があがったのです。]])\r\n\r\n    STOP_BGM(1000)\r\n\r\n    --//CG：美女と野獣（オウガのみ）\r\n    LAYER_LOAD(LAYER_BG, \"EV019aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    PLAY_BGM(\"BGM06.wav\")\r\n\r\nPLAY_VOICE(\"erika_0902.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"My beloved daughters, as I said before, I am going to the town. Is there anything you want?\"\r\n「愛する我が娘たちよ。以前に話した通り、父は街へ行ってくるぞ。何か欲しいモノはないかい？」]])\r\n\r\nPLAY_VOICE(\"erika_0903.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Come now, dear Belle. Tell me your wish, just as your elder sisters have.\"\r\n「さぁ、愛しいベル。他の姉たちのようにオマエの願いも聞かせておくれ」]])\r\n\r\nPLAY_VOICE(\"erika_0904.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"I want to give you a small gift to repay your usual devotion.\"\r\n「普段尽くしてくれているオマエのために、ささやかなお返しをしたいのだ」]])\r\n\r\nPLAY_VOICE(\"ogre_0241.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Well then, Father, may I request a single rose?\"\r\n「そうですね。それでは、バラを一輪お願いできますでしょうか、お父さま」]])\r\n\r\nPLAY_VOICE(\"ogre_0242.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"There isn’t a single rose bush around here, so I have longed for one. If it is placed on the dining table, it will surely add beautiful color to our meals starting tomorrow.\"\r\n「この辺りにはバラの木が一本もありませんので、ずうっと欲しかったのです。食卓に飾れば、きっと明日からの食事に、よい色どりを加えてくれることでしょう」]])\r\n\r\nPLAY_VOICE(\"erika_0905.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Ah, what a humble wish. Leave it to me. I shall bring back not just one but an armful of roses.\"\r\n「ああ。なんと慎ましい願いなのだ。まかせておくれ。一輪どころか、この腕いっぱいのバラを持ち帰るとも」]])\r\n\r\n    MSG([[Saying so, Erika Ikusa, disguised as a middle-aged man, disappeared backstage.\r\nそう言って、壮年の男性に扮したエリカさんが舞台裏へと消えました。]])\r\n\r\n    MSG([[Belle, left behind, continued modestly wiping and sweeping while enduring sarcastic remarks from her sisters.\r\n残されたベルは、姉たちから嫌味を言われながらも、慎ましやかに雑巾がけや掃き掃除を続けます。]])\r\n\r\n    MSG([[Her appearance was a commoner’s Western-style dress, with some stains and patches visible here and there.\r\nそのベルの容姿は、ところどころにシミや縫い直しのあとが見える、庶民的な洋装。]])\r\n\r\n    MSG([[Yet, with long hair reaching her waist, healthy and glossy skin, and long eyelashes, she clearly appeared more graceful compared to her sisters.\r\nただ、腰まで伸びた長髪に健康的で艶やかな肌、長い睫毛が合わさって、姉たちと比べて妙妙たる女性であることは容易に見て取れます。]])\r\n\r\n    MSG([[Her looks perfectly matched the image of Belle I had imagined from the story I had read in the past.\r\nその姿は、過去に物語を読んで想像したベルの容姿に、ぴたりと重なりました。]])\r\n\r\nPLAY_VOICE(\"uran_0257.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"T-The one playing Belle is... no way, Ouga Rokujou!? That arrogant guy is cross-dressing and even changing his voice...!?\"\r\n（べ、ベル役を演じているのは……まさか、六条オウガ！？　あの高慢ちきな男が、女装をして、声まで変えているというのですか…！？）]])\r\n\r\n    MSG([[It seems I was not the only one to notice, as the audience gradually began to stir.\r\nわたくし以外にも気付いた方は少なくないようで、観客席が徐々にどよめき始めます。]])\r\n\r\n    MSG([[As the story progressed and the Beast made an appearance, the audience’s confusion deepened.\r\nそして物語が進み、野獣が出てきたところで、観客たちの戸惑いは更に色濃くなるのです。]])\r\n\r\n    --//CG：美女と野獣（野獣ヒユのみ）\r\n    LAYER_LOAD(LAYER_BG, \"EV019ab\")\r\n    SWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\nPLAY_VOICE(\"hiyu_0262.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n \"Hey, you! Not only do you stay at my mansion without permission, but you also try to steal the rose—which is more precious than my life—what an ungrateful wretch!\"\r\n「おいキサマ！　オレ様の屋敷に無断で寝泊まりをするどころか、命よりも大切なバラを盗もうとするとは、何という恩知らずだ！」]])\r\n\r\nPLAY_VOICE(\"erika_0906.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Eek! A m-monster...!? P-please save me, please spare my life!\"\r\n「ひいぃ！　ば、化け物……！？　お、お助けください、命だけはお助けください！」]])\r\n\r\nPLAY_VOICE(\"hiyu_0263.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n \"No way, I won’t forgive you. If you want my forgiveness, you must send me the one daughter you love the most within three months.\"\r\n「いいや、勘弁ならぬ。どうしても許して欲しいのであれば、キサマが最も愛する娘を一人、三ヶ月のうちによこすのだ」]])\r\n\r\nPLAY_VOICE(\"hiyu_0264.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n \"I was once called ‘the heartless one’ and turned into this Beast’s form.\"\r\n「オレ様はかつて『無情の者』と罵られ、この野獣の姿に変えられた」]])\r\n\r\nPLAY_VOICE(\"hiyu_0265.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n \"I was told that if I reconsider my heart, I could return to my original form. But no one here in this mansion watches over my heart.\"\r\n「心を入れ替えれば元の姿に戻すと言われた。だがこの屋敷には、オレ様の心を見つめる者などいない」]])\r\n\r\nPLAY_VOICE(\"hiyu_0266.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n \"I need a wife who looks into my heart. I will never harm her. I swear to keep my promise to the very end and will not take your life either.\"\r\n「オレ様には、我が心を見つめてくれる妻が必要なのだ。決して悪いようにはせん。キサマの命もとらぬ。約束は最後まで守り抜くと誓おう」]])\r\n\r\nPLAY_VOICE(\"hiyu_0267.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n \"So you must keep your promise to me as well. Understood? Within three months, no exceptions.\"\r\n「だからキサマも、オレ様との約束を守るのだ。いいな？　三ヶ月以内に、必ずだぞ？」]])\r\n\r\n    MSG([[The shaggy beast pressing Erika Ikusa was none other than Hiyu Shinosaki. The face peeking out from the furry costume—unbelievably—was Hiyu.\r\nエリカさんに詰め寄る、毛むくじゃらの醜い野獣。 毛皮だらけの衣装から覗かせるその顔は――なんとヒユさんでした。]])\r\n\r\n    MSG([[The very misogynistic Hiyu playing the role of the Beast, no less.\r\nあの男性嫌いのヒユさんが、まさか野獣役だなんて。]])\r\n\r\n    MSG([[Yet, his exaggerated gestures and running around the stage on all fours with beast-like movements carried a power that erased the fact that a girl was playing a man.\r\nただ大仰な身振り手振りに、獣みたいに四足歩行で舞台中を駆け巡るその演技は、女性が演じていることを感じさせない迫力があります。]])\r\n\r\n    MSG([[Despite the odd casting of boys playing females and girls playing males, not a single discord arose.\r\n男子生徒が女性を。\r\n    　女子生徒が男性を演じるという、奇妙な配役だというのに、全然不和が生まれていないのです。]])\r\n\r\n    MSG([[Initially, the audience was clearly confused, but soon everyone was absorbed, watching the characters on stage intently and following their story.\r\n最初は困惑の色が濃厚だった観客席も、気付けば観客たちがみんな、食い入るように舞台上の登場人物たちを見つめ、その動向を見守っていました。]])\r\n\r\n    MSG([[Such a stage could only have been realized by Erika Ikusa.\r\nこのような舞台は、エリカさん以外には決して実現し得なかったことでしょう。]])\r\n\r\nPLAY_VOICE(\"uran_0258.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"No... it’s not only Erika Ikusa.\"\r\n「いえ……エリカさん、だけではありませんね」]])\r\n\r\n    MSG([[Yes. It is not only Erika Ikusa who is wonderful.\r\nそう。\r\n    　素晴らしいのはエリカさんだけではありません。]])\r\n\r\n    MSG([[To make this stage come to life, everyone involved must connect their hearts.\r\nこの舞台を実現するには、関わる皆さん全員が心を通わせる必要があるのですから。]])\r\n\r\n    MSG([[I had heard from Yuri that there were conservative students even in Erika Ikusa’s class.\r\nエリカさんのクラスにも、保守派の生徒がいたことは、友梨さんから伺っていました。]])\r\n\r\n    MSG([[Collaborating with the boys’ division to weave a single story must have involved unimaginable struggles.\r\n男子部も交えてひとつの物語を紡ぐなど、想像も絶する苦悩が伴ったはず。]])\r\n\r\n    MSG([[Perhaps this gender-reversed play was born incidentally amid those struggles.\r\nもしかしたら、この男女逆転の演劇も、その苦悩の中で偶発的に生まれたものなのかもしれません。]])\r\n\r\n    MSG([[This play evokes various imaginations about its background. But at this moment, not a single performer on stage looks troubled.\r\n様々な経緯を想像させる演劇。\r\n    　ただ、今この瞬間には、舞台上で演技を曇らせる方は一人もいません。]])\r\n\r\n    MSG([[I feel all their hearts have become one.\r\n全員の心が、ひとつになっているのを感じます。]])\r\n\r\n    --//CG：美女と野獣（オウガ・野獣ヒユ）\r\n    LAYER_LOAD(LAYER_BG, \"EV019ac\")\r\n    SWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\nPLAY_VOICE(\"hiyu_0268.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n \"Belle! Why do you hate me!? I gave you magnificent dresses! Rich meals, beautiful roses, rooms filled with books!\"\r\n「ベル！　何故オレ様を嫌うのだ！　オレ様はキサマに豪奢なドレスを与えてやった！　豊かな食事を、美しいバラを、書物で満ちた部屋を与えてやった！」]])\r\n\r\nPLAY_VOICE(\"hiyu_0269.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n \"I fulfilled all your wishes! I served you! What more do you want!? How can you love me!?\"\r\n「キサマの望みはすべて叶えたではないか！　キサマに尽くしたではないか！　これ以上、何を望むと言うのだ！？　どうすればオレ様を愛してくれるのだ！？」]])\r\n\r\nPLAY_VOICE(\"ogre_0243.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"I have never once told you my wishes. You only spoke of wanting me to look at you, but never once have you looked into my heart.\"\r\n「私は一度たりとも、アナタに望みを伝えた覚えはありませんわ。アナタは自分を見て欲しいと語るばかりで、私の心を一度だって見てくれたことはありません」]])\r\n\r\nPLAY_VOICE(\"ogre_0244.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Love is like a flower. You think that by giving water and fertilizer, the flower will grow—but that’s wrong.\"\r\n「愛は花と同じです。アナタは水と肥料を与えれば、花が育つと思っているのでしょうが、それは違います」]])\r\n\r\nPLAY_VOICE(\"ogre_0245.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"To nurture a flower, you need to touch the soil, look up at the sky, feel the air on your skin, and stay close beside the closed bud.\"\r\n「花を育むには、土に触れ、空を見上げ、空気を肌に感じ、閉じた蕾のそばで寄り添う必要があるのです」]])\r\n\r\nPLAY_VOICE(\"ogre_0246.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"<r=はなびら>Only looking at the petals</r>, the way you do now, you can never nurture love.\"\r\n「<r=はなびら>花弁</r>しか見つめていない今のアナタには、愛など育めるはずがありません」]])\r\n\r\nPLAY_VOICE(\"hiyu_0270.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n \"Belle!! You! Youuuu!\"\r\n「ベルッッ！！　キサマ！　キサマァーーーー！」]])\r\n\r\n    MSG([[The Beast’s roar echoed through the hall. That heart-wrenching misunderstanding made my chest feel as if it would be torn apart.\r\n会場内に轟く野獣の雄たけび。\r\n    　その切ない擦れ違いに、思わず胸が引き裂かれそうになります。]])\r\n\r\n    MSG([[When I was defeated in the recent Princess Election, I experienced the same feelings as the Beast now.\r\n先ほどの姫選挙で敗北した時、わたくしは今の野獣と同じ想いを味わったからです。]])\r\n\r\n    MSG([[As a representative of the conservatives, I poured my heart out preaching the importance of \"unchanging values.\" I believed everyone would understand.\r\nわたくしは保守派の代表として、心を尽くして「変わらぬ大切さ」を説きました。きっと皆さんもわかってくれると信じていました。]])\r\n\r\n    MSG([[But... the result was defeat. My feelings did not reach them.\r\nですが……結果は敗北。\r\n    　わたくしの想いは届きませんでした。]])\r\n\r\n    MSG([[The moment the election results came out, I felt a blazing hatred towards the coeducation faction flare deep in my chest.\r\n選挙の結果が出た瞬間、胸の奥で、共学派への憎しみの焔が燦燦と燃え上がるのを感じました。]])\r\n\r\n    MSG([[I thought myself narrow-minded, but that defeat was unbearably painful.\r\n我ながら狭量に思いますが、それでもあの敗北は、あまりに耐えがたかったのです。]])\r\n\r\n    MSG([[But soon after, that flame began to calm.\r\nですが、その焔は間もなく鎮まることとなりました。]])\r\n\r\n    --//effect：セピア調\r\nFILTER_SCREEN(2)\r\n\r\n    --//BG：校舎前（昼）\r\n    LAYER_LOAD(LAYER_BG, \"BG011aa\")\r\n    --//BU：エリカ（笑顔）\r\n    LAYER_LOAD(50,\"BUL_ERI01ea\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000)\r\n\r\n    MSG([[Without a single grudge or boastful victory proclamation, Erika Ikusa invited me to her play.\r\n恨み言のひとつも、勝利宣言もひとつせず、わたくしを自分の演劇に誘ってくださったエリカさん。]])\r\n\r\n    MSG([[Standing before her innocent smile, I realized why I was defeated.\r\nその無垢な笑顔を前にして、わたくしは自分の敗北理由を悟ったのです。]])\r\n\r\n    MSG([[Her \"dance\" and mine were opposites.\r\n彼女とわたくしの『舞』は真逆。]])\r\n\r\n    MSG([[While I denied coeducation and tried to assert the correctness of my values, she accepted the conservatives' existence and conveyed the appeal of coeducation.\r\n共学を否定し、自分の価値観の正当性を訴えようとしていたわたくしに対して、彼女は保守派の存在も受け入れた上で、共学の魅力を伝えていました。]])\r\n\r\n    MSG([[Perhaps her imitating Hermes Himegami’s dance first was meant to express the unchanging status quo.\r\nまずエルメスさんの舞踊を真似てみせたのも、変わらない現状を表現する意図があったのでしょう。]])\r\n\r\nFILTER_SCREEN(0)\r\n    --//CG：美女と野獣（野獣ヒユ）\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(LAYER_BG, \"EV019ab\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_VOICE(\"hiyu_0271.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n \"Ah, my beloved Belle. Come back to me. Losing you, sinking again into the sea of loneliness, I finally understood.\"\r\n「ああ、愛しのベル。帰ってきておくれ。キミを失い、再び孤独の海に沈み、ようやく理解ができた」]])\r\n\r\n    MSG([[The scene shifted to the story’s climax.\r\n場面は移り、物語の終盤。]])\r\n\r\n    MSG([[The Beast, learning that Belle's father collapsed from the worry of losing his daughter, gave Belle medicine and allowed her to return to her hometown.\r\nベルと擦れ違う中、彼女の父が娘を失った心労で倒れたことを知った野獣は、ベルに良薬を手渡し、故郷の街へと帰ることを許可しました。]])\r\n\r\n    MSG([[Though he said \"You need not return,\" the Beast’s heart still could not abandon his love for Belle and he lamented bitterly.\r\nベルに「もう戻ってこなくともよい」と言ってしまったものの、本心ではベルへの愛を捨てきれず、慟哭する野獣。]])\r\n\r\n    MSG([[His awkward stance was deeply moving.\r\nその不器用な姿には、心を揺さぶられずにはいられません。]])\r\n\r\nPLAY_VOICE(\"hiyu_0272.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n \"You spoke many words to me out of love.\"\r\n「キミは、オレへの愛が故に、数々の言葉を語りかけてくれていたのだな」]])\r\n\r\nPLAY_VOICE(\"hiyu_0273.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n \"Love isn’t just about giving. It’s about taking hands, looking into each other’s eyes, and cherishing each other.\"\r\n「愛とは、ただ尽くすばかりではない。愛する者と手を取り合い、見つめ合い、慈しみ合うモノなのだから」]])\r\n\r\nPLAY_VOICE(\"hiyu_0274.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n \"Until the day you forgive me and show me your beautiful form again, I pledge on this rose to love you forever, eternally.\"\r\n「キミがオレを許し、再びその麗しい姿を見せくれるその日まで。永久に。永劫に。キミを愛し続けることを、このバラに誓おう」]])\r\n\r\n    MSG([[Like the Beast demanding love, I saw only the choice of maintaining the status quo.\r\n愛を求めるばかりの野獣のごとく、現状を維持する選択肢しか見えていなかったわたくし。]])\r\n\r\n    MSG([[Erika Ikusa, viewing Yuriai Private Academy as a whole, affirmed the conservatives’ thoughts and worked hard to convey her own ideas.\r\n百合愛学園全体を見据え、保守派の考えも肯定した上で、自分の考えを伝えようと励んでいたエリカさん。]])\r\n\r\n    MSG([[It’s obvious which side the students found more appealing.\r\n生徒の皆さんがどちらに魅力を感じるかは、考えるまでもありません。]])\r\n\r\n    MSG([[And the story finally reaches its conclusion—\r\nそして物語は、遂に終幕を迎えます――]])\r\n\r\nPLAY_VOICE(\"ogre_0247.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Ah, I apologize, my beloved Beast, Beato. Thanks to your medicine, my father was saved.\"\r\n「ああ、ごめんなさい。愛する我が獣、ベート。アナタの薬のおかげで父は救われました」]])\r\n\r\n    MSG([[In the dusty castle, Belle embraced the Beast’s body, now thin and losing fur.\r\n埃にまみれた城の中、体毛が抜け落ち、痩せ衰えた野獣の身体を、ベルが抱き寄せました。]])\r\n\r\nPLAY_VOICE(\"ogre_0248.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Yet, I left you alone, trapped in this cold mansion by yourself.\"\r\n「それなのに、私はアナタを一人にしてしまいました。この冷たい屋敷に一人、取り残してしまいました」]])\r\n\r\nPLAY_VOICE(\"ogre_0249.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Why did you not tell me that you would die if you remained in the Beast’s form? Had you told me, I would have given you all my little love.\"\r\n「何故、野獣の姿のままでいれば死にゆくことを、教えてくださらなかったのですか？　教えてくだされば、私の小さな愛など、いくらでも捧げましたのに」]])\r\n\r\nPLAY_VOICE(\"hiyu_0275.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n \"You taught me that it’s not enough just to make the flower bloom.\"\r\n「キミが、教えてくれたのだ。ただ、花を咲かせればよいのではないと」]])\r\n\r\n    MSG([[The Beast’s large hand gently wiped the tears streaming down Belle’s cheek.\r\n野獣の大きな手が、ベルの頬を伝う涙を、そっと優しく拭いました。]])\r\n\r\nPLAY_VOICE(\"hiyu_0276.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n \"I always imposed only my wishes, but at the end, I granted one wish of my beloved.\"\r\n「ずうっとずうっと、自分の望みばかりを押しつけていたオレが、最期にひとつ、愛するキミの願いを叶えられたのだ」]])\r\n\r\nPLAY_VOICE(\"hiyu_0277.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n \"Now, smile for me. Smile, Belle. If I am seen off by your lovely smile, death is nothing to fear.\"\r\n「さぁ、笑っておくれ。笑っておくれ、ベル。キミのその可憐な笑顔に看取られるのであれば、死も怖くはないさ」]])\r\n\r\nPLAY_VOICE(\"ogre_0250.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"No. You must not die.\"\r\n「いいえ。死んではなりません」]])\r\n\r\nPLAY_VOICE(\"ogre_0251.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"You must live forever as my husband. Please accept this love.\"\r\n「アナタは私の夫として、いつまでも生きなければならないのですから。さぁ、この愛を受け取ってくださいまし」]])\r\n\r\n    MSG([[Belle touched the Beast’s hand and softly kissed the back of it.\r\n野獣の手にベルが触れ、その手の甲にそっと口づけをしました。]])\r\n\r\n    MSG([[At that moment—\r\nすると同時に――]])\r\n    --//CG：美女と野獣（スモーク）\r\n    LAYER_LOAD(LAYER_BG, \"EV019ad\")\r\n    SWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\n    MSG([[The stage was enveloped in pure white smoke.\r\n舞台が真っ白な煙に包まれました。]])\r\n\r\n    MSG([[The ending that followed was classic. Surely, Hiyu Shinosaki returned to his original prince form and was united with Ouga Rokujou.\r\nこの後の結末はまさしく王道。\r\n    　きっと、元の王子さまの姿に戻ったヒユさんが、オウガさんと結ばれて終わるのでしょう。]])\r\n\r\n    MSG([[As I eagerly awaited what costume Hiyu would change into, a figure gradually stepped forward out of the fading smoke.\r\nヒユさんがどのような衣装に着替えるのか楽しみにしていると――徐々に薄れていく煙の中から、人影が舞台の前へと歩み出てきました。]])\r\n\r\nPLAY_VOICE(\"uran_0259.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Eh—\"\r\n「えっ――」]])\r\n\r\n    MSG([[I lost my words the moment I realized the identity of that figure. Because—\r\nその人影の正体に気付いた途端、言葉を失いました。\r\n    　何故ならば――]])\r\n\r\n    --//CG：美女と野獣（煙の中から男装エリカ）\r\n    LAYER_LOAD(LAYER_BG, \"EV019ae\")\r\n    SWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\nPLAY_VOICE(\"erika_0907.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"My beloved Belle, thank you for loving me despite everything.\"\r\n「愛しのベル。こんな私を、愛してくれてありがとう」]])\r\n\r\n    MSG([[Erika Ikusa, dressed in a lavish prince’s costume, was extending her hand to me.\r\n豪華絢爛な王子さまの衣装を身にまとったエリカさんが、私に手を差し出してくれていたのですから。]])\r\n\r\nPLAY_VOICE(\"uran_0260.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"E-Erika Ikusa...? H-How...\"\r\n「え、エリカさん……！？　どう、して……」]])\r\n\r\nPLAY_VOICE(\"erika_0908.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Thanks to you. With the power of your love, the witch’s spell was broken, and I was able to return to my original form.\"\r\n「キミのおかげさ。キミの愛のチカラで、魔女の魔法が解けて、元の姿に戻ることができたんだよ」]])\r\n\r\nPLAY_VOICE(\"erika_0909.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"I want to repay this favor with a lifetime’s worth of love. Will you accept my love?\"\r\n「私はこの恩を、一生分の愛で返したい。私の愛をキミは受け入れてくれるかい？」]])\r\n\r\nPLAY_VOICE(\"erika_0910.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"If you accept it, take my hand and dance the waltz of love with me.\"\r\n「受け入れてくれるのなら、私のこの手を取り、愛のワルツを踊ってくれ」]])\r\n\r\n    MSG([[Unable to grasp the sudden situation, I was stunned.\r\n突然の事態を呑み込めず、わたくしは放心していました。]])\r\n\r\n    MSG([[But my hand naturally overlapped with Erika Ikusa’s, and led by her, I ascended the stage.\r\nですが、手は自然とエリカさんの手に重なって、彼女に手を引かれるまま、ステージへと登っていきます。]])\r\n\r\n    --//SE：黄色い悲鳴\r\n--PLAY_SE(\"SEf008.wav\")\r\n\r\n    --//CG：美女と野獣（煙が晴れて、背景に全員集合）\r\n    LAYER_LOAD(LAYER_BG, \"EV019af\")\r\n    SWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\n    MSG([[Cheers sounded in the distance. All of Erika Ikusa’s \"Knights\" and the boys’ division gathered on stage. Then, the pair dance began.\r\n遠くで聞こえる歓声。舞台上に勢ぞろいした、エリカさんの『騎士』の皆さんと、男子部の一同。そして始まる、二人一組での舞踏。]])\r\n\r\n    MSG([[With uncertain steps, I moved my arms and legs, trying to imitate Erika Ikusa. However, the movements were completely different from Japanese dance, and I couldn’t keep up.\r\nわたくしも覚束ない足取りで、エリカさんを真似して手足を動かします。ですが、日舞とはまったく異なる動きに全然動きが追いつきません。]])\r\n\r\n    MSG([[Erika Ikusa gently guided me by pulling my hands and feet as if leading me.\r\nエリカさんはそんなわたくしを導くように、手を、足を、優しく引いてくれました。]])\r\n\r\n    MSG([[That kindness touched my heart. The passion I had felt moments ago over the Princess Election results suddenly seemed pitiful.\r\nその優しさが胸に沁みて、先ほどまで、姫選挙の結果への激情を抱いていた自分が、ヒドく哀れに想われました。]])\r\n\r\n    MSG([[Unaware of my resentment, Erika Ikusa whispered softly.\r\nわたくしの劣情も知らずに、エリカさんはそっと耳打ちをしました。]])\r\n\r\nPLAY_VOICE(\"erika_0911.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"If not for the election against Uran Ryuguuin, I would never have understood the struggles of the conservatives and might have lived my school life so carefree.\"\r\n「ウランさんとの姫選挙がなければ、きっと私は保守派の皆さんの苦悩を知らずに、ずっとのんきに学園生活を過ごしていたと思います」]])\r\n\r\nPLAY_VOICE(\"erika_0912.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"It’s thanks to competing with Uran Ryuguuin that we can all stand on stage laughing together like this now.\"\r\n「今こうして、みんなで笑って舞台に立つことができているのは、ウランさんと競い合えたおかげです」]])\r\n\r\nPLAY_VOICE(\"erika_0913.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"That’s why... I really wanted Uran Ryuguuin to see this stage.\"\r\n「だから……どうしてもウランさんにこの舞台を観て欲しかったんです」]])\r\n\r\nPLAY_VOICE(\"erika_0914.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"I’m sorry for such a selfish wish.\"\r\n「身勝手な願いで……ごめんなさい」]])\r\n\r\n    MSG([[I almost sighed in disbelief.\r\nつい呆れて溜め息が出そうになりました。]])\r\n\r\n    MSG([[So kind as always. Since Erika Ikusa defeated me, it would be natural and her right to prove her justification to the loser.\r\nどこまでも、お優しいヒト。\r\n    　エリカさんはわたくしに勝ったのですから、当然の権利として、敗者に自らの正当性を見せつければいいというのに。]])\r\n\r\n    MSG([[Even though I feel as if I might be consumed by the flames of jealousy at any moment.\r\nわたくしは今にも、嫉妬の焔に身を焦がしそうであるというのに。]])\r\n\r\n    MSG([[To cool the hot feelings inside me, tears began to trickle from my eyes.\r\n胸のうちの熱い感情を冷ますように、わたくしの目からポツポツと涙が零れ始めました。]])\r\n\r\nPLAY_VOICE(\"erika_0915.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Uran, san...?\"\r\n「ウラン、さん……？」]])\r\n\r\nPLAY_VOICE(\"uran_0261.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Erika Ikusa... may I trust you? After trampling on your feelings, do I still have the right to love you again?\"\r\n「エリカさん……アナタを、信じてもよろしいですか？　アナタの想いを踏みにじったわたくしに、もう一度、アナタを愛する権利はありますか？」]])\r\n\r\n    MSG([[Erika Ikusa gently hid my profile with her cloak, moving so the audience could not see my tearful face.\r\n自然な所作でわたくしの横顔を外套でそっと隠し、観客席から泣き顔を見えないよう立ち回るエリカさん。]])\r\n\r\n    MSG([[Then, at an angle visible only to me, she smiled softly.\r\nそしてわたくしにだけ見える角度で、そっと微笑みかけてくれた。]])\r\n\r\nPLAY_VOICE(\"erika_0916.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Of course, my beloved Belle. No matter what hardships or misunderstandings arise, our love is eternal.\"\r\n「もちろんだよ、愛しのベル。どのような困難があろうとも、擦れ違いが起きようとも、私たちの愛は永遠だ」]])\r\n\r\nPLAY_VOICE(\"erika_0917.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"So, smile for me. Just for now, I want to monopolize your delicate smile.\"\r\n「だから、さぁ微笑んでおくれ。今だけはその可憐な笑顔を、私にだけ独占させて欲しいんだ」]])\r\n\r\n    MSG([[I couldn’t help but laugh at Erika Ikusa’s theatrical and cheesy line.\r\n演技かかったエリカさんのキザなセリフに、思わず吹き出してしまいました。]])\r\n\r\nPLAY_VOICE(\"uran_0262.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"You’re quite a greedy Beast, aren’t you? Fine, it’s no problem. I will give you all of my face and love.\"\r\n「意外と欲張りな野獣さんなのですね。ええ、かまいませんわ。この顔も、愛も、アナタにすべて捧げましょう」]])\r\n\r\nPLAY_VOICE(\"uran_0263.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Not just for now, but forever, always...\"\r\n（今だけと言わず、永久に、ずうっと……）]])\r\n\r\n    MSG([[I kept dancing with Erika Ikusa until the music ended.\r\nそのまま楽曲が終わるまで、わたくしはエリカさんたち共に踊り続けました。]])\r\n    --//BGM：フェードアウト\r\nSTOP_BGM(3000)\r\n\r\n    --//BG：黒バック\r\n    PLAY_SE(\"SEa019.wav\",1000,true)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 2000,false)\r\n\r\n    --//SE：拍手\r\n--PLAY_SE(\"SEf008.wav\",0,true)\r\n\r\n    --//SE：歓声（MAX）\r\nPLAY_SE(\"SEa019.wav\",0,true)\r\n\r\n    MSG([[As the stage lights went out, an applause louder than even the Princess Election announcement resounded.\r\nそして舞台の照明が消えると同時に――姫選挙の結果発表よりも、更に大きな拍手喝采が響き渡ったのです。]])\r\n\r\n    MSG([[I had never heard such magnificent applause before.\r\nこんな盛大な拍手はこれまで聞いたことがありません。]])\r\n\r\n    MSG([[Surely it was a rare event in the over one hundred years of Yuriai Private Academy’s history.\r\nきっと百年以上も続く百合愛学園の歴史の中でも、稀な事態でしょう。]])\r\n\r\n    MSG([[Thus, once again, I painfully realized that I could never compare to Erika Ikusa.\r\nこうしてわたくしは、改めて、自分がエリカさんに到底及ばないことを思い知るのでした。]])\r\n    --　　　　　◆\r\n    STOP_ALL_SOUND(1000)\r\n    --STOP_SE(\"SEa019.wav\",1000)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"EP03_32\")\r\nend\r\n"
}