{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP03_21",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP03/EP03_21.lua",
  "Text": "function EP03_21()\r\n    --.転-3【8月第4週】「姫巫女の涙」\r\n    SaveData.Title = \"姫巫女の涙\"\r\n\r\n    --//SE：ヒグラシの鳴き声　\r\n    -- 　　＊このシーンは常時継続\r\nPLAY_SE(\"SEe004.wav\",1000,true)\r\n\r\n    --//BG：メインストリート（夏・通常）\r\n    LAYER_LOAD(LAYER_BG, \"BG019aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    MSG([[The last day of summer vacation. At last, I was able to convey the improvement plans to everyone who had been absent.\r\n夏休みの最終日。\r\n    　ようやく、欠席していた方全員に改善案を伝えることができた。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI02ea\")\r\nPLAY_VOICE(\"erika_0639.wav\")\r\n    MSG([[\r\n【Erika】\r\nSummer uniform・smile (I'm glad I somehow managed to get Segawa-san to agree. It was worth going all the way to the edge of Prefecture A to meet her.)\r\n夏服・笑顔 （<r=せがわ>瀬川</r>さんに何とか納得していただけてよかった。Ａ県の端っこまで会いに行った甲斐があったよ）]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI02aa\")\r\nPLAY_VOICE(\"erika_0640.wav\")\r\n    MSG([[\r\n【Erika】\r\nSummer uniform・normal (I also got a message from Lira, who went to persuade Ujō-san, saying\r\n夏服・通常\r\n    （<r=うしろ>宇城</r>さんの説得に行っていたリラさんからも「交渉ガチ成功」って連絡が来たし、明日からはやっと全員そろって練習ができるかも）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[For now, I've done what I can. All that's left is to pray that my feelings reach everyone.\r\nひとまずやれることはやった。\r\n    　あとはもう、みんなに想いが伝わることを祈るばかりだ]])\r\n\r\n    MSG([[I hope I can finally sleep soundly tonight after a long time.\r\n今日は久しぶりに、ぐっすりと眠れるといいな。]])\r\n\r\n    --//SE：トゥンク\r\nPLAY_SE(\"SEa003.wav\")\r\nWAIT(300)\r\n\r\n    --//effect：ぼかし加工\r\nFILTER_SCREEN(3)\r\nSWITCH_SCREEN(\"mask000\" , 500,false)\r\nWAIT(500)\r\nFILTER_SCREEN(0)\r\nSWITCH_SCREEN(\"mask000\" , 500,false)\r\n    -- 　＊一瞬だけ\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI02ca\")\r\nPLAY_VOICE(\"erika_0641.wav\")\r\n    MSG([[\r\n【Erika】\r\nSummer uniform・surprised\r\n夏服・驚き\r\n    「あっーー」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I staggered from a sudden dizziness. Maybe it's the result of having been running around without sleep or rest for a week.\r\n急な眩暈でフラついてしまった。\r\n    　この一週間、不眠不休で動き回っていた影響かもしれない。]])\r\n\r\n    MSG([[But everyone else is tired too. I can't be the only one to stop and rest here.\r\nでも疲れているのは他のみんなも同じ。\r\n    　ボクだけが、こんなところで休んではいられない。]])\r\n\r\n    --//effect：ぼかし加工\r\nFILTER_SCREEN(3)\r\nSWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    MSG([[—What is this? _r I can't see clearly. My legs won't obey. I can't put strength in my whole body and find myself unable to stand.\r\n――何、だろう。_r 前がよく見えない。足が言うことを聞かない。 全身にチカラが入らず、立っていられなくなってしまう。]])\r\n\r\n    MSG([[Just like that, I fell forward as if the ground was pulling me down—\r\nそのまま、地面へと吸い込まれるように、前のめりに倒れていっ\r\n    　た――]])\r\n\r\n    LAYER_LOAD(LAYER_BG,\"BG019ae\")\r\n    LAYER_POSITION(LAYER_BG,0,0)\r\n    LAYER_MOVE_POSITION(LAYER_BG,0,540,500,Ease.OutCubic)\r\n    SWITCH_SCREEN(\"mask000\",500,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    --//BU：ウラン（悲しみ）\r\n    --LAYER_LOAD(50,\"BU_RYU01da\")\r\n\r\nPLAY_VOICE(\"uran_0149.wav\")\r\n    MSG([[\r\n【????】\r\nSadness\r\n悲しみ\r\n    「エリカさん、こんなにお顔を真っ青にして……おかわいそうに」]])\r\n\r\n    MSG([[...Soft. And warm.\r\n……柔らかい。それに、温かい。]])\r\n\r\n    MSG([[Someone seems to have caught me. Wrapped in a gentle scent I've smelled somewhere before, my consciousness starts to drift away.\r\n誰かが、ボクの身体を抱きとめてくれたみたいだ。\r\n    　どこかで嗅いだことのある優しい香りに包まれて、ボクの意識はまどろんでいく。]])\r\n\r\n    LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n    SWITCH_SCREEN(\"mask012\",1000,false)\r\n\r\n    MSG([[And then, unable to hold on any longer, my eyelids closed.\r\nそして耐え切れずに、まぶたが閉じていった。]])\r\n\r\n    SWITCH_SCREEN(\"mask000\",0,false)\r\n    LAYER_LOAD(50,\"\")\r\n    WAIT_INPUT(1000)\r\n\r\n    --//SE：一時停止\r\nSTOP_SE(\"SEe004.wav\",500)\r\n\r\n    --//BG：黒バック\r\n\r\n    --//SE：ヒグラシの鳴き声\r\n    --//CG：夕陽がさす木の下、エリカに膝枕をするウラン\r\n    LAYER_LOAD(LAYER_BG, \"EV017ba\")\r\n    LAYER_POSITION(LAYER_BG,-600,380)\r\n    LAYER_MOVE_POSITION(LAYER_BG,200,380,30000,Ease.OutSine)\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\nPLAY_SE(\"SEe004.wav\",30000,true)\r\n\r\n    MSG([[How much time have I been asleep?\r\nどれほどの時間、眠っていただろうか。]])\r\n\r\n    MSG([[My head is enveloped by a soft, feather-like sensation. My hands are warm, like basking in the sun. And there's a gentle, soft scent of tea leaves.\r\n頭が羽毛のような柔らかな感触に包まれている。 それに、手が日向ぼっこしているみたいに温かだ。 そして、ふんわりと優しく香るのは、お茶っ葉の芳香。]])\r\n\r\n    MSG([[There was only one person who came to mind.\r\n思い当たる人物は一人しかいなかった。]])\r\n\r\n    --//effect：停止\r\nFILTER_SCREEN(0)\r\n    LAYER_LOAD(LAYER_BG,\"EV017aa\")\r\n    SWITCH_SCREEN(\"mask000\",1000,false)\r\n\r\nPLAY_VOICE(\"erika_0642.wav\")\r\n    MSG([[\r\n【Erika】\r\n「ウラン、さん……？」]])\r\n\r\nPLAY_VOICE(\"uran_0150.wav\")\r\n    MSG([[\r\n【Uran】\r\n「動かないでくださいまし。軽い貧血の症状でございますわ」]])\r\n\r\nPLAY_VOICE(\"uran_0151.wav\")\r\n    MSG([[\r\n【Uran】\r\n「横になってお水を少しずつ飲めば楽になります。貧血を起こすまで努力されるなんて……本当にがんばり屋さんですのね」]])\r\n\r\n    MSG([[While wiping my head on her lap with a cold towel, Uran-san smiled gently.\r\n膝の上のボクの頭を冷たいおしぼりで拭きながら、ウランさんは穏やかに微笑みかける。]])\r\n\r\n    MSG([[I couldn't understand why she, who should be my enemy, would treat me so kindly, and I was at a loss for words.\r\n敵であるはずの自分に何故ここまで優しく接してくれるのか理解できず、言葉が出ない。]])\r\n\r\nPLAY_VOICE(\"erika_0643.wav\")\r\n    MSG([[\r\n【Erika】\r\n「私は、アナタの敵なのに……」]])\r\n\r\nPLAY_VOICE(\"uran_0152.wav\")\r\n    MSG([[\r\n【Uran】\r\n「あら悲しいですわ。敵である以前に、わたくしたちは友人ではありませんこと？」]])\r\n\r\n    --//CG：夕陽がさす木の下、エリカに膝枕をするウラン（泣）\r\n    LAYER_LOAD(LAYER_BG, \"EV017ab\")\r\n    SWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\n    MSG([[Her unexpectedly kind words brought tears to my eyes.\r\n思ってもみなかった優しい言葉をかけられて、涙が出てしまった。]])\r\n\r\n    MSG([[Even though I had carelessly spoken selfish words without knowing anything.\r\n何も知らずに自分勝手な言葉を口にしてしまったのに。]])\r\n\r\n    MSG([[Even though I acted in ways that deserved to be disliked and doubted. Why is she so kind to me?\r\n嫌われたって。疑われたって仕方がない行動をしていたのに。\r\n    　どうして彼女は優しくしてくれるのだろう。]])\r\n\r\nPLAY_VOICE(\"uran_0153.wav\")\r\n    MSG([[\r\n【Uran】\r\n「ふふ、そのように愛らしく泣いてくださる敵でしたら、わたくしは大歓迎でございますわ」]])\r\n\r\nPLAY_VOICE(\"uran_0154.wav\")\r\n    MSG([[\r\n【Uran】\r\n「龍城院さんからこの一ヶ月間のことを、すべて聞きました」]])\r\n\r\nPLAY_VOICE(\"uran_0155.wav\")\r\n    MSG([[\r\n【Uran】\r\n「エリカさんが何も知らなかったことも。保守派であるわたくしたちのために、一生懸命がんばってくださったことも」]])\r\n\r\nPLAY_VOICE(\"uran_0156.wav\")\r\n    MSG([[\r\n【Uran】\r\n「そして、かつてのマリカ様がそうであったように……どこまでも優しい方であるということも」]])\r\n\r\n    MSG([[Uran-san’s white fingers touched my hair, gently combing it as if cherishing a child.\r\nウランさんの白い指がボクの髪に触れ、まるで我が子を愛おしむように、優しく梳いていく。]])\r\n\r\n    MSG([[Just that made me feel strangely comfortable, as if all the weariness was washing away. My exhausted heart felt at ease.\r\nただそれだけなのに、不思議と全身の倦怠感が抜けていくようで心地いい。\r\n    　疲れ果てていた心が安らいでいくのを感じた。]])\r\n\r\n    MSG([[Like Hyu-san once said, maybe Uran-san really has an aura of healing around her.\r\nいつかヒユさんが言っていたように、ウランさんの周囲には本当に『癒し』のオーラが漂っているのかもしれない。]])\r\n\r\n    MSG([[If her pure heart could wash away all fatigue and negative feelings, she truly deserves the title of \"Battle Princess\".\r\n疲れも、マイナスの感情も、その清らかな心ですべてを洗い流してしまうとしたら、まさしく『姫巫女』の名に相応しい方だ。]])\r\n\r\nPLAY_VOICE(\"uran_0157.wav\")\r\n    MSG([[\r\n【Uran】\r\n「わたくしはもう、アナタを『潜入者』だなんて疑っていませんわ。エリカさんのお考えも、龍城院さんを通して十分に理解ができましたからね」]])\r\n\r\nPLAY_VOICE(\"erika_0644.wav\")\r\n    MSG([[\r\n【Erika】\r\n「あの、わ、私……ウランさんに謝りた――」]])\r\n\r\nPLAY_VOICE(\"uran_0158.wav\")\r\n    MSG([[\r\n【Uran】\r\n「謝罪はおやめくださいまし」]])\r\n\r\n    MSG([[The apology that was about to escape my throat was sharply cut off.\r\n喉元まで出かかった謝罪の言葉をぴしゃりと遮られた。]])\r\n\r\nPLAY_VOICE(\"uran_0159.wav\")\r\n    MSG([[\r\n【Uran】\r\n「理解することと受け入れることは、まったく別の問題ですわ」]])\r\n\r\nPLAY_VOICE(\"uran_0160.wav\")\r\n    MSG([[\r\n【Uran】\r\n「わたくしはあくまで『保守派』。自覚がなかったとはいえ、エリカさんは『共学派』。わたくしたちが相容れることは決してないのです」]])\r\n\r\nPLAY_VOICE(\"uran_0161.wav\")\r\n    MSG([[\r\n【Uran】\r\n「いずれにしても、決着はつけなければならないでしょう」]])\r\n\r\n    MSG([[Uran-san is right. Even if I apologize here, nothing will be resolved.\r\nウランさんの言う通りだ。\r\n    　ここで謝罪したところで、何も解決にはならない。]])\r\n\r\n    MSG([[Apologies just to make myself feel better aren't necessary.\r\n自分が楽になりたいだけの謝罪なんて、必要ないんだ。]])\r\n\r\nPLAY_VOICE(\"uran_0162.wav\")\r\n    MSG([[\r\n【Uran】\r\n「以前にダリアさんが言っておりましたでしょう？　わたくしたち『四姫』が対立することがあるとすれば、それは信念の違いから生じると」]])\r\n\r\nPLAY_VOICE(\"erika_0645.wav\")\r\n    MSG([[\r\n【Erika】\r\n「そうでしたね。あの時には、言っていることの意味が今ひとつ理解できませんでしたけど……今ならよくわかります」]])\r\n\r\n    MSG([[If both sides of 'Princess' hold ideals they won’t compromise on, what happens? I've experienced it firsthand.\r\nお互いに譲れない信念を『姫』が持っていたとすれば、どうなるのか。\r\n    　身をもって実感した。]])\r\n\r\n    MSG([[No matter how much you don't want to deny the other's values, sometimes you have to prioritize one.\r\nいくら相手の価値観を否定したくなくても、どちらかを優先しなければならないことがある。]])\r\n\r\n    MSG([[No matter how much you like the other person. No matter how well you understand their feelings. You have to conclude which belief is correct.\r\nどれほど相手に好感を抱いていようとも。 相手の気持ちを理解できていようとも。 どちらの信念が正しいかを結論付けなければならない。]])\r\n\r\n    MSG([[In such times, there’s no system more convenient than the \"Princess Election.\"\r\nその際に『姫選挙』ほど、便利なシステムはないんだ。]])\r\n\r\n    --//CG：夕陽がさす木の下、エリカに膝枕をするウラン\r\n    LAYER_LOAD(LAYER_BG, \"EV017aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\nPLAY_VOICE(\"uran_0163.wav\")\r\n    MSG([[\r\n【Uran】\r\n「既に察していらっしゃると思いますが……わたくしはアナタの従姉であるマリカ様と、エリカさんを重ねていました」]])\r\n\r\nPLAY_VOICE(\"uran_0164.wav\")\r\n    MSG([[\r\n【Uran】\r\n「ですから、アナタが男子部と手を取り合おうとする姿を見て、身勝手にも、裏切られたと思いこんでしまったのです」]])\r\n\r\nPLAY_VOICE(\"erika_0646.wav\")\r\n    MSG([[\r\n【Erika】\r\n「……ええ。今回の姫選挙の活動を通して、マリカが保守派のリーダーであったことを知りました」]])\r\n\r\nPLAY_VOICE(\"erika_0647.wav\")\r\n    MSG([[\r\n【Erika】\r\n「ウランさんの気持ちにずっと気付けなかったことを、今でも後悔しています。本当に軽率でした」]])\r\n\r\nPLAY_VOICE(\"uran_0165.wav\")\r\n    MSG([[\r\n【Uran】\r\n「いえ、それはわたくしの思い込みが原因。アナタが気にすることではありませんわ」]])\r\n\r\nPLAY_VOICE(\"uran_0166.wav\")\r\n    MSG([[\r\n【Uran】\r\n「きっとわたくしは……マリカ様のように心を許せる存在が欲しかったのでしょうね」]])\r\n\r\nPLAY_VOICE(\"uran_0167.wav\")\r\n    MSG([[\r\n【Uran】\r\n「今でしたら、マリカ様が誰にも心の内を明かさずに転校していった理由もわかりますわ」]])\r\n\r\nPLAY_VOICE(\"erika_0648.wav\")\r\n    MSG([[\r\n【Erika】\r\n「マリカから、何も事情を聞いていないのですか？」]])\r\n\r\n    MSG([[Uran-san hesitated a bit, then quietly whispered in my ear.\r\nウランさんは少し逡巡した様子を見せたものの、ボクにそっと耳打ちする。]])\r\n\r\nPLAY_VOICE(\"uran_0168.wav\")\r\n    MSG([[\r\n【Uran】\r\n「ええ、マリカ様からは何も聞かされませんでした。ですが、マリカ様の身に起きた真実をひとつだけ存じ上げています」]])\r\n\r\nPLAY_VOICE(\"uran_0169.wav\")\r\n    MSG([[\r\n【Uran】\r\n「ですが、それはこの百合愛学園の平穏を揺るがしかねないほどの情報。エリカさんが相手であってもお伝えするワケにはまいりません」]])\r\n\r\nPLAY_VOICE(\"uran_0170.wav\")\r\n    MSG([[\r\n【Uran】\r\n「そう。わたくしたち、保守派の味方になってくださらない限りは」]])\r\n\r\n    MSG([[Uran-san’s jade-like eyes stared at me.\r\nウランさんの翡翠のような瞳がボクを見つめる。]])\r\n\r\n    MSG([[Surely, this was her final plea. Her lonely expression conveyed a desperate wish to have me join her side, painfully clear.\r\nきっと、それは彼女の最後の嘆願。\r\n    　切ない表情からウランさんの孤独が。「仲間になって欲しい」という悲痛な想いが、痛いほどに伝わってくる。]])\r\n\r\nPLAY_VOICE(\"erika_0649.wav\")\r\n    MSG([[\r\n【Erika】\r\n（ウランさんに……笑ってもらいたい）]])\r\n\r\nPLAY_VOICE(\"erika_0650.wav\")\r\n    MSG([[\r\n【Erika】\r\n（ウランさんに笑ってもらうには、どうすればいいんだ）]])\r\n\r\n    MSG([[And then, an idea floated up inside me. There might be another choice—one that could make everyone smile.\r\nそこで、ひとつのアイディアが自分の中で浮かんだ。\r\n    　もしかしたら、みんなを笑顔にできてしまうかもしれない、もうひとつの選択肢が。]])\r\n\r\nPLAY_VOICE(\"erika_0651.wav\")\r\n    MSG([[\r\n【Erika】\r\n「では……もし私が姫選挙で負けたら保守派に入るというのはどうですか？　それなら私としては、負けてもマリカの話が聞けるので、安心できます」]])\r\n\r\n    MSG([[Uran-san’s eyes widened. It was natural to react like that when I suddenly added a condition disadvantageous to myself.\r\nウランさんが目を丸くする。\r\n    　急に自ら、自分に不利な条件を追加しようとしてきたのだから当然の反応だろう。]])\r\n\r\n    MSG([[Then narrowing her eyes suspiciously, Uran-san answered.\r\nそれから訝しむように目を細め、ウランさんは答えてくれた。]])\r\n\r\nPLAY_VOICE(\"uran_0171.wav\")\r\n    MSG([[\r\n【Uran】\r\n「……それは構いませんが、わたくしが負けた場合はどうするのですか？\r\n    　わたくしはいくら今回の選挙で負けたからと言って、共学派には回れませんよ」]])\r\n\r\nPLAY_VOICE(\"uran_0172.wav\")\r\n    MSG([[\r\n【Uran】\r\n「リーダーであるわたくしが抜けて、保守派がバラバラになってしまう事態は避けなければいけませんから」]])\r\n\r\n    MSG([[Just as expected. If I lose the next Princess Election, investigating Marika will be hopeless.\r\n想定通りの質問。\r\n    　そもそも、次の姫選挙で負けたらマリカ姉さんに関する調査は絶望的だ。]])\r\n\r\n    MSG([[So here I have to take the risk and hope for the slightest chance. —By making a certain request to Uran-san.\r\nならココはリスクをとってでも、僅かな可能性に望みを託すしかない。_r\r\n    　――ウランさんにとあるお願いをすることで。]])\r\n\r\nPLAY_VOICE(\"erika_0652.wav\")\r\n    MSG([[\r\n【Erika】\r\n「私が勝った際には、私たちの演劇を一緒に見ていただく、ということでかまいません」]])\r\n\r\nPLAY_VOICE(\"uran_0173.wav\")\r\n    MSG([[\r\n【Uran】\r\n「そ、それだけでよろしいのですか？」]])\r\n\r\nPLAY_VOICE(\"erika_0653.wav\")\r\n    MSG([[\r\n【Erika】\r\n「ええ。私は友人として、ウランさんにもぜひ私たちの演劇を見て欲しいんです」]])\r\n\r\nPLAY_VOICE(\"uran_0174.wav\")\r\n    MSG([[\r\n【Uran】\r\n「友人、として……」]])\r\n\r\n    MSG([[Maybe surprised by my proposition, Uran-san’s hand, which was holding mine, trembled slightly.\r\nよほど意外な提案だったのか、ボクの手を握りしめていたウランさんの手が、少しだけ震える。]])\r\n\r\n    MSG([[Her expression stiffened a little, and I thought I saw something shining in her eyes.\r\n表情も少しだけ強張って、その眼に輝くものが浮かんで見えた気がした。]])\r\n\r\n    MSG([[But soon after, her face returned to calm as she spoke.\r\nでも、それからすぐに冷静な表情に戻り、ウランさんは語る。]])\r\n\r\nPLAY_VOICE(\"uran_0175.wav\")\r\n    MSG([[\r\n【Uran】\r\n「その条件、お受けしましょう。必ず我々が勝利して、エリカさんを保守派にお招きしてみせますわ」]])\r\n\r\nPLAY_VOICE(\"uran_0176.wav\")\r\n    MSG([[\r\n【Uran】\r\n「この学園の平穏のために」]])\r\n\r\nPLAY_VOICE(\"erika_0654.wav\")\r\n    MSG([[\r\n【Erika】\r\n「いいえ。私たちが勝利し、ウランさんには一緒に観劇してもらいます」]])\r\n\r\nPLAY_VOICE(\"erika_0655.wav\")\r\n    MSG([[\r\n【Erika】\r\n「私の大好きな、皆さんの笑顔のために」]])\r\n\r\n    MSG([[We kept looking at the sky together for a while, while I was still leaning on Uran-san.\r\nそのままウランさんに身体を預けたまま、しばらく二人で空を眺め続けた。]])\r\n\r\n    MSG([[The sound of cicadas echoed as the night spread across the crimson sky.\r\nヒグラシの鳴き声が響く中、夜が広がり始めた茜色の空。]])\r\n\r\n    MSG([[The wind, which once burned my skin, had cooled just enough to gently soothe my sweaty body. The last twilight of summer vacation was coming to an end.\r\n肌を焼くようであった風もほどよく冷えて、汗ばんだ身体を優しくさすっていく。 夏休み最後の夕暮れが終わろうとしていた。]])\r\n\r\nPLAY_VOICE(\"erika_0656.wav\")\r\n    MSG([[\r\n【Erika】\r\n「かつて、私たちのように争った『姫』たちは、その後どのような関係となったのでしょうか」]])\r\n\r\nPLAY_VOICE(\"uran_0177.wav\")\r\n    MSG([[\r\n【Uran】\r\n「存じ上げませんわ。ただ少なくとも、お互いのことをより深く知ることはできたでしょうね。今のわたくしたちが、そうであるように」]])\r\n\r\nPLAY_VOICE(\"erika_0657.wav\")\r\n    MSG([[\r\n【Erika】\r\n「……また一緒に、こうして空を眺めていただけますか？」]])\r\n\r\nPLAY_VOICE(\"uran_0178.wav\")\r\n    MSG([[\r\n【Uran】\r\n「もちろんですわ」]])\r\n\r\nPLAY_VOICE(\"uran_0179.wav\")\r\n    MSG([[\r\n【Uran】\r\n「わたくしたちは同じ百合愛学園の生徒であり、『四姫』の同志であり、親愛なる友人なのですから」]])\r\n\r\n    --//BG：メインストリート（夏・夕方）\r\n    LAYER_LOAD(LAYER_BG, \"BG019ba\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    MSG([[Without a word, the two of us stood up together.\r\nボクたちは言葉もなしに、二人で一緒に立ち上がった。]])\r\n\r\n    MSG([[Then, without greeting, Uran-san headed for the school gate, and I proceeded to the classroom where the 'Knights' were waiting.\r\nそれから挨拶もなしに、ウランさんは出口の校門へと、ボクは『騎士』の皆さんが待つ教室へと進み出す。]])\r\n\r\n    MSG([[My body no longer felt heavy. No headaches or dizziness. Thanks to Uran-san, my condition had somewhat improved.\r\nもうカラダのダルさはない。頭痛も眩暈もしない。\r\n    　ウランさんのおかげで、体調はいくらか回復したようだ。]])\r\n\r\n    MSG([[And so, my first summer vacation at Yuriai Private Academy ended.\r\nこうして、ボクの百合愛学園での最初の夏休みが終わった。]])\r\n\r\n    MSG([[And the battle with Battle Princess Uran Ryuguuin truly began.\r\nそして姫巫女・龍宮院ウランさんとの戦いが、本格的に始まるのだった。]])\r\n    --　　　　　◆\r\n    STOP_SE(\"SEe004.wav\",500)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"EP03_22\")\r\n\r\nend\r\n"
}