{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP04_10",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP04/RYU/EP04_10.lua",
  "Text": "function RYU_EP04_10()\r\n    -- .承-1【11月第3週】「決別、そして決意」\r\n    SaveData.Title = \"決別、そして決意\"\r\n\r\n    -- //BG：駅前（夜）\r\n    LAYER_LOAD(LAYER_BG, \"BG002ca\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM06.wav\")\r\n\r\n    MSG([[After agreeing to the Princess Election with Daria, Erika kindly escorted me all the way to the station nearest to my home.\r\nダリアさんとの姫選挙を承諾した後、エリカさんはわたくしを心配して、自宅の最寄り駅まで付き添ってくださいました。]])\r\n\r\n    MSG([[Somehow, I feel like I have a reliable lover now. Though I'm sure Erika hasn't thought that far.\r\n何だか、頼りになる恋人ができた心地です。\r\n    　きっとエリカさんは、そこまで考えてはいないと思うのですが。]])\r\n\r\n    LAYER_LOAD(50,\"BU_ERI03aa\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nLAYER_LOAD_FACE(\"BU_RYU02fc\")\r\nPLAY_VOICE(\"uran_0634.wav\")\r\n    MSG([[\r\n【Uran】\r\nwry smile \"Erika, thank you for accompanying me all the way this far. It's already quite dark, are you okay with that?\"\r\n苦笑\r\n    「エリカさん、こんな遠くまで付き添っていただいて、ありがとうございます。もう随分と暗いですが、エリカさんは平気なのですか？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_ERI03ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"erika_1825.wav\")\r\n    MSG([[\r\n【Erika】\r\nsmile \"I'm totally fine. You remember the incident at the entrance ceremony, right? I learned well what would happen if some pervert tried to attack me.\"\r\n笑顔 「全然平気ですよ。私を襲ってくるような変質者がいたらどうなるか、入学式の一件でよく知っていますよね？」]])\r\n\r\n    MSG([[Speaking of the entrance ceremony incident, the pervert disturbance where Erika single-handedly dealt with a troubling man.\r\n入学式の一件と言えば、エリカさんが変質者の男性を一蹴した変質者騒動。]])\r\n\r\n    MSG([[I know very well that Erika is a martial artist who can hold her own against Daria.\r\nエリカさんがダリアさんに引けを取らない武道家であることはよく存じ上げています。]])\r\n\r\n    MSG([[Realizing my question had been a bit shallow, I gave a faint smile in return.\r\n自分の質問が野暮であったことに気付いて、微苦笑を返しました。]])\r\n\r\n    LAYER_LOAD(50,\"BU_ERI03aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"erika_1826.wav\")\r\n    MSG([[\r\n【Erika】\r\nnormal \"If anything strange happens around you, please contact me. Even if it's into the fire or water. No matter what, I will rush to Uran's side.\"\r\n通常 「もし身の回りで変なことが起きたら、連絡してくださいね。たとえ火の中水の中。何があったってウランさんの元に駆け付けますから」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RYU02ea\")\r\nPLAY_VOICE(\"uran_0635.wav\")\r\n    MSG([[\r\n【Uran】\r\nsmile \"Hehe, that’s reassuring. Would you come even if I called you while bathing?\"\r\n笑顔\r\n    「ふふっ、頼りになりますわね。入浴中にかけても、来てくださるのでしょうか」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_ERI03ga\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"erika_1827.wav\")\r\n    MSG([[\r\n【Erika】\r\nflustered \"P-Please only call me in an emergency!?\"\r\n焦り\r\n    「よ、呼ぶのはピンチの時だけにしてくださいね！？」]])\r\n\r\n    MSG([[Talking with Erika eases the pain of Daria's betrayal.\r\nエリカさんと話していると、ダリアさんの裏切りの傷が和らぎます。]])\r\n\r\n    MSG([[I tried to appear as unaffected as possible, but the betrayal of a friend from the very start of the school year truly hurt.\r\nできる限り衝撃を受けたように見えないよう努めましたが、やはり入学当初からの友人の裏切りは応えました。]])\r\n\r\n    MSG([[She was very talented in everything except for the horrible physical contact.\r\n身体接触がヒドいこと以外はとても優秀な方でしたのに。]])\r\n\r\n    MSG([[Especially with Lady Marika, she was on very close terms. I had secretly assumed the two of them shared feelings for each other...\r\n特にマリカ様とは仲睦まじく、わたくしは内心、お二人は想い合っているものとばかり思っていたのですが……。]])\r\n\r\n    MSG([[That, perhaps, was my own naivety.\r\nそれこそが、わたくしの甘さなのかもしれませんね。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RYU02ea\")\r\nPLAY_VOICE(\"uran_0636.wav\")\r\n    MSG([[\r\n【Uran】\r\nsmile \"Erika, please rest assured. I, Uran, vow on the name of the Ryuguuin family that I will definitely save Lady Marika.\"\r\n笑顔\r\n    「エリカさん、ご安心くださいましね。マリカ様はこのわたくしが、龍宮院家の名に懸けて必ず救ってみせますわ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_ERI03ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"erika_1828.wav\")\r\n    MSG([[\r\n【Erika】\r\nsmile \"Yes, I believe you. I’ll lead the Erika faction in supporting you, Uran.\"\r\n笑顔\r\n    「はい、信じていますよ。私も、エリカ派を率いてウランさんを応援します」]])\r\n\r\n    MSG([[Erika is smiling right in front of me.\r\n目の前で笑うエリカさん。]])\r\n\r\n    MSG([[Her lovely face looks just like my revered Lady Marika, yet somehow different.\r\n敬愛するマリカ様にそっくりで、でもどこか違う、愛らしいお顔。]])\r\n\r\n    MSG([[If there are forces that seek to dim this smile, I will oppose them with all my might.\r\nこの笑顔を曇らせようとする勢力がいるのなら、わたくしは全力で対抗しましょう。]])\r\n\r\n    MSG([[Even if it means facing the Himegami family — and ultimately the 'Phoenix' group.\r\nたとえ姫神家――ひいては『鳳凰』グループとの対峙になろうとも。]])\r\n\r\n    -- 　　　　◆\r\nSTOP_BGM(1000)\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"RYU_EP04_11\")\r\nend\r\n"
}