{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP04_07",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP04/ERI/EP04_07.lua",
  "Text": "function ERI_EP04_07()\r\n    --.起-5【11月第2週】「デートするのか、私以外の女と」\r\n    SaveData.Title = \"デートするのか、私以外の女と\"\r\n\r\n    --//BG：アキラ宅\r\n    LAYER_LOAD(LAYER_BG, \"BG023aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM03.wav\")\r\n\r\n    MSG([[That night. When I confided in Akira about what happened at the academy, she responded with a very flustered reaction.\r\nその日の夜。\r\n    　アキラに学園で起きた話を打ち明けると、とても焦ったような反応が返ってきた。]])\r\n\r\n    --//BU：アキラ（真剣・部屋着）\r\n    LAYER_LOAD(50,\"BU_AKI03ba\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0580.wav\")\r\n    MSG([[\r\n【Akira】\r\nSerious・Loungewear “S-So you actually agreed, Minachin? To a date with Hermes Himegami?”\r\n真剣・部屋着\r\n    「そ、それでミナちんはＯＫしてしまったのですか？　姫神エルメスとのデートを」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03aa\")\r\nPLAY_VOICE(\"minato_0652.wav\")\r\n    MSG([[\r\n【Minato】\r\nNormal・Casual “Yeah. It seemed Uran and Lira already had plans this weekend, so they just helped with the alibi, and I ended up being the one to go on the date.”\r\n通常・私服 「うん。この週末はウランさんもリラさんも既に予定が入ってたみたいだから、二人はアリバイ作りだけ手伝ってもらって、ボクがデートすることになったんだ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ea\")\r\nPLAY_VOICE(\"minato_0653.wav\")\r\n    MSG([[\r\n【Minato】\r\nSmiling・Casual “It’s a huge chance to learn about Marika-nee, after all. I have to do my best.”\r\n笑顔・私服\r\n    「エルメスさんからマリカ姉さんのことを聞く大チャンスだもの。がんばるしかないよね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"akira_0581.wav\")\r\n    MSG([[\r\n【Akira】\r\nSerious・Loungewear “...Are you sure you don’t have any ulterior motives? The other party is a current top idol, you know?”\r\n真剣・部屋着\r\n    「……下心ないんです？　相手は現役のトップアイドルですよ？」]])\r\n\r\n    MSG([[Akira, unusually suspicious, narrowed her eyes as she asked.\r\nアキラが珍しく訝しげに、目を細めて問いかける。]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ka\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0582.wav\")\r\n    MSG([[\r\n【Akira】\r\nGrinning・Loungewear “Even a zen-like guy like Minachin must get excited, right?”\r\nニヤリ・部屋着\r\n    「いくら悟り系男子のミナちんでも、やはり興奮してしまうのではないですか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03fc\")\r\nPLAY_VOICE(\"minato_0654.wav\")\r\n    MSG([[\r\n【Minato】\r\nWry smile・Casual “Well, that might be true.”\r\n苦笑・私服\r\n    「確かに、それはあるかもね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ga\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0583.wav\")\r\n    MSG([[\r\n【Akira】\r\nFlustered・Loungewear “Ugh... I-I see.”\r\n焦り・部屋着\r\n    「うっ……そ、そう、ですか」]])\r\n\r\n    MSG([[Huh? Somehow, Akira seemed to have gotten downhearted...?\r\nアレ？\r\n    　何だか、アキラがへこんでしまったような……？]])\r\n\r\n    MSG([[Did I say something strange? Maybe she was worried I’d be swayed by Hermes-san.\r\nボク何か、変なことを言ってしまったかな。\r\n    　もしかして、エルメスさんにボクが懐柔されるのを心配したとか、かな。]])\r\n\r\n    MSG([[To put her at ease, I gently said.\r\n安心してもらえるよう、ボクはそっと。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ea\")\r\nPLAY_VOICE(\"minato_0655.wav\")\r\n    MSG([[\r\n【Minato】\r\nSmiling・Casual “Don’t worry. It’s true I’m nervous spending a whole day with Hermes-san, but to me, Marika-nee and Akira are far, far more important than any idol.”\r\n笑顔・私服 「安心して。確かにエルメスさんと一日一緒にいるなんて緊張するけど、ボクにとってはアイドルよりも、マリカ姉さんとアキラの方がずっとずっと大切だから」]])\r\n\r\nPLAY_VOICE(\"minato_0656.wav\")\r\n    MSG([[\r\n【Minato】\r\nSmiling・Casual “I promise I’ll properly get all the information I can.”\r\n笑顔・私服\r\n    「ちゃんとしっかりと情報を引き出してみせるよ。約束する」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03da\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0584.wav\")\r\n    MSG([[\r\n【Akira】\r\nSad・Loungewear “M-Minachin...”\r\n悲しみ・部屋着\r\n    「み、ミナちん……」]])\r\n\r\nPLAY_VOICE(\"akira_0585.wav\")\r\n    MSG([[\r\n【Akira】\r\nSad・Loungewear “I’m sorry. It’s just natural to feel a bit uneasy given who the other person is.”\r\n悲しみ・部屋着\r\n    「ごめんなさい。相手が相手ですから、ちょっと不安になってしまっただけです」]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0586.wav\")\r\n    MSG([[\r\n【Akira】\r\nSmiling・Loungewear “The big sis-com demon king Minachin isn’t going to be easily charmed, right?<sprite=\"Emoji\" name=\"note\">”\r\n笑顔・部屋着\r\n    「シスコン大魔王なミナちんが、そう簡単に篭絡されたりしませんよね<sprite=\"Emoji\" name=\"note\">」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03fc\")\r\nPLAY_VOICE(\"minato_0657.wav\")\r\n    MSG([[\r\n【Minato】\r\nWry smile・Casual “Big sis-com demon king, huh.”\r\n苦笑・私服\r\n    「シスコン大魔王って」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[It was harsh, but I was glad Akira was smiling.\r\nヒドい言われようだけど、アキラが笑ってくれてよかった。]])\r\n\r\n    MSG([[Since the school festival, Akira sometimes wore a sad expression. But when I asked why, she said “It’s nothing” and quickly showed her usual cute smile, so I didn’t press further.\r\n学園祭以来、アキラは時おり悲しげな顔をする。 でも理由を聞いても「何でもない」と言うし、すぐにいつものカワイイ笑顔を見せてくれるから、突っ込んで訊ねられずにいる。]])\r\n\r\n    MSG([[So at least when we’re home together, I’ll do lots of things that make Akira happy.\r\nだからせめて、家で一緒に過ごす時は、アキラが喜ぶことをたくさんしてあげよう。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ea\")\r\nPLAY_VOICE(\"minato_0658.wav\")\r\n    MSG([[\r\n【Minato】\r\nSmiling・Casual “Since we can’t hang out this weekend, I’ll try making the dish I’m sure will make Akira happy today. Taste the demon king’s home cooking.”\r\n笑顔・私服 「週末は一緒に遊べないから、今日はアキラがきっと喜ぶ料理を作ってみるよ。シスコン大魔王の手料理をご賞味あれ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ca\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0587.wav\")\r\n    MSG([[\r\n【Akira】\r\nSurprised・Loungewear “Hmm? A new recipe?”\r\n驚き・部屋着\r\n    「むむっ、新作料理ですか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ea\")\r\nPLAY_VOICE(\"erika_1021.wav\") --ネームが「エリカ」となっていたため、ボイスがエリカになっている\r\n    MSG([[\r\n【Minato】\r\nNormal・Casual “No, it’s a bit different. It’s a deluxe version of the usual rice bowl, I guess<sprite=\"Emoji\" name=\"note\">”\r\n通常・私服\r\n    「ううん、少し違うよ。いつもの丼ぶりの豪華バージョン、ってところかな<sprite=\"Emoji\" name=\"note\">」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"akira_0588.wav\")\r\n    MSG([[\r\n【Akira】\r\nSurprised・Loungewear “The usual rice bowl... Could it be, Minachin-don?”\r\n驚き・部屋着\r\n    「いつもの丼ぶりって……ま、まさか、ミナちん丼ですか？」]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[I took out kuruma shrimp, dried shrimp, eggs, mitsuba, and white leek from the fridge.\r\n冷蔵庫からクルマエビと乾燥エビ、それに卵に三つ葉、白ネギを取り出す。]])\r\n\r\n    MSG([[Shelled the kuruma shrimp, removed heads, and tossed them into the pot.\r\nクルマエビの殻を剥き、頭を外してお鍋へポイ。]])\r\n\r\n    MSG([[Removed the vein from the shrimp bodies, rinsed them lightly in salt water, lined them up one by one on kitchen paper, then covered with more kitchen paper to drain moisture.\r\n身は背ワタを取って塩水で軽く洗って、キッチンペーパーの上に一匹ずつ並べて、その上からまたキッチンペーパーをかけて水気をとっていく。]])\r\n\r\n    MSG([[Meanwhile, I put two pots on the stove at once: one filled with shrimp heads and the other with pre-prepared broth for oyakodon.\r\nその間に、エビの頭たっぷりの両手鍋と、事前に合わせておいたダシ汁を注いだ親子丼用鍋を、ふたつ同時に火にかけた。]])\r\n\r\n    MSG([[Added white leek to the broth and lightly boiled it, then added the drained shrimp bodies.\r\nダシ汁に白ネギを加えて軽く煮て、そこに水気のとれたエビの身を投入。]])\r\n\r\n    MSG([[Next to it, the shrimp head broth had brewed nicely, so I turned off the heat and added miso.\r\n隣の鍋では、ちょうどエビの頭のダシがいい感じにとれてきたので、火を止めて味噌を加える。]])\r\n\r\n    MSG([[Without rest, the shrimp in the oyakodon pot turned a nice color, so I added a small amount of dried shrimp, then gently poured in the beaten eggs.\r\n休む間もなく、親子丼用鍋のエビの身がいい色になってきたので、乾燥エビを少量加えた後、溶き卵をそっと回し入れた。]])\r\n\r\n    MSG([[Poured the fragrant shrimp miso soup into a bowl, then placed the shrimp-egg topping over the rice bowl.\r\nエビの香りが香ばしいお味噌汁をお椀に注いで、丼ぶりのご飯の上にエビ入りの溶き卵を乗せる。]])\r\n\r\n    MSG([[Added chopped leek as garnish to the miso soup, and sprinkled shredded nori and mitsuba over the bowl, completing tonight’s dinner――\r\nお味噌汁に薬味のネギを、丼ぶりに刻みノリと三つ葉を散らせば、今日の夕飯が完成――]])\r\n\r\n    MSG([[Shrimp broth miso soup and shrimp tamago don. Shrimp tamago don uses lots of Akira’s favorite shrimp, and she calls it “Minachin-don.” It’s my proud masterpiece.\r\n海老ダシの味噌汁に、エビ玉丼。 エビ玉丼はアキラの大好物のエビをふんだんに使い、彼女からは『ミナちん丼』と呼ばれる、ボクの自信作だ。]])\r\n\r\n    MSG([[Usually I use small shrimp for this bowl, but today I used special offer kuruma shrimp. It’s already delicious as is, but today’s taste will surely be exceptional.\r\n普段は小エビを使っているその丼ぶりに、今日は特売だったクルマエビを使用してみた。普段も十分においしいけれど、きっと今日の味は格別に違いない。]])\r\n\r\n    --//BU：アキラ（笑顔・部屋着）\r\n    LAYER_LOAD(50,\"BU_AKI03eb\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"akira_0589.wav\")\r\n    MSG([[\r\n【Akira】\r\nSmiling・Loungewear “Slurp”\r\n笑顔・部屋着\r\n    「じゅるり」]])\r\n\r\n    MSG([[Drawn by the smell of her favorite shrimp, Akira unusually stopped playing games early and sat at the table.\r\n大好きなエビのニオイにつられて、珍しくゲームを早めに切り上げて、食卓に着くアキラ。]])\r\n\r\n    MSG([[Seeing that lovely smile made me truly glad I went all out for dinner.\r\nその愛らしい笑顔を見ると、夕食を奮発してよかったと心の底から嬉しくなった。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ea\")\r\nPLAY_VOICE(\"minato_0659.wav\")\r\n    MSG([[\r\n【Minato】\r\nSmiling・Casual “Here’s your tea. I’ll make my own don bowl now, so eat yours before it gets cold.”\r\n笑顔・私服\r\n    「はい、お茶。ボクの分の丼ぶりは今から作るから、アキラは冷めない内に先に食べてね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0590.wav\")\r\n    MSG([[\r\n【Akira】\r\nSmiling・Loungewear “It feels bad to eat first, but I’d feel even worse leaving these delicious shrimps uneaten, so thank you!”\r\n笑顔・部屋着\r\n    「先に食べるのは心苦しいですが、せっかくおいしく料理されたエビさんズを放置するのはもっと心苦しいので、いただきます！」]])\r\n\r\n    MSG([[Akira quickly said thanks, picked up her chopsticks, and took a big bite of the bowl.\r\nアキラは手早くいただきますすると、箸を手に取って、丼ぶりを大きな口で頬張った。]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ca\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0591.wav\")\r\n    MSG([[\r\n【Akira】\r\nSurprised・Loungewear “Wow... D-Delicious. The shrimp is so plump.”\r\n驚き・部屋着\r\n    「ふわぁぁ……お、おいしい。エビの身がぷっりぷりなんです」]])\r\n\r\nPLAY_VOICE(\"akira_0592.wav\")\r\n    MSG([[\r\n【Akira】\r\nSurprised・Loungewear “The rich shrimp flavor is balanced perfectly by the gentle sweetness of the egg, creating an exquisite taste.”\r\n驚き・部屋着 「濃厚なエビの風味を玉子の優しい甘さが受け止めてくれて、絶妙な味わいを生み出しています」]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0593.wav\")\r\n    MSG([[\r\n【Akira】\r\nSmiling・Loungewear “And the crunchy dried shrimp texture is the perfect accent. The soft half-boiled egg, plump shrimp, and crunchy dried shrimp form a wonderful trio!”\r\n笑顔・部屋着 「それに、この乾燥エビのカリコリとした食感が最高のアクセントです。半熟卵の柔らかさにエビの身のぷりぷり感、乾燥エビの歯応えが、素晴らしい三重奏を奏でています！」]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ba\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0594.wav\")\r\n    MSG([[\r\n【Akira】\r\nSerious・Loungewear “This is definitely the greatest masterpiece among Minachin’s cooking. I say that as a hardcore picky eater, so no mistake.”\r\n真剣・部屋着 「これはミナちんの料理の中で間違いなく最高傑作ですよ。ド偏食家の私が言うのですから、間違いありません」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03fa\")\r\nPLAY_VOICE(\"minato_0660.wav\")\r\n    MSG([[\r\n【Minato】\r\nWry smile・Sweat・Casual “I think calling yourself a picky eater lowers the credibility of that review.”\r\n苦笑・汗・私服\r\n    「へ、偏食家を自称すると、レヴューの信憑性は下がるんじゃないかな」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I’m beyond happy she’s this pleased. Seeing Akira now, she hasn’t changed from the bright girl she was before.\r\nここまで喜んでくれるなんて、嬉しい限りだ。\r\n    　今のアキラを見る限り、以前までの明るい彼女から変わりがない。]])\r\n\r\n    MSG([[Believing that if I continue caring for Akira like this, whatever troubles she might be carrying will fade away.\r\nこうして、ボクがアキラのそばで尽くしていけば、アキラが抱えているかもしれない悩みも消えてくれると、信じるしかなかった。]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03eb\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0595.wav\")\r\n    MSG([[\r\n【Akira】\r\nSmiling・Loungewear “I-I’ve already finished... My stomach is so happy. My head is a shrimp paradise. I want to fall asleep like this forever.”\r\n笑顔・部屋着 「も、もう食べ終えちゃいました……お腹が幸せです。頭の中もエビ天国です。このまま永眠しちゃいたい」]])\r\n\r\nPLAY_VOICE(\"akira_0596.wav\")\r\n    MSG([[\r\n【Akira】\r\nSmiling・Loungewear “Thank you for the meal, Minachin. Being able to eat such delicious food makes me fully realize how lucky I am.”\r\n笑顔・部屋着 「ミナちん、ごちそうさまなんです。こんなにも美味しいご飯を作ってもらえて、つくづく私は幸せ者だと実感するばかりですよ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03fc\")\r\nPLAY_VOICE(\"minato_0661.wav\")\r\n    MSG([[\r\n【Minato】\r\nWry smile・Casual “You’re welcome. Since it’s bad to get sleepy right after eating, I’ll make some coffee for after. Sit down and wait a bit.”\r\n苦笑・私服 「お粗末様でした。食べてすぐに眠くなるといけないから、食後のコーヒーを淹れるよ。ちょっと座って待っててね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n    --//BU：UIからミナトが消失（アキラを一人残す形に）\r\n\r\nSTOP_BGM(2000)\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03eb\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0597.wav\")\r\n    MSG([[\r\n【Akira】\r\nSmiling・Loungewear “Thank you, Minachin.”\r\n笑顔・部屋着\r\n    「ありがとう、ミナちん」]])\r\n\r\nPLAY_VOICE(\"akira_0598.wav\")\r\n    MSG([[\r\n【Akira】\r\nSmiling・Loungewear “Really, I am a lucky girl.”\r\n笑顔・部屋着\r\n    「本当に、私は幸せ者ですねえ」]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03da\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0599.wav\")\r\n    MSG([[\r\n【Akira】\r\nSad・Loungewear “Too lucky... maybe more than I deserve.”\r\n悲しみ・部屋着\r\n    「幸せ……過ぎますよね。分不相応なまでに」]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    --　　　◆\r\n\r\n    LAYER_LOAD(LAYER_BG, \"\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"ERI_EP04_08\")\r\nend\r\n"
}