{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP04_09",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP04/ERI/EP04_09.lua",
  "Text": "function ERI_EP04_09()\r\n    --.起-7【11月第3週】「姫騎士の裏切り」\r\n    SaveData.Title = \"姫騎士の裏切り\"\r\n\r\n    --//BG：駅前\r\n    LAYER_LOAD(LAYER_BG, \"BG002ba\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    MSG([[When I left the shop――\r\n店を出ると――]])\r\n\r\n    MSG([[Someone I know well awaited me, wearing an expression I had never seen before.\r\nよく知るヒトが、ボクの知らない表情を浮かべ、待ち構えていた。]])\r\n    --//CG：裏切りのダリア\r\n    LAYER_LOAD(LAYER_BG, \"EV021aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM10.wav\")\r\n\r\nPLAY_VOICE(\"dahlia_0206.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Such a naughty child……Hermes.”\r\n「いけない子だなぁ……エルメス」]])\r\n\r\nPLAY_VOICE(\"dahlia_0207.wav\")\r\n    MSG([[\r\n【Daria】\r\n “I told you not to talk about Marika so much outside, didn’t I?”\r\n「マリカのことはあまり外で話してはいけないって、アレほど言っておいただろう？」]])\r\n\r\n    MSG([[Daria-san wore a chilling cold smile.\r\nゾッとするような冷笑を浮かべるダリアさん。]])\r\n\r\n    MSG([[The ice-like coldness made not only me but also Hermes-san next to me flinch in fear.\r\nその氷を思わせる冷たさに、ボクはおろか、隣のエルメスさんも怯えた様子となった。]])\r\n\r\nPLAY_VOICE(\"hermes_0292.wav\")\r\n    MSG([[\r\n【Hermes】\r\n “S-sorry! But, really, I haven’t talked about it at all!? I swear!”\r\n「ご、ごめんなさい！　でもでも、私、全然話してないよっ！？　本当だよ！？」]])\r\n\r\nPLAY_VOICE(\"hermes_0293.wav\")\r\n    MSG([[\r\n【Hermes】\r\n “Right!? Isn’t that right, Erika-chan!? I haven’t said a thing, right!?”\r\n「そうだよね！？　だよねだよね、エリカちゃん！　私、なーんにも話してないよね！？」]])\r\n\r\nPLAY_VOICE(\"erika_1065.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Y-yes. In the end, I couldn’t get any conclusive information from Hermes-san.”\r\n「そ、そうですね。\r\n    　エルメスさんからは結局、確証を得られるようなお話は聞けませんでした」]])\r\n\r\n    MSG([[I soothed Hermes-san who clung to me and faced Daria-san.\r\nボクに縋りつくエルメスさんを宥めるように言って、ダリアさんと相対した。]])\r\n\r\nPLAY_VOICE(\"erika_1066.wav\")\r\n    MSG([[\r\n【Erika】\r\n “But the words of repentance you spoke to Marika really helped.”\r\n「ダリアさんがマリカに語っていた懺悔の言葉には、とても助けられましたけどね」]])\r\n\r\nPLAY_VOICE(\"dahlia_0208.wav\")\r\n    MSG([[\r\n【Daria】\r\n “...! Could it be that you saw it at the school festival...?”\r\n「……っ！　まさか、学園祭の時に見られたのか…？」]])\r\n\r\nPLAY_VOICE(\"dahlia_0209.wav\")\r\n    MSG([[\r\n【Daria】\r\n “For someone like me. It seems I was careless because I thought no one would see it at the school festival.”\r\n「私としたことが。学園祭だから誰にも見られないと、油断していたみたいだね」]])\r\n\r\nPLAY_VOICE(\"dahlia_0210.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Hermes, could you stay inside the shop? I want to have a private talk with Erika-kun now.”\r\n「エルメスは店の中へ入っていてもらえるかい？\r\n    　今から私は、エリカくんと二人きりで話したいことがあってね」]])\r\n\r\nPLAY_VOICE(\"hermes_0294.wav\")\r\n    MSG([[\r\n【Hermes】\r\n “B-but……”\r\n「で、でもぉ……」]])\r\n\r\nPLAY_VOICE(\"erika_1067.wav\")\r\n    MSG([[\r\n【Erika】\r\n “It’s alright, Hermes-san. We’ll talk just a little and come right back.”\r\n「大丈夫ですよ、エルメスさん。少しだけお話をして、すぐに戻りますから」]])\r\n\r\n    MSG([[Only after both Daria-san and I gently persuaded her did Hermes-san reluctantly return inside the shop.\r\nダリアさんと二人がかりで諭し続けてようやく、渋々と言った様子で店の中へと戻るエルメスさん。]])\r\n\r\n    MSG([[Watching her back, Daria-san expressed her thanks.\r\nその背中を見送ると、ダリアさんはお礼を口にした]])\r\n\r\nPLAY_VOICE(\"dahlia_0211.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Thank you. It’s a topic I don’t want to be overheard by Hermes, so this is a relief.”\r\n「ありがとう。エルメスの耳には入れたくない話題だから助かるよ」]])\r\n\r\nPLAY_VOICE(\"erika_1068.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Not at all. I was hoping to talk to you alone as well, Daria-san.”\r\n「いえ。私も、ダリアさんとは二人きりでお話をしたいと思っていましたから」]])\r\n\r\n    MSG([[Daria-san and I quietly shared a smile. But neither of us truly smiled.\r\nダリアさんとそっと笑い合う。\r\n    　でもボクもダリアさんも、心からは笑っていない。]])\r\n\r\n    MSG([[We both sensed that our previous relationship could no longer continue.\r\nお互い、以前までの関係ではいられないことを察している。]])\r\n\r\nPLAY_VOICE(\"dahlia_0212.wav\")\r\n    MSG([[\r\n【Daria】\r\n “There’s no need to hide it anymore. As you’ve guessed, I, Daria Himegami, am the one who cornered Marika.”\r\n「もう隠す必要もないだろう。\r\n    　キミが察している通り、マリカを追い詰めた張本人はこの私、姫神ダリアだ」]])\r\n    --//CI：エリカBU（悲しみ）切り抜き 090\r\n    LAYER_LOAD(200,\"BG000ab\")\r\n    LAYER_LOAD(201,\"BUL_ERI03da\")\r\n    LAYER_POSITION(201,0,-50)\r\n    SET_CUTIN_01_M(100, 500)\r\n\r\n    MSG([[I had braced myself, but my chest hurt. The small remaining chance had now completely vanished.\r\n覚悟していたけれど胸が痛む。\r\n    　僅かに残っていた可能性も、これで完全に消えてしまった。]])\r\n\r\n    MSG([[Truly. Without a doubt. Daria-san was my enemy.\r\n本当に。\r\n    　正真正銘。\r\n    　ダリアさんはボクの敵だったんだ。]])\r\n\r\n    RESET_CUTIN_01(100, 500)\r\n\r\nPLAY_VOICE(\"erika_1069.wav\")\r\n    MSG([[\r\n【Erika】\r\n “W-why did you do that to Marika...? You said she was your friend.”\r\n「ど、どうしてマリカを……？　友達だって、言ってたじゃないですか」]])\r\n\r\nPLAY_VOICE(\"dahlia_0213.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Hehe. The reason is simple. I am the arch-enemy of Uran-kun and his conservative faction—the leader of the coeducation faction.”\r\n「ふふ。理由は単純だよ。私がウランくんたち保守派の仇敵――共学派の筆頭だからさ」]])\r\n\r\nPLAY_VOICE(\"dahlia_0214.wav\")\r\n    MSG([[\r\n【Daria】\r\n “The ‘shadow coeducation faction’ you were suspected to be a part of? That was me.”\r\n「キミが疑われていた『影の共学派』というのは、私のことだったんだよ」]])\r\n\r\nPLAY_VOICE(\"erika_1070R.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Daria-san is the true identity of the ‘shadow coeducation faction’...!?”\r\n「ダリアさんが『影の共学派』の正体……！？」]])\r\n\r\n    MSG([[She had been the one who supported me when I was suspected. She said she was neutral and encouraged me.\r\nボクが疑われていた時に相談に乗ってくれていたのに。\r\n    　『自分は中立だ』と言って、背中を押してくれたのに。]])\r\n\r\n    MSG([[And all of that had been an act...?\r\nそれは全部、演技だったということ……？]])\r\n\r\nPLAY_VOICE(\"erika_1071.wav\")\r\n    MSG([[\r\n【Erika】\r\n “W-why……”\r\n「どう、して……」]])\r\n\r\n    MSG([[Uncontrollable emotions burst out as words from the back of my throat.\r\nこらえきれなかった感情が、喉の奥から言葉となって噴出する。]])\r\n\r\nPLAY_VOICE(\"erika_1072.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Why were you kind to me!? Why did you act like an ally!?”\r\n「どうして私に優しくしてくれたんですか！？　どうして、味方みたいに振る舞ったんですか！？」]])\r\n\r\nPLAY_VOICE(\"erika_1073.wav\")\r\n    MSG([[\r\n【Erika】\r\n “I, and everyone else, surely even Marika, trusted you! How could you betray us!?”\r\n「私も、他の皆さんも、きっとマリカだってアナタを信頼していたのに！\r\n    　どうして裏切ることができたんですか！？」]])\r\n\r\nPLAY_VOICE(\"dahlia_0215.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Hehe, if someone approaches you only to gain your trust from the start, is that really betrayal? To me, it’s merely following the plan.”\r\n「ふふ、最初から信頼を得るために近寄った場合でも、裏切りと言うのかい？　私にとっては、ただ計画に則っただけなのだが？」]])\r\n\r\nPLAY_VOICE(\"erika_1074.wav\")\r\n    MSG([[\r\n【Erika】\r\n “F-from the start!?”\r\n「さ、最初から！？」]])\r\n\r\nPLAY_VOICE(\"erika_1075.wav\")\r\n    MSG([[\r\n【Erika】\r\n “You mean to say that appearing in the boys' division, befriending the boys, helping with the school festival—all of it was all a calculated move!?”\r\n「まさか、男子部に現れたのも、男子部の皆さんと仲良くなったのも、学園祭を手伝ってくれたのも、全部全部、計算ずくだって言うんですか！？」]])\r\n\r\nPLAY_VOICE(\"dahlia_0216.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Yes. As I planned, you gained trust from the conservatives and effectively became their representative.”\r\n「ああ。私が計画した通り、キミは保守派からも信頼を得て、実質保守派の代表となった」]])\r\n\r\nPLAY_VOICE(\"dahlia_0217.wav\")\r\n    MSG([[\r\n【Daria】\r\n “After that, at the Princess Election, I’ll thoroughly defeat you and keep you under my control, making it a major foothold for coeducation.”\r\n「あとはキミを、次の姫選挙の場で徹底的に打ち倒し、私の支配下におけば、共学化への大きな足掛かりとなる」]])\r\n\r\nPLAY_VOICE(\"dahlia_0218.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Just like when Marika Ikusa, once elevated to leader of the conservatives by my guidance, suffered a crushing defeat at the hands of Hermes, dealing a major blow to the conservatives.”\r\n「かつて、私の誘導により保守派のリーダーへと祀り上げられた伊草マリカが、エルメスに惨敗し、保守派に大きな打撃を与えた時と同じようにね」]])\r\n\r\n    MSG([[I am still part of the coeducation faction. I want to advance coeducation slowly without breaking tradition.\r\nボクはあくまで共学派。\r\n    　伝統を崩さない速度で、緩やかに共学化を進めていきたいと考えている立場だ。]])\r\n\r\n    MSG([[But after I won against Uran at the Princess Election, I gained support from conservative students as well.\r\nでもウランさんに姫選挙で勝利したことをきっかけに、今では保守派の生徒の皆さんからも支持を得ている。]])\r\n\r\n    MSG([[If I lose the Princess Election now at this timing, it would clearly cause major confusion among the conservatives.\r\nそのボクまで、今このタイミングで姫選挙に敗れれば、保守派の中で大きな混乱が生じるのは明らかだった。]])\r\n\r\nPLAY_VOICE(\"erika_1076.wav\")\r\n    MSG([[\r\n【Erika】\r\n “...There’s no way I’ll accept the Princess Election after hearing such a despicable plan.”\r\n「……そんな卑劣な計画を聞いて、姫選挙に応じるワケがないでしょう」]])\r\n\r\nPLAY_VOICE(\"erika_1077.wav\")\r\n    MSG([[\r\n【Erika】\r\n “I am not part of the conservatives, but I want to protect Yuriai Private Academy’s traditions.”\r\n「私は保守派ではありませんが、百合愛学園の伝統は守りたいと考えています」]])\r\n\r\nPLAY_VOICE(\"erika_1078.wav\")\r\n    MSG([[\r\n【Erika】\r\n “I won’t fall for your slick words trying to forcibly promote coeducation.”\r\n「強引な手段で共学化を図ろうとするアナタの口車には乗りませんよ」]])\r\n\r\nPLAY_VOICE(\"dahlia_0219.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Hey, hey, why do you think I revealed everything?”\r\n「オイオイ、何のために私がすべてを明かしたと思うんだい？」]])\r\n\r\nPLAY_VOICE(\"dahlia_0220.wav\")\r\n    MSG([[\r\n【Daria】\r\n “As I just said, Marika’s failure to wake up is probably because of the shock of being betrayed by me.”\r\n「今語った通り、マリカが目覚めない理由は、恐らく私に裏切られたショックによるものだ」]])\r\n\r\nPLAY_VOICE(\"dahlia_0221.wav\")\r\n    MSG([[\r\n【Daria】\r\n “If I were to get down on my knees and bow my head, apologizing for everything so far, she might wake up.”\r\n「私が地べたに手をつき、こうべを垂らして、これまでのすべてを謝罪すれば、彼女は目を覚ますかもしれないよ？」]])\r\n\r\nPLAY_VOICE(\"erika_1079.wav\")\r\n    MSG([[\r\n【Erika】\r\n “T-that kind of thing……”\r\n「そ、そんなこと……」]])\r\n\r\n    MSG([[I couldn’t entirely dismiss it. If what Daria-san said was true, she surely placed a heavy burden on Marika’s heart.\r\n無いとは言い切れない。\r\n    　ダリアさんの言う通りであったなら、彼女がマリカ姉さんの心に大きな負担を与えたことは確かだ。]])\r\n\r\n    MSG([[If Daria’s apology is the key to wake Marika-neesan, it wouldn’t be strange.\r\nマリカ姉さんを目覚めさせるキー、ダリアさんによる謝罪の言葉であっても、不思議はないんだ。]])\r\n\r\nPLAY_VOICE(\"dahlia_0222.wav\")\r\n    MSG([[\r\n【Daria】\r\n “You seem to understand. To save Marika, there’s no other way than to fight me.”\r\n「状況が飲み込めたみたいだね。マリカを救うには、この私と戦う他に道はないんだよ」]])\r\n\r\nPLAY_VOICE(\"dahlia_0223.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Now that you understand your position, let’s hold the Princess Election risking our mutual ‘submission.’”\r\n「自分の立場を理解したなら、互いの『服従』を賭けて姫選挙を行おうじゃないか」]])\r\n\r\nPLAY_VOICE(\"dahlia_0224.wav\")\r\n    MSG([[\r\n【Daria】\r\n “If you win, I will sincerely apologize to Marika. But if I win, you must join the coeducation faction.”\r\n「キミが勝利した場合、私は心の底からマリカに詫びよう。ただし私が勝利した場合は、キミには共学派へと転じてもらう」]])\r\n\r\nPLAY_VOICE(\"dahlia_0225.wav\")\r\n    MSG([[\r\n【Daria】\r\n “This will be a serious battle betting on your and my ‘beliefs.’”\r\n「キミと私の『信念』を賭けた、真剣勝負さ」]])\r\n\r\n    MSG([[Daria-san said this in her usual calm tone.\r\nダリアさんが聞き慣れた穏やかな口調で言った。]])\r\n\r\n    MSG([[Hearing the familiar tone from someone I know well was even more infuriating. Somewhere in my heart, I still wished she was someone else.\r\nよく知る彼女の口調なのが、一層腹立たしい。 心のどこかで、まだ目の前のダリアさんが、別人であって欲しいと願ってしまう。]])\r\n\r\n    MSG([[But her manner and tone were the same Daria-san I knew. Reluctantly, I was reminded this was the very same Himegami Daria I had spent time with.\r\nだけど振る舞いも口調もボクのよく知るダリアさんのままで、否応もなく、これまで時間を共にしてきた姫神ダリア本人であることを思い知らされる。]])\r\n\r\n    MSG([[And that was unbearably sad.\r\nそれがどうしようもなく、悲しかった。]])\r\n\r\n    --//CI：エリカBU（真剣）口元切り抜き 091\r\n    LAYER_LOAD(200,\"BG000ab\")\r\n    LAYER_LOAD(201,\"BUL_ERI03da\")\r\n    LAYER_POSITION(201, 0, 105)\r\n    SET_CUTIN_06_M(100, 500)\r\n\r\nPLAY_VOICE(\"erika_1080.wav\")\r\n    MSG([[\r\n【Erika】\r\n “………………”\r\n「………………」]])\r\n\r\n    RESET_CUTIN_00()\r\n    SWITCH_SCREEN(\"mask000\",100,false)\r\n\r\n    --//CI：エリカBU（真剣）斜め切り抜き 092\r\n    --吉　カットインの形次第でスクリプト変更\r\n    LAYER_LOAD(200,\"BG000ab\")\r\n    LAYER_LOAD(201,\"BUL_ERI03ba\")\r\n    LAYER_POSITION(201, 60, 0)\r\n    SET_CUTIN_31_XL(100, 500)\r\n\r\n    MSG([[I clenched my trembling hands into fists, stared straight at my enemy, and declared.\r\n震える手に力を込めて、握り拳を形作った。\r\n    　そして目の前の敵を真っすぐに睨みつけ、宣言する。]])\r\n\r\nPLAY_VOICE(\"erika_1081.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Understood. I will accept the Princess Election.”\r\n「わかりました、姫選挙に応じます」]])\r\n\r\nPLAY_VOICE(\"erika_1082.wav\")\r\n    MSG([[\r\n【Erika】\r\n “I will defeat you, make you apologize to Marika, and save both Yuriai Private Academy and Marika!!”\r\n「アナタに勝って、マリカに謝ってもらって、百合愛学園も、マリカのことも、救ってみせます！！」]])\r\n\r\nPLAY_VOICE(\"dahlia_0226.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Excellent. That’s the Erika-kun I know. I’ll arrange everything on my end, so you can relax.”\r\n「素晴らしい。それでこそエリカくんだ。\r\n    　諸々の手配は私の方で済ませておくから、安心してくれたまえ」]])\r\n\r\n    --//BG：駅前\r\n    LAYER_LOAD(50,\"\")\r\n    RESET_CUTIN_00()\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\",1000,false)\r\n\r\n    LAYER_LOAD(LAYER_BG,\"BG002ba\")\r\n    --//BU：エルメス（驚き）、ダリア（通常）\r\n    LAYER_LOAD(50,\"BU_ERU02ca\")\r\n    LAYER_POSITION(50,-400,0)\r\n    LAYER_LOAD(55,\"BU_DAR01aa\")\r\n    LAYER_POSITION(55,400,0)\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_VOICE(\"dahlia_0227.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Now then, Hermes, let’s go. Mother is furious. If you don’t show your face soon, the mansion’s servants might lose their jobs.”\r\n「さぁ、エルメス、帰るぞ。お母さまがカンカンだ。\r\n    　早くオマエの顔を見せてやらないと、屋敷の従者のクビが飛びかねない」]])\r\n\r\n    LAYER_LOAD(50,\"BU_ERU02ga\")\r\n    LAYER_POSITION(50,-400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"hermes_0295.wav\")\r\n    MSG([[\r\n【Hermes】\r\n “Ehh!? T-terrible!? I’ll go back right away! Don’t fire anyone, please!!”\r\n「ええーっ！？　たたた、大変だーっ！？\r\n    　今すぐ帰るよ！　帰るからみんなをクビにしないであげて！！　お願い！」]])\r\n\r\n    LAYER_LOAD(50,\"BU_ERU02da\")\r\n    LAYER_POSITION(50,-400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"hermes_0296.wav\")\r\n    MSG([[\r\n【Hermes】\r\n “Erika-chan, bye! I’m sorry we had to part like this!”\r\n「エリカちゃん、バイバイ！　こんなお別れの仕方になっちゃってごめんね！」]])\r\n\r\n    LAYER_LOAD(50,\"BU_ERU02ea\")\r\n    LAYER_POSITION(50,-400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"hermes_0297.wav\")\r\n    MSG([[\r\n【Hermes】\r\n “Thanks so much for today~~! It was suuuuper fun! Let’s meet at school again~~~!”\r\n「今日は本当にありがと～～！　ス～～～～ゴく楽しかったよ！　また学園で会おうね～～～！」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI03ea\")\r\nPLAY_VOICE(\"erika_1083.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Yes. At school, then.”\r\n「ええ。また、学園で」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(55,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[Leaving me standing there, Daria-san grabbed Hermes-san’s hand and got into a nearby foreign car, then drove away.\r\nその場に立ち尽くしたボクを置いて、ダリアさんはエルメスさんの手を引き、近くの外車へと乗り込んで去っていった。]])\r\n\r\n    MSG([[Left alone, I placed my hand over the brooch on my chest and gathered my thoughts.\r\n一人取り残されたボクは、胸のブローチに手を当てて、胸の内を整理する。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI03ba\")\r\nPLAY_VOICE(\"erika_1084.wav\")\r\n    MSG([[\r\n【Erika】\r\n (Calm down, there’s no need to grieve.)\r\n（落ち着け、悲しむ必要なんてないじゃないか）]])\r\n\r\nPLAY_VOICE(\"erika_1085.wav\")\r\n    MSG([[\r\n【Erika】\r\n (We finally found out who cornered Marika-neesan, whom I’ve always been curious about.)\r\n（ずっと知りたがっていたマリカ姉さんを追い込んだ犯人がわかったんだ）]])\r\n\r\nPLAY_VOICE(\"erika_1086.wav\")\r\n    MSG([[\r\n【Erika】\r\n (Now all that remains is to defeat Daria-san and make her apologize to Marika-neesan to solve everything.)\r\n（あとはダリアさんに勝って、マリカ姉さんに謝罪させれば、すべて解決する）]])\r\n\r\nPLAY_VOICE(\"erika_1087.wav\")\r\n    MSG([[\r\n【Erika】\r\n (All my efforts so far will finally pay off.)\r\n（これまでの努力がやっと報われるんだ）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[It’s just that Daria-san was the enemy from the start.\r\nダリアさんは初めから敵だったというだけの話だ。]])\r\n\r\n    MSG([[There’s no reason to be sad. There really isn’t. Yet...\r\n悲しむ必要なんかない。\r\n    　ないはずなのに。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI03da\")\r\nPLAY_VOICE(\"erika_1088.wav\")\r\n    MSG([[\r\n【Erika】\r\n “”\r\n「」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[For some reason, tears spilled from my eyes and wouldn’t stop.\r\n何故か、目から涙が溢れて、止まらなかった。]])\r\n    --　　　　　◆\r\nSTOP_BGM(1000)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"ERI_EP04_10\")\r\nend\r\n"
}