{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP04_12",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP04/ERU/EP04_12.lua",
  "Text": "function ERU_EP04_12()\r\n    -- .転-2【11月第4週】「『鳳凰』グループ」\r\n    SaveData.Title = \"『鳳凰』グループ\"\r\n\r\n    -- //BG：アキラ宅\r\n    LAYER_LOAD(LAYER_BG, \"BG023aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    -- //BU：アキラ・部屋着（悲しみ）\r\n    LAYER_LOAD(50,\"BU_AKI03da\")\r\n    LAYER_POSITION(50,200,0)\r\n    LAYER_MOVE_POSITION(50,0,0,500,Ease.OutCubic)\r\n    SWITCH_SCREEN(\"mask000\",500,false)\r\n\r\nPLAY_VOICE(\"akira_plus0009.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Sadness \"M-Mina-chin, it's terrible! Arurun... Arurun is nowhere to be found!\"\r\n部屋着・悲しみ\r\n    「み、ミナちん大変です！　アルルンが……アルルンがどこにもいません！」]])\r\n\r\nPLAY_BGM(\"BGM10.wav\")\r\n\r\n    MSG([[The next morning, Akira's voice, as if about to cry, woke me from my sinking consciousness.\r\n翌朝、今にも泣き出しそうなアキラの声で、沈んでいたボクの意識は覚醒した。]])\r\n\r\n    -- //BU：なし\r\n    LAYER_LOAD(50,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[When Akira woke up, it seems Almellia-san was nowhere to be seen.\r\nアキラが目を覚ました時には、アルメリアさんの姿はどこにもなかったらしい。]])\r\n\r\n    MSG([[She was taken away with such caution that even Akira, who was sleeping in the same bed, didn’t notice.\r\n同じベッドで眠っていたアキラが気付けないほどの慎重さで、連れ去られてしまったようだ。]])\r\n\r\n    MSG([[When I explained what happened last night, she became unusually upset and started crying out loud.\r\nボクが昨夜の出来事を説明すると、彼女には珍しいくらいに動揺し、声をあげて泣き始めた。]])\r\n\r\n    -- //BU：アキラ・部屋着（悲しみ）\r\n    LAYER_LOAD(50,\"BU_AKI03da\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"akira_plus0010.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Sadness \"No way... After finally meeting a girl in real life who I really connect with... this is too much.\"\r\n部屋着・悲しみ\r\n    「そんなぁ……せっかく、リアルで話の合う女の子と初めて知り合えたのにぃ……あんまりですよ」]])\r\n\r\n    MSG([[I stared at Akira’s tearful face and clenched my fists. If I were stronger, Akira wouldn’t have to cry.\r\nアキラの泣き顔を見つめ、拳を握りしめる。\r\n    　ボクが強ければアキラが泣くことだってなかった。]])\r\n\r\n    MSG([[I truly hate my own weakness. But I can’t mope around like always.\r\n本当に、自分の弱さがイヤになる。\r\n    　でもいつもみたいに、クヨクヨなんてしてはいられない。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ba\")\r\nPLAY_VOICE(\"minato_plus0008.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual・Serious \"Don’t worry, Akira. No matter what, I will definitely rescue Almellia-san.\"\r\n私服・真剣\r\n    「安心して、アキラ。アルメリアさんは何としても、ボクが必ず助け出すから」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ca\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_plus0011.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Surprise \"M-Mina-chin...?\"\r\n部屋着・驚き\r\n    「み、ミナちん……？」]])\r\n\r\n    MSG([[Akira looked at my face, dazed.\r\nアキラが呆けた様子でボクの顔を見つめた。]])\r\n\r\nPLAY_VOICE(\"akira_plus0012.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Surprise \"W-What’s going on? You’d usually be down, caught up in self-loathing, right? Why do you have such a determined look?\"\r\n部屋着・驚き 「ど、どうしたんです？　いつもならヘコんで、自己嫌悪でウジウジするところでしょう？　どうして、そんな覚悟が固まった表情をしているんです？」]])\r\n\r\n    MSG([[Akira might be right. If it were me before, I’d probably have visited Marika-neesan’s hospital room and complained at least once.\r\n確かにアキラの言う通りかもしれない。\r\n    　今までのボクなら、きっとマリカ姉さんの病室を訪れて、弱音のひとつでも吐いているところだろう。]])\r\n\r\n    MSG([[But strangely, I don’t feel like that now.\r\nでも不思議と、今はそんな気が起こらなかった。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ba\")\r\nPLAY_VOICE(\"minato_plus0009.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual・Serious \"There’s no time to hesitate. If I were stronger, I wouldn’t have lost to Daria-san. I could have saved Almellia-san.\"\r\n私服・真剣 「迷っている暇なんてないよ。ボクがもっと強ければ、ダリアさんに負けることもなかった。アルメリアさんを助けられたんだ」]])\r\n\r\nPLAY_VOICE(\"minato_plus0010.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual・Serious \"If there’s time to hesitate, then I’ll become stronger. I will save Almellia-san even if I have to risk my own life.\"\r\n私服・真剣 「迷っている暇があるなら、もっと強くなる。ボクの命に代えたって、アルメリアさんは助け出してみせるよ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_plus0013.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Normal \"...That’s quite the resolve. But do you have any leads on where to find Arurun?\"\r\n部屋着・通常\r\n    「……それは、大した覚悟ですけど。アルルンを探す当てはあるんですか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03da\")\r\nPLAY_VOICE(\"minato_plus0011.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual・Sadness \"That, I don’t know.\"\r\n私服・悲しみ\r\n    「それは、わからないんだけどね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03da\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\n    MSG([[Akira’s shoulders slumped heavily.\r\nアキラがガックリと肩を落とす。]])\r\n\r\n    MSG([[Sorry. I feel more positive than usual, but that doesn’t mean the situation will immediately improve.\r\n申し訳ない。\r\n    　気持ちは普段より前向きなのだけれど、だからと言って状況がすぐに好転するワケもなくて。]])\r\n\r\n    MSG([[What to do from here is something I have to think about now.\r\nこの先どうするかは、今から考えるところだ。]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03fc\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_plus0014.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Wry Smile・Sweat \"Geez... No glamor here. But I get your resolve, Mina-chin. I’ll take the appropriate risks too.\"\r\n部屋着・苦笑・汗\r\n    「やれやれ……カッコがつきませんねえ。でもミナちんの覚悟は伝わりました、私も相応のリスクを負いましょう」]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_plus0015.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Normal \"Your pain from Daria probably hasn’t gone away yet, so please take a bit of rest. I’ll do everything I can.\"\r\n部屋着・通常\r\n    「まだダリアにやられた痛みが引いていないでしょうし、ちょっと休んでいてください。私も、自分ができることを全力でやってみます」]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[Saying that, Akira took a dusty notebook PC from the dresser and started typing with an intense expression.\r\nそう言うとアキラは、タンスの中から埃まみれのノートＰＣを取り出し、鬼気迫る表情でキーボードを打ち込み始める。]])\r\n\r\n    LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n    SWITCH_SCREEN(\"mask017\",1000,false)\r\n    WAIT_INPUT(1000)\r\n    LAYER_LOAD(LAYER_BG,\"BG023aa\")\r\n    SWITCH_SCREEN(\"mask017\",1000,false)\r\n\r\n    MSG([[A few hours later――\r\nそれから数時間後――]])\r\n\r\n    -- //BU：アキラ・部屋着（真剣）\r\n    LAYER_LOAD(50,\"BU_AKI03ba\")\r\n    LAYER_POSITION(50,0,-200)\r\n    LAYER_MOVE_POSITION(50,0,20,500,Ease.OutCubic)\r\n    SWITCH_SCREEN(\"mask000\",500,false)\r\n    LAYER_MOVE_POSITION(50,0,0,100,Ease.InSine)\r\n    WAIT(100)\r\n\r\nPLAY_VOICE(\"akira_1112.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Serious \"Destroy the Himegami family!\"\r\n部屋着・真剣\r\n    「姫神家を――ブッ壊す！」]])\r\n\r\n    MSG([[With a phrase that sounded like a political slogan, the strategy meeting for rescuing Almellia-san began.\r\n政党のスローガンにでもなりそうな一言と共に、アルメリアさん救出のための作戦会議が始まった。]])\r\n\r\n    MSG([[Akira’s eyes were more serious than ever. It was reassuring; she seemed to genuinely worry about Almellia-san as much as I did.\r\nいつになくアキラの目が真剣だ。\r\n    　ボクと同じくらい、アルメリアさんのことを本気で心配してくれているみたいで、安心する。]])\r\n\r\n    MSG([[I thought I couldn’t afford to lose either.\r\nボクも負けてられないな、と思った。]])\r\n\r\nPLAY_VOICE(\"akira_1113.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Serious \"I can’t forgive the Himegami family that took my closest friend Arurun. Let’s rescue her immediately.\"\r\n部屋着・真剣\r\n    「私の大親友、アルルンを奪った姫神家は許せません。今すぐに助け出しましょう」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ba\")\r\nPLAY_VOICE(\"minato_plus0012.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual・Serious \"Right. First, we need to find out something about the Himegami family...\"\r\n私服・真剣\r\n    「そうだね。そのためにはまず何とかして、姫神家について調べないと……」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_plus0016.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Normal \"Ah, don’t worry. I’ve already finished gathering the necessary info.\"\r\n部屋着・通常\r\n    「ああ、それならご安心を。必要な情報は既に調べ終わりました」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ga\")\r\nPLAY_VOICE(\"minato_plus0013.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual・Flustered \"W-What!? How did you do that!?\"\r\n私服・焦り\r\n    「ええ！？　ど、どうやって！？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Akira said something unbelievable like it was no big deal.\r\n何でもないことのようにとんでもないことを語るアキラ。]])\r\n\r\n    MSG([[It didn’t seem like a joke; she started explaining how she gathered the information.\r\nどうやら冗談ではないようで、情報を収集した手段について語り始める。]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_plus0017.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Smiling \"I peeked into the <r=アンダーグラウンド>dark</r> web. In short, it’s the deep web that normal people can’t access, where shady info is actively traded.\"\r\n部屋着・笑顔 「<r=アンダーグラウンド>暗闇</r>ＷＥＢを覗いたんですよ。まぁ一言で言えば、パンピーが覗けないネットワークの深層のことで、闇深い情報の取引が盛んなんです」]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ka\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_plus0018.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Grinning \"I bought some cheap 'rumors' about the Himegami family from someone who hates them. You’d be better off not making enemies, you know?\"\r\n部屋着・ニヤリ 「姫神家に恨みを持つ人物から、姫神家の“ウワサ”をお安く買えましたよ。他人から恨みなんて買わない方がいいですねえ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03da\")\r\nPLAY_VOICE(\"minato_plus0014.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual・Sadness \"Y-You bought it... Is that okay? Couldn’t you get dragged into a crime?\"\r\n私服・悲しみ\r\n    「か、買ったって……それは大丈夫なの？　犯罪に巻き込まれたりしない？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03fa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_plus0019.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Wry Smile・Sweat \"It’s a method to be used sparingly. I disguised my connection multiple times, and used untraceable PCs and accounts, so it should be safe.\"\r\n部屋着・苦笑・汗 「まぁ多用は避けるべき手段ですけどね。何重にも回線を偽装しましたし、足がつかないＰＣや口座を使用したので平気でしょう」]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03da\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_plus0020.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Sadness \"But digging through weird videos reminded me of my dark past, and the stress is through the roof... I never want to do that again.\"\r\n部屋着・悲しみ 「ただ、奇妙な動画を漁っていた頃の黒歴史を思い出してしまってストレスがマッハです……もう二度とごめんですよ」]])\r\n\r\n    MSG([[That sounded like the worst troubles she’s had so far. I decided not to ask any more deeply.\r\n何だかこれまででも最大級のヘコみ具合だ。\r\n    　深くは聞かないでおこう。]])\r\n\r\n    MSG([[Then Akira shared the info she bought on the dark web about the Himegami family.\r\nそれからアキラは、暗闇ＷＥＢで購入したという姫神家に関する情報をボクに教えてくれた。]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_plus0021.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Normal \"Their main residence is apparently very close to O-something, a place we also often go. It has some strange features and is well-known in the industry.\"\r\n部屋着・通常 「姫神家の本邸は何と、私たちもよく行くＯ須のすぐ近くにあるみたいです。ちょっと奇妙な特徴があって、業界内では有名だそうですよ」]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ba\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_plus0022.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Serious \"If Arurun was taken, it’s probably to that main residence. But there’s good info and bad info about sneaking in.\"\r\n部屋着・真剣\r\n    「アルルンが連れていかれたとしたら、恐らくその本邸に違いありません。ただ、忍び込むに当たって、いい情報と悪い情報があります」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ca\")\r\nPLAY_VOICE(\"minato_plus0015.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual・Surprised \"I-I’d like you to tell me the bad news first, if you don’t mind.\"\r\n私服・驚き\r\n    「そ、それなら、悪い情報から教えてもらっていいかな？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03da\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_plus0023.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Sadness \"When Nemesia isn’t at the mansion, a large number of guards are stationed with no gaps even for a bug to enter. The informant said they had a horrible time trying to force their way in.\"\r\n部屋着・悲しみ 「ネメシアが屋敷にいない時は大量の警備員が在中していて、虫一匹侵入する隙間がないそうです。情報の提供者も、強行突破しようとしてヒドい目に遭ったとか」]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ba\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_plus0024.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Serious \"Also, even if the gate looks open, you absolutely shouldn’t enter without disabling the electronic lock first... unless you want to become a diced steak.\"\r\n部屋着・真剣 「それと、一見門が開いているように見えても、電子ロックを外してからでないと絶対に入っちゃダメだそうですよ。……サイコロステーキにされたくなければ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ga\")\r\nPLAY_VOICE(\"minato_plus0016.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual・Flustered \"S-Scary, scary! What on earth would happen to us!?\"\r\n私服・焦り\r\n    「こ、コワいコワい！　一体何をされちゃうの！？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ba\")\r\nPLAY_VOICE(\"minato_plus0017.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual・Serious \"Still, guards and electronic locks... It won’t be so easy to sneak in, huh.\"\r\n私服・真剣\r\n    「それにしても、警備員と電子ロックか。やっぱり、一筋縄では潜入できなさそうだね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_plus0025.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Normal \"Actually, not quite. Whenever there’s a regular meeting with the 'Phoenix' group, which the Himegami family belongs to, Nemesia always returns to the mansion, and security gets thin.\"\r\n部屋着・通常 「いえ、実はそうでもないんです。姫神家が所属する『鳳凰』グループとの定例のミーティングの際は、必ずネメシアが屋敷に戻り、警備も手薄になるそうですよ」]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_plus0026.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Smiling \"Here’s the good news: if we can find out the date of that meeting, there’s a chance to sneak in.\"\r\n部屋着・笑顔\r\n    「こっちがいい情報。つまり、ミーティングの日付さえ把握しちゃえば、潜入の芽は残っているんです」]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03da\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_plus0027.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Sadness \"Well, of course, I couldn’t find out the date of the meeting though.\"\r\n部屋着・悲しみ\r\n    「まぁ流石に、ミーティングの日付まではわかりませんでしたけどねー」]])\r\n\r\n    MSG([[My heart raced with the unexpected information.\r\n思わぬ情報に胸が高鳴った。]])\r\n\r\n    MSG([[It’s strange that security only lightens while they’re at the mansion, but if that’s true, that’s the only chance.\r\n屋敷にいる間だけ警備が手薄になるなんて奇妙な話だけれど、これが事実なら、チャンスはこの時しかない。]])\r\n\r\n    MSG([[We absolutely have to figure out the meeting day and plan an infiltration!\r\n何としてもミーティングの日を調べ上げて、潜入の作戦を練らなきゃ！]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ea\")\r\nPLAY_VOICE(\"minato_plus0018.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual・Smile \"Thanks, as expected of Akira! This info is more than enough!\"\r\n私服・笑顔\r\n    「あ、ありがとう、流石アキラ！　十分過ぎるくらい有力な情報だよ！」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[Phoenix Group. I remembered Ouga-kun told me about it once during a chat.\r\n鳳凰グループ。\r\n    　いつかの雑談で、オウガくんに教えてもらった覚えがある。]])\r\n\r\n    MSG([[Currently, the domestic economy is centered around six corporate groups, and Ouga-kun’s Rokujou family belongs to the group called '<r=じゅうじょう>Jujou</r>'.\r\n今国内の経済は、６つの企業グループが中心になっていて、オウガくんたち六条家は『<r=じゅうじょう>十條</r>』と呼ばれるグループに所属しているそうだ。]])\r\n\r\n    MSG([[Among those six corporate groups, the largest one now is 'Phoenix'.\r\nそれら６つの企業グループの中でも、今最も巨大なグループが『鳳凰』。]])\r\n\r\n    MSG([[Led by the Hououin family and Byoudouin family, this group started from a newspaper company and holds immense influence over domestic entertainment from TV, movies to books.\r\n鳳凰院家、平等院家を中心に構成されるそのグループは新聞社を祖として、テレビから映画、書籍まで、国内のエンタメに絶大な影響力を誇っている。]])\r\n\r\n    MSG([[If the Himegami family is under their protection, there’s no way we ordinary citizens without any backing like us could resist.\r\n姫神家がその庇護下にいるとしたら、ボクたちのような何の後ろ盾もない一般市民じゃ抵抗しようがない。]])\r\n\r\n    MSG([[If there’s a way to resist, it would be to seek cooperation from classmates who also belong to one of the six major corporate groups like the Ryuguuin or Rokujou families.\r\n抵抗の術があるとしたら、同じく６大企業グループに属する龍宮院家や六条家――学友のみんなに協力を仰ぐことだけ。]])\r\n\r\n    MSG([[Realizing this, I couldn’t help but deny my own thoughts.\r\nそう思い至ったところで、ボクはたまらず自分の考えを否定する。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ga\")\r\nPLAY_VOICE(\"minato_plus0019.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual・Flustered (N-No, what am I thinking? This is my problem, and dragging everyone else into it—)\r\n私服・焦り\r\n    （だ、ダメだよ、何を考えているんだ。これはボクの問題なのに、みんなを巻き込むだなんて――）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(LAYER_BG,\"BG000ab\")\r\n    SWITCH_SCREEN(\"mask000\",1000,false)\r\n\r\n    -- //effect：セピア加工\r\n    FILTER_SCREEN(2)\r\n    -- //BG：1-A教室\r\n    -- //BU：ダリア（夏服・笑顔）\r\n    LAYER_LOAD(LAYER_BG,\"BG014aa\")\r\n    LAYER_LOAD(50,\"BU_DAR02ea\")\r\n    SWITCH_SCREEN(\"mask035\",1000,false)\r\n\r\nPLAY_VOICE(\"dahlia_0156.wav\")\r\n    MSG([[\r\n【Daria】\r\nSummer Uniform・Smile \"You should rely more on those around you, Erika-kun.\"\r\n夏服・笑顔\r\n    「もっと周りを頼りたまえよ、エリカくん」]])\r\n    -- //dahlia_0156.wav\r\n\r\n    MSG([[At that moment, an event from several months ago flashed through my mind.\r\nその時、数ヶ月前の出来事が頭によぎった。]])\r\n\r\n    MSG([[It was something Daria-san said to me when I was stuck during the Hakuyou Festival.\r\nそれは白陽祭で行き詰った時に、ダリアさんからかけられた言葉。]])\r\n\r\nPLAY_VOICE(\"dahlia_0157.wav\")\r\n    MSG([[\r\n【Daria】\r\nSummer Uniform・Smile \"Trying to get through such a big crisis alone was never realistic. You're not alone. If you carry everything alone, you will break.\"\r\n夏服・笑顔 「こんな大ピンチを一人で乗り切ろうなんて、そもそも無理があるのさ。キミは一人じゃない。一人で抱え込んでいたら潰れてしまうよ」]])\r\n    -- //dahlia_0157.wav\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    FILTER_SCREEN(0)\r\n    LAYER_LOAD(LAYER_BG,\"BG000ab\")\r\n    SWITCH_SCREEN(\"mask035\",1000,false)\r\n\r\n    -- //BG：アキラ宅\r\n    LAYER_LOAD(LAYER_BG,\"BG023aa\")\r\n    SWITCH_SCREEN(\"mask000\",1000,false)\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ba\")\r\n    MSG([[\r\n【Minato】\r\nCasual・Serious \"\"\r\n私服・真剣\r\n    「」]])\r\nLAYER_LOAD_FACE(\"\")\r\n    -- //ボイスなし・表情のみ\r\n\r\n    MSG([[I snapped awake to realize I was about to make the same mistake again.\r\nハッとして、自分がまた同じ失敗を繰り返しそうになっていることに気付いた。]])\r\n\r\n    MSG([[It’s ironic to be encouraged by the words of the person who took Almellia-san from me, but Daria-san’s words made perfect sense.\r\nボクからアルメリアさんを奪い去っていったヒトの言葉に励まされるなんて皮肉だけれど、ダリアさんの言葉は的を得ている。]])\r\n\r\n    MSG([[Now is not the time to cling to my own strength. No matter what, no matter whose help it is, I must think only about rescuing Almellia-san, no matter what.\r\n今はボク自身のチカラにこだわっている場合じゃない。 何が何でも、誰のチカラを借りてでも、なりふり構わずアルメリアさんを救うことだけを考えるべきだ。]])\r\n\r\n    MSG([[Besides, I believe the kindness Daria showed that time was genuine.\r\nそれに、あの時のダリアさんの優しさは偽りじゃないって、ボクは信じている。]])\r\n\r\n    MSG([[Because Daria-san is also one of the companions who has supported me, <r=エリカ>Hime</r> and us.\r\nだってダリアさんもまた、ボクと『<r=エリカ>姫</r>』、ボクたちを支えてくれた仲間の一人なのだから。]])\r\n\r\n    -- //BU：アキラ・部屋着（通常）\r\n    LAYER_LOAD(50,\"BU_AKI03aa\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ba\")\r\nPLAY_VOICE(\"minato_1348.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual・Serious \"To stand up to the Himegami family... I really have no choice but to ask everyone at Yuriai Private Academy for help.\"\r\n私服・真剣 「姫神家に対抗するには……やっぱり百合愛学園のみんなにも手伝ってもらう他ないね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ba\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ba\")\r\nPLAY_VOICE(\"akira_1115.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Serious \"Yes, of course, I’ll cooperate too. It’s time to pool all our strength to save Arurun!\"\r\n部屋着・真剣\r\n    「ええ、もちろん私も協力します。アルルンを救うために、総力を結集させる時ですよ！」]])\r\n\r\n    MSG([[Akira nodded strongly at my words.\r\nボクの言葉にアキラは強くうなずいてくれた。]])\r\n\r\n    MSG([[Although we just suffered a painful defeat, I didn’t feel bad at all. Rather, I felt courage unlike before.\r\n手痛い敗北を喫したばかりだけれど、気分は決して悪くない。\r\n    　むしろ、いつになく勇気が湧いてくる。]])\r\n\r\n    MSG([[It’s okay. I can still catch up.\r\n大丈夫だ。\r\n    　まだ、追いつける。]])\r\n\r\n    MSG([[I’ve always wanted to catch up to the back of Almellia-san.\r\nずっと追いつきたかった、アルメリアさんの背中に。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ba\")\r\nPLAY_VOICE(\"minato_PC0001_1.0.2.wav\")\r\n    MSG([[\r\n【Minato】\r\nCasual・Serious \"This time, I won’t lose. I will absolutely save Almellia-san.\"\r\n私服・真剣\r\n    「今度こそ、ボクは負けない。絶対にアルメリアさんを救ってみせるよ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_1114.wav\")\r\n    MSG([[\r\n【Akira】\r\nRoomwear・Smile \"That’s the spirit. Don’t lose to someone who pulls new moves like a last-second rock-paper-scissors!\"\r\n部屋着・笑顔\r\n    「その意気ですよ。新技を後出しじゃんけんみたいに使うヤツなんかに、負けないでくださいね！」]])\r\n\r\n    MSG([[And so, our battle to rescue Almellia-san began.\r\nこうしてアルメリアさんを救うための、ボクたちの戦いが始まりを告げるのであった。]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    -- 　　　　◆\r\nSTOP_BGM(1000)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"ERU_EP04_13\")\r\nend\r\n"
}