{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP04_18",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP04/ERI/EP04_18.lua",
  "Text": "function ERI_EP04_18()\r\n    --.転-4【12月第3週】「打倒・天才」\r\n    SaveData.Title = \"打倒・天才\"\r\n\r\n    --//BG：アキラ宅\r\n    LAYER_LOAD(LAYER_BG, \"BG023aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM03.wav\")\r\n\r\n    MSG([[The last weekend before the Princess Election. The night before the final training session with the Aikido instructor.\r\n姫選挙前の最後の週末。\r\n    　合気道の先生との最後の訓練を明日に控えた日の夜。]])\r\n\r\n    MSG([[When I got home from boys' division classes, unusually, Akira greeted me without playing games and handed me a file.\r\n男子部の授業から帰宅すると、珍しくアキラがゲームもせずに出迎えてくれて、ボクにファイルをひとつ手渡した。]])\r\n\r\n    --//BU：アキラ（通常）\r\n    LAYER_LOAD(50,\"BU_AKI03aa\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n\r\n--;吉★　テキスト修正「稽古の前」→「稽古前」（2020/02/01 19:59）\r\nPLAY_VOICE(\"akira_0654.wav\")\r\n    MSG([[\r\n【Akira】\r\nNormal, loungewear \"Here, this is material on bodyguard techniques. Please skim through it before tomorrow’s practice.\"\r\n通常・部屋着\r\n    「はい、側衛術とやらの資料です。明日の稽古前にささっと読んじゃってください」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ca\")\r\nPLAY_VOICE(\"minato_0699.wav\")\r\n    MSG([[\r\n【Minato】\r\nSurprised \"Eh!? Bodyguard techniques are that self-defense art Daria uses...? H-How on earth did you get this?\"\r\n驚き\r\n    「ええ！？　側衛術って、ダリアさんが使う護身術の…？　い、一体どうやって？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Bodyguard techniques are not a formal martial art with an established dojo, and much about them remains a mystery.\r\n側衛術は正式な道場がある武術ではなく、その実態は謎が多い。]])\r\n\r\n    MSG([[According to the internet, they are combat skills used by the special occupation of \"Imperial Palace Guards\" tasked with protecting the Emperor and the royal family—similar to an arresting technique I also use.\r\n天皇や皇族の守護を任とした特殊な職業『皇宮護衛官』が身につける戦闘技術で、ボクも使用する逮捕術の一種なのだと、ネットには書かれていた。]])\r\n\r\n    MSG([[But that was all I could find online. The occupation of \"Imperial Palace Guards\" is itself secretive, so no detailed information was available.\r\nでもネットに見つけられた情報はそれだけ。 そもそも『皇宮護衛官』という仕事自体の秘匿性もあって、その詳細は全然調べられなかった。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ca\")\r\nPLAY_VOICE(\"minato_0700.wav\")\r\n    MSG([[\r\n【Minato】\r\nSurprised \"There shouldn’t have been any info online, right...? How did you find out? Or did you have a fan with insider knowledge?\"\r\n驚き 「ネットを調べても情報は出てこなかったはずだよね……？　一体どうやって調べたの？　また、自分のファンから詳しいヒトがいたとか？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"akira_0655.wav\")\r\n    MSG([[\r\n【Akira】\r\nNormal, loungewear \"No way I could find anyone knowledgeable about Imperial Palace Guards.\"\r\n通常・部屋着\r\n    「皇宮護衛官に詳しいヒトなんて、流石に見つかりませんでしたよ」]])\r\n\r\nPLAY_VOICE(\"akira_0656.wav\")\r\n    MSG([[\r\n【Akira】\r\nNormal, loungewear \"I dug through theses and reference books at the university library. Since it’s such a mysterious occupation, there have been people investigating or even exposing its details in the past.\"\r\n通常・部屋着 「大学図書館で論文や参考書を漁ってきたんです。謎の多い職業だから、内情を調査するヒトや暴露するヒトも過去にはいたみたいでして」]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03da\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0657.wav\")\r\n    MSG([[\r\n【Akira】\r\nSad, loungewear \"Though the number of sources was limited, so it was tough, you know.\"\r\n悲しみ・部屋着\r\n    「まぁ数が限られるから苦労しましたけどね」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ca\")\r\nPLAY_VOICE(\"minato_0701.wav\")\r\n    MSG([[\r\n【Minato】\r\nSurprised \"A-Akira...? You went to the university library alone?\"\r\n驚き\r\n    「あ、アキラが……？　一人で大学図書館に？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ba\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0658.wav\")\r\n    MSG([[\r\n【Akira】\r\nSerious, loungewear \"...Is that the part you’re surprised about?\"\r\n真剣・部屋着\r\n    「……驚くところ、違いません？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ga\")\r\nPLAY_VOICE(\"minato_0702.wav\")\r\n    MSG([[\r\n【Minato】\r\nFlustered \"N-No! I-I’m sorry!\"\r\n焦り\r\n    「い、いや！　その！　ご、ごめんなさい」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[While apologizing profusely, I couldn’t hide my surprise. I couldn’t believe this was the same girl who hesitated even to attend the entrance ceremony this spring.\r\n平謝りしつつも、やっぱり驚きを隠せなかった。 今年の春には入学式さえ行くのを躊躇していた子とは思えない。]])\r\n\r\n    MSG([[Whether Akira realizes it or not, she has grown, just like me.\r\nアキラ自身が気付いているかどうかはわからないけれど、彼女もボクと同じで成長しているんだ。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01da\")\r\nPLAY_VOICE(\"minato_0703.wav\")\r\n    MSG([[\r\n【Minato】\r\nSad \"Were crowds okay...? Are you stressed out?\"\r\n悲しみ\r\n    「人混みは大丈夫だった……？　ストレス、溜まってない？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"akira_0659.wav\")\r\n    MSG([[\r\n【Akira】\r\nSerious, loungewear \"Mmm... Don’t treat me like a small animal, please.\"\r\n真剣・部屋着\r\n    「むうー……ヒトを小動物みたいに扱わないでください」]])\r\n\r\nPLAY_VOICE(\"akira_0660.wav\")\r\n    MSG([[\r\n【Akira】\r\nSerious, loungewear \"I’ve been going out more lately with you, Minachin, so I can handle some outings now.\"\r\n真剣・部屋着\r\n    「私だって、ミナちんに付き合って街に出る機会が増えたんですから、多少の外出は平気ですよ」]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03da\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0661.wav\")\r\n    MSG([[\r\n【Akira】\r\nSad, loungewear \"Though I did accumulate a ton of stress and ended up reversing my day-night cycle from playing too many games.\"\r\n悲しみ・部屋着\r\n    「まぁストレスは溜まりまくりで、ゲームし過ぎて昼夜逆転してしまいましたけどね」]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ka\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0662.wav\")\r\n    MSG([[\r\n【Akira】\r\nGrinning, loungewear \"But the effort was worth it. Take a look for yourself.\"\r\nニヤリ・部屋着\r\n    「ただ苦労した甲斐はありましたよ。ぜひご覧あれ」]])\r\n\r\n    MSG([[Following Akira’s recommendation, I opened the file and skimmed the contents.\r\nアキラに勧められるまま資料を開いて、内容を流し読みする。]])\r\n\r\n    MSG([[It was full of detailed information, not only about bodyguard techniques but also about the occupation of \"bodyguards\" who use these techniques, and the roles required for that job.\r\nその内容は側衛術のことはもちろん、側衛術を扱う『側衛官』と呼ばれる職業のことから、その職に求められる仕事の内容まで、詳細がびっしり。]])\r\n\r\n    MSG([[Especially eye-opening was the page comparing bodyguard techniques with arrest techniques and explaining their differences.\r\n特に、逮捕術と比較し、その違いを解説したページは目から鱗だった。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ca\")\r\nPLAY_VOICE(\"minato_0704.wav\")\r\n    MSG([[\r\n【Minato】\r\nSurprised \"The difference between bodyguard and arrest techniques is like yin and yang. Arrest techniques aim to subdue, whereas bodyguard techniques aim to protect, so their fundamental purposes differ.\"\r\n驚き 「側衛術と逮捕術の違いは、言うならば静と動。制圧を目的とする逮捕術と、護衛を目的とする側衛術は、その目的が根本から違う、か」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0663.wav\")\r\n    MSG([[\r\n【Akira】\r\nNormal, loungewear \"That’s the key. I heard Daria has had these techniques applied to her a few times, but I don’t think she ever applied them first.\"\r\n通常・部屋着 「そこが肝でしょうね。ダリアに何度か技をかけたことがあるらしいですけど、彼女から先に技をかけられたことはなかったんじゃないですか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ba\")\r\nPLAY_VOICE(\"minato_0705.wav\")\r\n    MSG([[\r\n【Minato】\r\nSerious \"Y-Yeah! Exactly that!\"\r\n真剣\r\n    「う、うん！　確かにその通りだよ！」]])\r\n\r\nPLAY_VOICE(\"minato_0706.wav\")\r\n    MSG([[\r\n【Minato】\r\nSerious \"Daria always responded by facing my attacks. I don’t think she was the first to strike.\"\r\n真剣\r\n    「ダリアさんはいつだって、ボクの攻撃に対して迎え撃っていた。彼女から先に攻めてくることはなかったと思う」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"akira_0664.wav\")\r\n    MSG([[\r\n【Akira】\r\nNormal, loungewear \"By the way, the file included this phrase.\"\r\n通常・部屋着\r\n    「そう言えば、資料にこんな言葉がありましたね」]])\r\n\r\nPLAY_VOICE(\"akira_0665.wav\")\r\n    MSG([[\r\n【Akira】\r\nNormal, loungewear \"‘Bodyguard techniques are protective ones. And what supports those techniques is the ability to read ahead from the opponent’s eyes and hands,’ or something like that.\"\r\n通常・部屋着 「『側衛術は護りの技。そしてその技を支えるのは、相手の目と手から先を読むチカラだ』とか何とか」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ba\")\r\nPLAY_VOICE(\"minato_0707.wav\")\r\n    MSG([[\r\n【Minato】\r\nSerious \"Read ahead from the opponent’s eyes and hands...?\"\r\n真剣\r\n    「目と手から、先を……？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[In martial arts, there are terms like “Sen-no-sen” (prior initiative), “Tai-no-sen” (simultaneous initiative), and “Go-no-sen” (reactive initiative).\r\n武道には「先の先」「対の先」「後の先」と呼ばれる言葉がある。]])\r\n\r\n    MSG([[Techniques that counterattack and neutralize an opponent’s attack are “Go-no-sen.” Those that respond simultaneously and neutralize the attack are “Tai-no-sen.”\r\n相手が繰り出した技に対して反撃し、無力化する技は「後の先」。 相手の技に対して同時に対応し、無力化する技は「対の先」。]])\r\n\r\n    MSG([[The ultimate skill that reads the opponent's technique and preemptively defeats it is called “Sen-no-sen.”\r\nそして相手の技を読み、事前にその技を潰す究極の技を「先の先」と呼ぶ。]])\r\n\r\n    MSG([[So, bodyguard techniques might involve reading the next move from the opponent’s eyes and hands to respond using “Sen-no-sen.”\r\nつまり側衛術では、相手の目と手の動きから次の行動を読むことで、「先の先」で対応していくのかもしれない。]])\r\n\r\n    MSG([[If that’s true, it explains why my techniques never connected.\r\nもしそうだとすれば、ボクの技がまったく通じないことにも納得がいった。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ca\")\r\nPLAY_VOICE(\"minato_0708.wav\")\r\n    MSG([[\r\n【Minato】\r\nSurprised \"Throws can easily be avoided depending on the opponent’s posture and center of gravity. If my moves were being read, it’s no surprise they were dodged.\"\r\n驚き 「投げ技は相手の姿勢や重心によって、簡単に外されてしまう。 もしボクの技が読まれていたなら、外されて当然だ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ea\")\r\nPLAY_VOICE(\"minato_0709.wav\")\r\n    MSG([[\r\n【Minato】\r\nSmiling \"Now I finally understand the logic! Thanks, Akira!\"\r\n笑顔\r\n    「ようやく理屈がわかったよ！　ありがとう、アキラ！」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0666.wav\")\r\n    MSG([[\r\n【Akira】\r\nSmiling, loungewear \"Honestly, it was all gibberish to me too, so I just copied and pasted everything. But I’m glad it helped.\"\r\n笑顔・部屋着\r\n    「正直、私が読んでもチンプンカンプンだったから丸コピペしたんですけど、参考になったならよかったです」]])\r\n\r\n    MSG([[Akira said happily, then collapsed onto the sofa looking exhausted.\r\nアキラが嬉しそうに言って、気が抜けたようにソファへ座り込んだ。]])\r\n\r\n    MSG([[The living room PC was still on, showing she had likely worked through the night.\r\nリビングのＰＣが起動しっぱなしなことからも、徹夜で作業してくれていたことがよくわかる。]])\r\n\r\n    MSG([[Of course, it was the information—but more than that, her kindness in pushing herself for me was what made me happiest.\r\n情報はもちろんだけど、ボクのために無理をしてくれるその優しさが、何よりも嬉しかった。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ja\")\r\nPLAY_VOICE(\"minato_0710.wav\")\r\n    MSG([[\r\n【Minato】\r\nTearful smile \"Thank you so much, Akira. I tried hard for these two weeks but it wasn’t going well at all, and I was about to give up.\"\r\n泣き笑い 「本当にありがとう、アキラ。この二週間がんばってみたけど、全然上手くいかなくて、諦めかけてたんだ」]])\r\n\r\nPLAY_VOICE(\"minato_0711.wav\")\r\n    MSG([[\r\n【Minato】\r\nTearful smile \"It’s something that anyone with talent would understand immediately... I feel pathetic for having none.\"\r\n泣き笑い\r\n    「センスがあるヒトならすぐにわかっちゃう簡単なことなのに……才能のない自分が情けなくなるよ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ka\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0667.wav\")\r\n    MSG([[\r\n【Akira】\r\nGrinning, loungewear \"Being mediocre is perfectly fine.\"\r\nニヤリ・部屋着\r\n    「凡人上等じゃないですか」]])\r\n\r\n    MSG([[While I was down on myself, Akira laughed in her usual tone.\r\n自分の不甲斐なさに落ち込むボクを、アキラはいつもの調子で笑う。]])\r\n\r\nPLAY_VOICE(\"akira_0668.wav\")\r\n    MSG([[\r\n【Akira】\r\nGrinning, loungewear \"The ‘Bokuhime PROJECT’ Minachin and I started aimed to beat girls’ innate cuteness with the power of dressing up we acquired later.\"\r\nニヤリ・部屋着 「私とミナちんの二人で始めた『ボク姫ＰＲＯＪＥＣＴ』は、女の子の先天的な可愛さに、後天的に得た女装の可愛さで勝つことが目標でした」]])\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03eb\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0669.wav\")\r\n    MSG([[\r\n【Akira】\r\nSmiling, loungewear \"In other words, it’s a plan to challenge talent with effort. We’ve always been on the mediocre side.\"\r\n笑顔・部屋着\r\n    「それはいわば才能に努力で挑む計画。私たちはいつだって凡人側だったんですよ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01fc\")\r\nPLAY_VOICE(\"minato_0712.wav\")\r\n    MSG([[\r\n【Minato】\r\nWry smile \"Akira’s right.\"\r\n苦笑\r\n    「アキラの、言う通りだね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Whether when I struggled to fit in at school. Or when competing with Lira for the title of 'Princess.' Or when clashing with Uran.\r\n学園に馴染むために努力した時も。 リラさんと『姫』の座を争った時も。 ウランさんと対立をしてしまった時も。]])\r\n\r\n    MSG([[I have always struggled desperately to acquire what I lacked.\r\nボクはいつだって、自分に足りないチカラを必死に身につけようと足掻いてきた。]])\r\n\r\n    MSG([[There wasn’t a single ability I was born with.\r\nボクに初めから身についていたチカラなんて、ひとつだってなかったんだ。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ba\")\r\nPLAY_VOICE(\"minato_0713.wav\")\r\n    MSG([[\r\n【Minato】\r\nSerious \"If the opponent reads our moves from our eyes and hands, then I just have to devise countermeasures.\"\r\n真剣\r\n    「相手が目と手の動きでコチラの行動を読むとわかったなら、あとは対策を練るだけだ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ea\")\r\nPLAY_VOICE(\"minato_0714.wav\")\r\n    MSG([[\r\n【Minato】\r\nSmiling \"I’ll fight dirty like a mediocre person. I know well from past Princess Elections that effort can overcome lack of talent.\"\r\n笑顔\r\n    「凡人らしく泥臭く戦うよ。才能がなくても努力で何とかなることは、これまでの姫選挙でよく知ってるからね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_AKI03ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"akira_0670.wav\")\r\n    MSG([[\r\n【Akira】\r\nSmiling, loungewear \"That’s the spirit. This might be our last Princess Election, so let’s give it our all.\"\r\n笑顔・部屋着\r\n    「その意気ですよ。これが最後の姫選挙になるかもしれないんですから、全力で挑みましょうね」]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[Then Akira and I talked about countermeasures against bodyguard techniques late into the night.\r\nそれからアキラと二人で、夜中まで側衛術対策を話し合い続けた。]])\r\n\r\nSTOP_BGM(1000)\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\",1000,false)\r\n\r\n    MSG([[And during practice the next day—\r\nそして次の日の稽古では――]])\r\n\r\n    --//CG：武術の修行（投げ）\r\n    LAYER_LOAD(LAYER_BG, \"EV022ad\")\r\n    SWITCH_SCREEN(\"mask032\" , 300,false)\r\n\r\nPLAY_BGM(\"BGM02.wav\")\r\n\r\nPLAY_VOICE(\"erika_1154.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Seiyaaah!!!\"\r\n「せやぁぁッッ！！！」]])\r\n\r\nPLAY_VOICE(\"aikidoist_0009.wav\")\r\n    MSG([[\r\n【Aikido instructor】\r\n \"Na—\"\r\n「な――」]])\r\n\r\n    --//SE：畳に叩きつけられる音（ﾀﾞｧﾝｯ！）\r\nPLAY_SE(\"SEc026.wav\")\r\nWAIT(300)\r\n\r\n    MSG([[For the first time, I successfully threw the instructor. At that moment, everyone watching cheered all at once.\r\n初めて、先生に投げ技が成功。\r\n    　その瞬間、見守っていたみんなが一斉に歓声をあげた。]])\r\n\r\nPLAY_VOICE(\"lira_0511.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"You did it!!\"\r\n「やったじゃん！！」]])\r\n\r\nPLAY_VOICE(\"uran_0338.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"It was a perfect throw!\"\r\n「完璧な一本でございましたわ！」]])\r\n\r\nPLAY_VOICE(\"hiyu_0320.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n \"Erika-onee-sama really is amazing!\"\r\n「エリカお姉さまはやっぱりスゴいんですー！」]])\r\n\r\nPLAY_VOICE(\"aikidoist_0010.wav\")\r\n    MSG([[\r\n【Aikido instructor】\r\n \"That was a marvelous throw. Who would’ve thought to counter Aiki techniques with such a strategy... I was completely outsmarted.\"\r\n「素晴らしい投げだったよ。まさか、合気の技にあのような作戦で対抗するとは……完全にしてやられた」]])\r\n\r\n    MSG([[The instructor lay on the floor on his back, smiling contentedly and praising me.\r\n先生が床に仰向けに倒れたまま満足げに笑い、ボクを称賛してくれた。]])\r\n\r\nPLAY_VOICE(\"aikidoist_0011.wav\")\r\n    MSG([[\r\n【Aikido instructor】\r\n \"I take back that you have no sense. You have excellent fighting sense.\"\r\n「センスがないという発言は撤回しよう。キミは素晴らしい格闘センスの持ち主だよ」]])\r\n\r\nPLAY_VOICE(\"erika_1155.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"No. It’s true that I have no sense.\"\r\n「いいえ。私にセンスがないのは事実ですよ」]])\r\n\r\n    MSG([[It was not my strength alone that allowed me to throw the instructor so cleanly today.\r\nそう、今日先生をキレイに投げ飛ばすことができたのは、ボク一人のチカラじゃない。]])\r\n\r\n    MSG([[It was thanks to my reliable partner researching information and working through the problems with me.\r\n頼れるボクのパートナーが情報を調べあげ、一緒にアタマを悩ませてくれたおかげだ。]])\r\n\r\nPLAY_VOICE(\"erika_1156.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"I’ll prove with this technique that even a mediocre person without talent can defeat a genius by effort.\"\r\n「この技で証明してみせます。センスがない凡人でも、努力で天才に勝てるんだって」]])\r\n\r\n    LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\",1000,false)\r\n\r\n    MSG([[And finally, the day of the Princess Election arrived—\r\nそしてとうとう、姫選挙当日を迎えることになった――]])\r\n    --　　　　◆\r\nSTOP_BGM(1000)\r\n    --LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"ERI_EP04_19\")\r\nend\r\n"
}