{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP04_11",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP04/ERI/EP04_11.lua",
  "Text": "function ERI_EP04_11()\r\n    --.承-2【11月第3週】「本心」\r\n    SaveData.Title = \"本心\"\r\n\r\n    --//BG：アキラ宅\r\n    LAYER_LOAD(LAYER_BG, \"BG023aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM08.wav\")\r\n\r\n    MSG([[After returning home from Marika-neesan’s hospital room, I was ordered by Akira to sleep beside her.\r\nマリカ姉さんの病室から自宅に戻った後、ボクはアキラに添い寝を命じられた。]])\r\n\r\n    --//CG：アキラとの添い寝（笑顔）\r\n    LAYER_LOAD(LAYER_BG, \"EV048aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_VOICE(\"minato_0662.wav\")\r\n    MSG([[\r\n【Minato】\r\n “A-Are we really going to sleep...? This is embarrassing, so can you please spare me...?”\r\n「ほ、本当に寝るの……？　恥ずかしいから、勘弁してもらえないかな……？」]])\r\n\r\nPLAY_VOICE(\"akira_0616.wav\")\r\n    MSG([[\r\n【Akira】\r\n “No, you’re not allowed.”\r\n「ダメです、許しません」]])\r\n\r\nPLAY_VOICE(\"akira_0617.wav\")\r\n    MSG([[\r\n【Akira】\r\n “Right now, Minachin might end up going back to Mariccho’s hospital room again if left alone. So, as a form of supervision, I want you to sleep next to me.”\r\n「今のミナちんは、放っておくとまたマリっちょの病室に戻りかねませんからね。監視の意味でも、私の隣で寝てもらいます」]])\r\n\r\n    MSG([[It was sad that I couldn’t argue. Actually, going to the hospital room earlier was a semi-unconscious act.\r\n反論できないのが悲しい。\r\n    　実際、さっき病室に行ったのは半ば無意識の行動だった。]])\r\n\r\n    MSG([[Given today’s me, it’s no wonder they call me the Siscon Great Demon King.\r\n今日のボクでは、シスコン大魔王と言われても、致し方なしだ。]])\r\n\r\n    --//CG：アキラとの添い寝（ニヤリ）\r\n    LAYER_LOAD(LAYER_BG, \"EV048ab\")\r\n    SWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\nPLAY_VOICE(\"akira_0618.wav\")\r\n    MSG([[\r\n【Akira】\r\n “Do you understand? Siscon Supreme Demon King.”\r\n「わかりましたか？　シスコン超魔王」]])\r\n\r\nPLAY_VOICE(\"minato_0663.wav\")\r\n    MSG([[\r\n【Minato】\r\n “...Yes.”\r\n「……はい」]])\r\n\r\n    MSG([[Bewildered that I had been upgraded from Great Demon King to Supreme Demon King, I replied weakly.\r\n大魔王から超魔王にランクアップしていたことに戸惑いつつも、力なく返事をした。]])\r\n\r\nPLAY_VOICE(\"akira_0619.wav\")\r\n    MSG([[\r\n【Akira】\r\n “Besides, it’s not like it’s the first time we’re sleeping together, right? So what’s there to be embarrassed about now?”\r\n「そもそも、別に初めて一緒に寝るワケじゃないからいいでしょう？ 今更何を恥ずかしがってるんですか」]])\r\n\r\nPLAY_VOICE(\"minato_0664.wav\")\r\n    MSG([[\r\n【Minato】\r\n “W-Well, that’s true, but...”\r\n「い、いや、そうなんだけどね」]])\r\n\r\n    MSG([[Huh? I really wonder why I’m so conscious about this? I should’ve gotten somewhat used to sleeping beside Akira by now... Strange.\r\nアレ？　確かに、何でこんなに意識してしまっているんだろう？\r\n    　アキラと添い寝することには幾分か慣れてきたはずなのに……おかしいな。]])\r\n\r\n    MSG([[Today, for some reason, my heart is pounding unusually hard. Maybe it’s because I’m mentally shaken by what happened with Daria-san.\r\n今日は何だか、やけに胸がドキドキする。\r\n    　ダリアさんとの一件で、精神的に弱っている、ということかな。]])\r\n\r\nPLAY_VOICE(\"akira_0620.wav\")\r\n    MSG([[\r\n【Akira】\r\n “You’ve gotten a lot better, but Minachin is still stuck on the ‘Sister is supreme’ ideology.”\r\n「まぁだいぶマシになりましたが、ミナちんはまだまだ姉さん至上主義から抜けきれていませんからね」]])\r\n\r\n    --//CG：アキラとの添い寝（笑顔）\r\n    LAYER_LOAD(LAYER_BG, \"EV048aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\nPLAY_VOICE(\"akira_0621.wav\")\r\n    MSG([[\r\n【Akira】\r\n “Until you awaken to my love as your cousin, I’m prepared to keep sleeping beside you as many times as needed.”\r\n「従妹である私への愛にも目覚めてくれるまで、何度でも添い寝を続ける所存です」]])\r\n\r\nPLAY_VOICE(\"minato_0665.wav\")\r\n    MSG([[\r\n【Minato】\r\n “I think I’ve already awakened enough, though.”\r\n「十分目覚めてると思うけどなぁ」]])\r\n\r\nPLAY_VOICE(\"akira_0622.wav\")\r\n    MSG([[\r\n【Akira】\r\n “No way! Not nearly enough! You have to depend on me so much that when you leave by my side, you’d babble things like ‘itchy uma’ in broken words like a lost soul.”\r\n「いーやっ、まだまだですっ。私のそばを離れると『かゆい　うま』みたいな片言を話す亡者になってしまうくらい依存してもらわないと」]])\r\n\r\nPLAY_VOICE(\"minato_0666.wav\")\r\n    MSG([[\r\n【Minato】\r\n “Th-That sounds worse than being a siscon! Are you okay?”\r\n「そ、それシスコン状態より悪化してない？　大丈夫？」]])\r\n\r\nPLAY_VOICE(\"akira_0623.wav\")\r\n    MSG([[\r\n【Akira】\r\n “Being an ‘ito-con’ is better than a siscon. Legally in Japan, you can marry the target of an ito-con, after all.”\r\n「シスコンよりはイトコンの方がマシでしょう。日本の法律上、結婚できる相手が対象なワケですし」]])\r\n\r\nPLAY_VOICE(\"minato_0667.wav\")\r\n    MSG([[\r\n【Minato】\r\n “Ito-con? That’s short for cousin complex? I’ve never heard such a weird pun like shirataki noodles before...”\r\n「イトコンって、まさかいとこ・コンプレックスの略？　そんな糸こんにゃくみたいな略し方、初めて聞いたんだけど……」]])\r\n\r\n    MSG([[It felt like I had just been down in the dumps earlier. Talking with Akira naturally lifted my spirits, and before I knew it, we were back to our usual teasing.\r\nさっきまで落ち込んでいたのがウソみたいに。 アキラと話していると、自然と元気が出て、普段通りじゃれ合ってしまう。]])\r\n\r\n    MSG([[Surely, this was all thanks to Akira caring about me.\r\nきっと、これはアキラがボクを気遣ってくれているおかげだ。]])\r\n\r\n    MSG([[Today, facing a painful truth I couldn’t bear alone made me realize just how much she supports me.\r\n今日、自分一人では耐えきれないほど辛い現実に対面したことで改めて、自分がどれだけ彼女に支えられているかを実感できた。]])\r\n\r\nPLAY_VOICE(\"minato_0668.wav\")\r\n    MSG([[\r\n【Minato】\r\n “...Thank you so much today, Akira.”\r\n「……今日は本当にありがとう、アキラ」]])\r\n\r\nPLAY_VOICE(\"minato_0669.wav\")\r\n    MSG([[\r\n【Minato】\r\n “I think I might understand a little of how Marika-neesan felt, enduring everything alone without telling anyone.”\r\n「一人で誰にも言わず耐えていたマリカ姉さんの気持ちが、少しわかったかもしれない」]])\r\n\r\nPLAY_VOICE(\"minato_0670.wav\")\r\n    MSG([[\r\n【Minato】\r\n “When you’re really suffering, your desire to lean on someone and not wanting to be a burden... both feelings just get all mixed up inside your chest.”\r\n「本当にツラい時って、頼りたい気持ちと、迷惑をかけたくない気持ち……ふたつの気持ちが胸の中で、わからなくなるんだね」]])\r\n\r\nPLAY_VOICE(\"minato_0671.wav\")\r\n    MSG([[\r\n【Minato】\r\n “When I think that if you hadn’t been here, I might never have recovered... it sends chills down my spine.”\r\n「もしアキラがいてくれなかったら、ボクは立ち直れなかったかもしれないって思うと……ゾッとするよ」]])\r\n\r\n    MSG([[For me, Akira truly understands my genuine self, but did Marika-neesan have anyone like that? No, surely she didn’t.\r\nボクには、素の自分をわかってくれているアキラがいてくれたけど、マリカ姉さんにそのような相手がいただろうか。\r\n    　いや、きっといないと思う。]])\r\n\r\n    MSG([[Marika-neesan hadn’t even shown weakness to me, her own family. She must have continued to act as the perfect beautiful girl even at Yuriai Private Academy.\r\nマリカ姉さんは身内のボクにだって、弱みを見せたことがなかった。 きっと百合愛学園でも、完璧な美少女として振る舞い続けたに違いない。]])\r\n\r\n    MSG([[Even if she had to face off one-on-one against the national idol Hermes-san, her stance wouldn’t have wavered.\r\nたとえ、国民的アイドルのエルメスさんと一対一で対決することになったとしても、そのスタンスは揺るぎなかったはずだ。]])\r\n\r\n    MSG([[That’s precisely why she...\r\nだからこそ、彼女は……。]])\r\n\r\nPLAY_VOICE(\"akira_0624.wav\")\r\n    MSG([[\r\n【Akira】\r\n “Mina, chin...”\r\n「ミナ、ちん……」]])\r\n\r\nPLAY_VOICE(\"minato_0672.wav\")\r\n    MSG([[\r\n【Minato】\r\n “Akira...?”\r\n「アキラ……？」]])\r\n\r\n    --//CG：アキラとの添い寝（ぐっすり）\r\n    LAYER_LOAD(LAYER_BG, \"EV048ac\")\r\n    SWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\n    MSG([[Glancing at Akira, I saw she was breathing softly in sleep. It seemed she had fallen asleep while I was lost in thought alone.\r\nふとアキラを見ると、スヤスヤと寝息を立てていた。\r\n    　どうやらボクが一人で考え事をしている間に、眠ってしまっていたらしい。]])\r\n\r\n    MSG([[I heard she pushed herself hard to find me, so even if she didn’t show it, she must’ve been exhausted.\r\nボクを探すために随分と無理をしてくれたそうだから、きっと顔に出さなかっただけで、疲れが溜まってたんだと思う。]])\r\n\r\nPLAY_VOICE(\"minato_0673.wav\")\r\n    MSG([[\r\n【Minato】\r\n “Good night, Akira. Tomorrow, I’ll make lots of your favorite dishes.”\r\n「おやすみ、アキラ。明日はアキラの好きな料理を、たくさん作るからね」]])\r\n\r\n    MSG([[I gently touched Akira’s cheek as she slept and whispered so as not to wake her. Then, Akira’s small hand touched mine.\r\n眠るアキラの頬にそっと触れて、起こさないように囁いた。\r\n    　するとボクの手に、アキラの小さな手が触れた。]])\r\n\r\nPLAY_VOICE(\"akira_0625.wav\")\r\n    MSG([[\r\n【Akira】\r\n “Minachin... I love you.”\r\n「ミナちん……大好き、ですよ」]])\r\n\r\n    MSG([[Her confession-like sleep-talk made my heart skip. Surely even in her dreams, she was teasing me like usual.\r\n告白のような寝言にドキリとした。\r\n    　夢の中でも、いつもみたいに、ボクをからかっているに違いない。]])\r\n\r\nPLAY_VOICE(\"minato_0674.wav\")\r\n    MSG([[\r\n【Minato】\r\n (Even though Akira's my cousin, she makes my heart race. I have to pull myself together as a man.)\r\n（アキラは従妹なのに、ドキドキしちゃうなんて。男として、もっとしっかりしなくちゃ）]])\r\n\r\n    MSG([[I should be used to this kind of mischief, but today my face feels unusually hot.\r\nこんなイタズラ、慣れきっているはずだけど、今日は何だかやたらと顔が熱くなる。]])\r\n\r\n    MSG([[I still have a long way to go. Calm down. Calm down.\r\nまだまだ修行が足りないな。\r\n    　平常心。平常心。]])\r\n\r\nPLAY_VOICE(\"akira_0626.wav\")\r\n    MSG([[\r\n【Akira】\r\n “I want... you to stay by my side forever.”\r\n「ずっと、そばに……いて、欲しいんです」]])\r\n\r\nPLAY_VOICE(\"minato_0675.wav\")\r\n    MSG([[\r\n【Minato】\r\n “I love you too, Akira. I’ll be by your side forever, always.”\r\n「ボクも、アキラが大好きだよ。ずっと、ずうっとアキラのそばにいるからね」]])\r\n\r\n    MSG([[Still holding Akira’s hand, I closed my eyes.\r\nアキラと手を触れ合ったまま、ボクは目を閉じた。]])\r\n\r\n    MSG([[Hoping that even in my dreams, I could be together with this cute cousin.\r\n夢の中でも、このカワイイ従妹と一緒にいられることを、願いながら。]])\r\n    --　　　　◆\r\nSTOP_BGM(1000)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"ERI_EP04_12\")\r\nend\r\n"
}