{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP04_17",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP04/ERI/EP04_17.lua",
  "Text": "function ERI_EP04_17()\r\n    --.転-3【12月第2週】「センスの壁」\r\n    SaveData.Title = \"センスの壁\"\r\n\r\n    --//BG:1-A教室（夕方）\r\n    LAYER_LOAD(LAYER_BG, \"BG014ba\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM02.wav\")\r\n\r\n    MSG([[When it was less than two weeks until the Princess Election with Daria-san, we finally received confirmation of the appeal theme.\r\nダリアさんとの姫選挙の開催まで二週間を切った頃、遂にアピールテーマの確定の情報が届いた。]])\r\n    --//BU：ヒユ（焦り）、リラ（真剣）、ウラン（悲しみ）\r\n    LAYER_LOAD(50,\"BU_HIY01ga\")\r\n    LAYER_LOAD(55,\"BU_RIR07ba\")\r\n    LAYER_LOAD(60,\"BU_RYU01da\")\r\n    LAYER_POSITION(50,-600,0)\r\n    LAYER_POSITION(60,600,0)\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"lira_0508.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"So the theme is 'martial arts,' huh. No wonder the enemy seems so confident.\"\r\n「やっぱりテーマは『武道』か。どうりで敵さんは余裕なワケだよ」]])\r\n\r\nPLAY_VOICE(\"hiyu_0318.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n \"I-if the theme is 'martial arts,' that means two people grapple together, right...? Like how Erika Onee-sama always practices after school?\"\r\n「ぶ、『武道』がテーマの場合って、二人で組み合うんですよね……？　今エリカお姉さまが放課後にいつも練習しているみたいに」]])\r\n\r\nPLAY_VOICE(\"uran_0335.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Yes, striking techniques are forbidden. Within the scope of a maiden’s refinement, it will be about graceful techniques to protect oneself.\"\r\n「ええ、打撃技などは禁止。乙女の嗜みの範疇として、己の身を守る華麗な技術を問われることになります」]])\r\n\r\nPLAY_VOICE(\"uran_0336.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Even if the rules don't prohibit it, rough behavior on that stage is not encouraged. After all, it is a contest of beauty.\"\r\n「取り決めでは禁止されずとも、あの舞台上で乱暴な振る舞いを行うことは推奨されません。あくまで、美しさを競う場ですから」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ba\")\r\nPLAY_VOICE(\"erika_1146.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"For someone like me who’s good at kicking techniques... it’s a disadvantageous rule.\"\r\n「蹴り技が得意な私には……不利なルールですね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[It was something I'd been taught before, but having it pointed out again made the rule seem even harsher.\r\n以前から教えられていたことだけれど、改めて突きつけられると厳しいルールだ。]])\r\n\r\n    MSG([[Only chokeholds and throws are allowed. Using familiar tools, which the Ikusa-style arrest techniques specialize in, would surely be discouraged.\r\n許されるのは絞め技や投げ技のみ。 伊草流逮捕術が得意とする、身近な道具を使っての拘束も推奨されないはずだ。]])\r\n\r\n    MSG([[It would ultimately be about pure skill level and the beauty of the techniques.\r\n純粋な技術の高さと、その美しさを問われることになるだろう。]])\r\n\r\n    MSG([[And speaking of that, there was no doubt Daria-san was many steps ahead of me.\r\nそしてその点で言えば、ダリアさんの方が何枚も上手であることは間違いなかった。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ba\")\r\nPLAY_VOICE(\"erika_1147.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"If there’s any point I can exploit, it’s that Daria-san hasn’t taken any action at all yet.\"\r\n「私につけ込める点があるとすれば、ダリアさんが今、何も行動を起こしていないという点のみです」]])\r\n\r\nPLAY_VOICE(\"erika_1148.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"I will keep training as I am and absolutely outmaneuver Daria-san on the day of the event.\"\r\n「今の訓練を続けて、絶対に当日はダリアさんを出し抜いてみせますよ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(55,\"BU_RIR07fa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"lira_0509.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"Y-yeah, I’m rooting for you, though.\"\r\n「う、うん、応援してるけど」]])\r\n\r\n    MSG([[At my words, Lira and the others showed an unusual, subtle reaction.\r\nボクの言葉にリラさんたちは珍しく微妙な反応をした。]])\r\n\r\n    LAYER_LOAD(55,\"BU_RIR07da\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"lira_0510.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"Don’t push yourself too hard. Lately, you’re trying so much, it worries me.\"\r\n「あまり根を詰め過ぎないようにね。最近のアンタ、がんばり過ぎで心配だからさ」]])\r\n\r\nPLAY_VOICE(\"uran_0337.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Please tell us if there’s anything we can do. We are allies of Erika-san, after all.\"\r\n「わたくしたちにできることは何でも言ってくださいましね。わたくしたちはエリカさんの仲間なのですから」]])\r\n\r\n    LAYER_LOAD(50,\"BU_HIY01da\")\r\n    LAYER_POSITION(50,-600,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"hiyu_0319.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n \"You’ve been training late every day recently, so I’m worried you might collapse again!\"\r\n「最近いつも遅くまで訓練されてるから、また倒れてしまうんじゃないかって心配なんですー！」]])\r\n\r\n    MSG([[The kindness of everyone who worried about me, like Akira did the other day, truly touched my heart.\r\n先日のアキラのように心配をしてくれる皆さんの優しさが、心に沁みる。]])\r\n\r\n    MSG([[I felt guilty for causing such worry. But of course, there was no way I could say I was planning to confess my lie to everyone if I won the Princess Election against Daria-san.\r\n心配をかけてしまって心苦しい。 でもまさか、ダリアさんとの姫選挙に勝ったら皆さんにウソを告白しようと思っていますだなんて、言えるワケがない。]])\r\n\r\n    MSG([[This was a problem I had to face alone. Until the day I can confess, I would keep my words of apology to myself.\r\nこれはボクの向き合わないといけない問題なんだ。\r\n    　告白できるその日まで、謝罪の言葉はとっておこう。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ea\")\r\nPLAY_VOICE(\"erika_1149.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Thank you, but I’m fine. I just can’t stay still as a martial artist—I want to be able to deal with Daria-san’s techniques as soon as possible.\"\r\n「ありがとうございます、でも平気ですよ。少しでも早くダリアさんの技に対応できるようになりたくて、武道家として、じっとしていられないだけです」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[The three gave me wry smiles, but their expressions still showed worry.\r\n三人は苦笑しつつも、その表情から不安の色は消えない。]])\r\n\r\n    MSG([[I thought I had to work even harder, find a way to defeat Daria-san, and put them at ease.\r\nもっともっと努力して、ダリアさんの攻略の糸口を見つけて、安心させないといけないと思った。]])\r\n\r\nSTOP_BGM(1000)\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(55,\"\")\r\n    LAYER_LOAD(60,\"\")\r\n    LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\",1000,false)\r\n\r\n    MSG([[But—\r\nだけど――]])\r\n    --//CG：武術の修行（構え・傷だらけ）\r\n    LAYER_LOAD(LAYER_BG, \"EV022ab\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM10.wav\")\r\n\r\nPLAY_VOICE(\"erika_1150.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Guhhh!?!\"\r\n「ぐうぅッ！？！」]])\r\n    --//SE：床に叩きつけられる音（ﾀﾞｧﾝｯ！）\r\nPLAY_SE(\"SEc026.wav\")\r\nWAIT(200)\r\n\r\n    --//BG：黒バック\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask031\" , 300,false)\r\n\r\n    --//effect：明滅\r\nLAYER_LOAD(80,\"BG000ab\")\r\nSWITCH_SCREEN(\"mask000\",0,false)\r\nLAYER_LOAD(80,\"\")\r\nSWITCH_SCREEN(\"mask000\",50,false)\r\nLAYER_LOAD(80,\"BG000ab\")\r\nSWITCH_SCREEN(\"mask000\",0,false)\r\nLAYER_MOVE_ALPHA(80,0,800,Ease.InCubic)\r\nWAIT(800)\r\n\r\n    MSG([[No matter how many days I trained with the Aikido teacher, no progress was seen.\r\n合気道の先生との稽古を何日続けても、進歩は見られなかった。]])\r\n\r\n    MSG([[I fell face-first onto the tatami mats—too many times to count—and as I felt the smell of the mats and the pain on my face, I realized my lack of talent.\r\n顔面から畳へと落下し、もう何度目になるかわからない、畳のニオイと顔面の痛みを感じながら、自分の才能のなさを思い知る。]])\r\n\r\n    MSG([[But not yet. I can’t give up yet.\r\nだけど、まだまだ。\r\n    　まだ、あきらめるワケにはいかない。]])\r\n\r\n    MSG([[Moving my numb limbs through the pain, I forced myself to stand up and got back into stance.\r\n痛みでまともに感覚のない手足を動かして、無理やりに立ち上がり、ボクは再び構え直した。]])\r\n\r\n    --//CG：武術の修行（構え・傷だらけ）\r\n    LAYER_LOAD(LAYER_BG, \"EV022ab\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_VOICE(\"erika_1151.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"O-one more time, please!\"\r\n「も、もう一度、お願いします！」]])\r\n\r\nPLAY_VOICE(\"aikidoist_0005.wav\")\r\n    MSG([[\r\n【Aikido master】\r\n \"...No, today’s training is over.\"\r\n「……いや、今日の稽古は終了だ」]])\r\n\r\n    MSG([[The teacher sighed in exasperation and, without waiting for my reply, began untying his gi belt.\r\n先生は呆れた様子で溜め息をつき、ボクの返事を待たずに道着の帯を解いていく。]])\r\n\r\nPLAY_VOICE(\"aikidoist_0006.wav\")\r\n    MSG([[\r\n【Aikido master】\r\n \"You understand it yourself, right? What you lack is not technique. It’s the sense to feel the opponent’s center of gravity on your skin and respond immediately.\"\r\n「キミ自身も理解しているだろう？　キミに足りないのは技術ではない。相手の重心を肌に感じて、即座に対応するセンスだよ」]])\r\n\r\nPLAY_VOICE(\"aikidoist_0007.wav\")\r\n    MSG([[\r\n【Aikido master】\r\n \"Since I can’t teach that sense, continuing like this is pointless. Let next week’s training be the last.\"\r\n「センスを教えることなどできない以上、このまま訓練を続けても無意味だ。来週の稽古を最後としよう」]])\r\n\r\nPLAY_VOICE(\"aikidoist_0008.wav\")\r\n    MSG([[\r\n【Aikido master】\r\n \"If you can’t beat me then, I won’t insist. Withdrawing from the match would be wiser.\"\r\n「もしそこで私に勝てないようであれば、無理は言わない。勝負は辞退した方が得策だろう」]])\r\n\r\n    MSG([[Having said that, the teacher quickly left the dojo.\r\nそれだけ言うと、先生は足早に道場から立ち去っていった。]])\r\n\r\n    --//CG：武術の修行（悲しみ・傷だらけ）\r\n    LAYER_LOAD(LAYER_BG, \"EV022ae\")\r\n    SWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\n    MSG([[His overly indifferent reaction left me stunned in stance.\r\nそのあまりに淡泊な反応に、ボクは構えたまま呆然としてしまう。]])\r\n\r\nPLAY_VOICE(\"erika_1152.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Sense... huh.\"\r\n「センス……か」]])\r\n\r\n    MSG([[A bitter taste spread in my mouth. Not the blood from biting my tongue, but the taste of frustration toward my own helplessness.\r\n口の中に苦い味が広がる。口を切った血の味じゃない。無力な自分に対する、悔しさの味だ。]])\r\n\r\n    MSG([[I knew I didn’t have talent.\r\nボクに才能がないことはわかっていた。]])\r\n\r\n--;吉★　テキスト修正「覚えるのにせ」→「覚えるのに」（2020/02/01 19:36）\r\n    MSG([[I was an average person who took almost until finishing compulsory education to learn a skill Marika-onee-san had mastered at ten.\r\nマリカ姉さんが十才でマスターした技術を覚えるのに、義務教育を終えるギリギリまでかかったような凡人だ。]])\r\n\r\n    MSG([[No matter how desperately an average person tries, expecting to gain techniques to defeat a superior opponent in less than a month was hopeless from the start.\r\nそんな凡人がいくら必死になったところで、一ヶ月弱で自分より格上の相手を倒す技術を得ようだなんて、そもそも無理な話だったんだ。]])\r\n\r\nPLAY_VOICE(\"erika_1153.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Maybe... it’s impossible for me.\"\r\n「ボクには……無理なのかな」]])\r\n\r\n    MSG([[The words of Lira and the others who worried and rushed to me didn’t reach my head at all.\r\n心配して駆けつけてくれたリラさんたちの言葉が、全然頭に入らない。]])\r\n\r\n    MSG([[The wall of sense. Faced with the cruel, inevitable reality for an average person, I completely lost my confidence.\r\nセンスの壁。\r\n    　凡人にとって、何よりもツラく、抗いようのない現実を前にして、ボクは完全に自信を喪失するのだった。]])\r\n    --　　　　◆\r\nSTOP_BGM(1000)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"ERI_EP04_18\")\r\nend\r\n"
}