{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP04_02",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP04/RIR/EP04_02.lua",
  "Text": "function RIR_EP04_02()\r\n    --  .序章-2【11月第1週】「自害せよリア充」\r\n    SaveData.Title = \"自害せよリア充\"\r\n\r\n    -- //CG：LINE風画面（メッセージ入力欄に長文）\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM07.wav\")\r\n\r\n    LAYER_LOAD(50,\"CI115a\")\r\n    LAYER_POSITION(50,0,-200)\r\n    LAYER_MOVE_POSITION(50,0,0,500,Ease.OutSine)\r\n    SWITCH_SCREEN(\"mask000\",500,false)\r\n\r\nLAYER_LOAD_FACE(\"BU_RIK01ba\")\r\nPLAY_VOICE(\"lira_0622.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"Alright. I'm sending it... I'm sending it...!\"\r\n「よし。送るぞ……送るぞ……！」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIK01da\")\r\nPLAY_VOICE(\"lira_0623.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"Ah, no, it's impossible. Hey, Akira. Can you read this message I'm sending him and tell me if it’s gross?\"\r\n「あ、やっぱ無理。ねえ、アキラ。彼に送る文、キモくないか読んでみてくれない？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    -- //CI：ゲームしながら通話するアキラとリラ(リコ)・継続 116\r\n    LAYER_LOAD(50,\"CI116a\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[I took a screenshot on my phone and sent it to my friend Akira, who was on a call with me.\r\nアタシは通話中の友達、アキラにスマホのスクリーンショットを撮って送った。]])\r\n\r\nPLAY_VOICE(\"akira_0914.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Huh? No thanks, honestly?\"\r\n「は？　普通に、イヤですけど？」]])\r\n\r\nPLAY_VOICE(\"akira_0915.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Why do I have to give advice on someone else’s love life when I can’t even handle my own properly?\"\r\n「何で自分の恋路すらまともに歩めない私が、他人の恋愛についてアドバイスせにゃならんのですか」]])\r\n\r\n    MSG([[Akira said that coldly after looking at the message I was revising to send to Minato-kun.\r\nアタシが推敲中のミナトくんへのメッセージを見て、アキラはヒドく冷淡に言った。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIK01fc\")\r\nPLAY_VOICE(\"lira_0624.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"No no. You know, giving love advice can actually be fun sometimes. You like that stuff too, right?\"\r\n「いやいや。恋バナってアドバイスする方が楽しかったりするじゃん。アンタも好きでしょ、そういうの」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"akira_0916.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"I don’t have any experience talking about love with friends, so I have no clue. I guess it’s normal for normies.\"\r\n「友達との恋バナとか経験ないからわかりませんねー。リア充にとっては普通なんでしょうねー」]])\r\n\r\nPLAY_VOICE(\"akira_0917.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"So amazing—makes me jealous.\"\r\n「スゴいなー、憧れちゃうなー」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIK01fa\")\r\nPLAY_VOICE(\"lira_0625.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"You’re twisted more than usual... What’s up? Did something happen?\"\r\n「いつも以上にこじらせてんなー……何？　何かあったの？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"akira_0918.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Just leave me alone. I’m just realizing my first love won’t come true.\"\r\n「放っておいてください。初恋が実らないことを察しただけです」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIK01da\")\r\nPLAY_VOICE(\"lira_0626.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"Ugh... s-sorry. That really sucks...\"\r\n「うげ……ご、ごめん。それは、お気の毒に……」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[The person I was talking to now, Akira, met me through an online game about two years ago.\r\n今通話中の相手、アキラとオンラインゲーム上で知り合って、もう二年にはなるだろうか。]])\r\n\r\n    MSG([[We started off because she got toxic during a match and I sent her a warning message.\r\n馴れ初めは、ゲームで対戦中に煽られて、アタシから注意のメッセージを送ったこと。]])\r\n\r\n    MSG([[Since then, we’ve been paired up several times, teamed up to crush trolls, and begrudgingly teamed for events.\r\nそれから何度かマッチングしたり、害悪な荒しを潰すために共闘したり、イベント完走のためにやむなく一緒に組んだりすることが度々あって。]])\r\n\r\n    MSG([[Before I knew it, we’d gotten close.\r\n気付けば仲良くなっていた。]])\r\n\r\n    MSG([[Akira is a popular game streamer known for her sharp tongue, but she also has a surprisingly pure side, having been pining for her cousin she lives with.\r\nアキラは毒舌が人気のゲーム実況者である一方で、意外に純情な一面もあって、同居中の従兄に片思いをし続けてきたはず。]])\r\n\r\n    MSG([[I wonder what happened to her.\r\nそんな彼女に、何があったというのだろう。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIK01ea\")\r\nPLAY_VOICE(\"lira_0627.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"If you want to vent, I’ll listen. Let’s talk while we play like usual.\"\r\n「愚痴なら聞いたげるよ。いつもみたいに、ゲームしながら話そうじゃん」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"akira_0919.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"...Okay, please. I’m feeling like a Friday the 13th today... Want to be a killer.\"\r\n「……では、お願いします。今日のアタシは十三金な気分です……殺人鬼になりたい」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIK01fa\")\r\nPLAY_VOICE(\"lira_0628.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"For anyone who doesn’t know the game stuff, that sounds like something a psychopath would say... Alright then, let’s start.\"\r\n「ゲームの話題だって知らないヤツからしたら、サイコパスなセリフだなー……それじゃあ始めるよー」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I launched the game Akira wanted to play and resumed revising the message I’d send Minato-kun.\r\nアキラが希望したゲームを起動しつつ、アタシは再び、ミナトくんに送るメッセージの推敲を再開する。]])\r\n\r\n    MSG([[Since the Shirahiyosai Festival, where I felt the gap between Erica and myself, I hadn’t been able to send Minato-kun a LINE.\r\n白陽祭でエリカとの差を感じて以来、アタシはミナトくんにＲＩＮＥを送れずにいた。]])\r\n\r\n    MSG([[Shame about wasting time on romance and loss of confidence. Those were new feelings I was overwhelmed by, unable to move forward.\r\n恋愛にうつつを抜かすことへの後ろめたさと、自信の喪失。初めて経験する感情に振り回されて、なかなか前に踏み出せずにいる。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIK01da\")\r\nPLAY_VOICE(\"lira_0629.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"Ah... What should I do? Maybe I should just start the conversation... but if I send such a long message, even he, the oblivious one, will figure out I like him.\"\r\n「あー……どうしよう。やっぱり、アタシから話しかけようかな……いや、でもこんな長文送ったら、いくら鈍感な彼でも好きってバレるだろうし」]])\r\n\r\nPLAY_VOICE(\"lira_0630.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"I can’t. I’m about to die from overthinking. Hey, Akira, what do you think? Is this long message gross?\"\r\n「もうダメ。悩み過ぎて死にそう。ねえ、アキラはどう思う？　この長文、キモくないかな？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"akira_0920.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"You’re just turning into a love advice shop for yourself…! Just go off and die, you normie!\"\r\n「結局アナタの恋愛相談になってるじゃないですか…！　そのまま自害して果ててくださいよ、このリア充！」]])\r\n\r\nPLAY_VOICE(\"akira_0921.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"I’ve got no chance at all, y’know...\"\r\n「私なんか完全に脈無しなんですよー……」]])\r\n\r\nPLAY_VOICE(\"akira_0922.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"At the festival we went to together, I figured he likes someone else… Oh well.\"\r\n「一緒に行った学園祭で、他のヒトが好きだって察してしまったんですから……とほほ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIK01ga\")\r\nPLAY_VOICE(\"lira_0631.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"S-sorry! What kind of trauma event is that? That must really cut deep...\"\r\n「ご、ごめんごめん！　つか何そのトラウマイベント。それは心えぐられるねー……」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I never expected Akira to also be hurt at the festival.\r\nまさか、アキラも学園祭で傷を負っていたなんて。]])\r\n\r\n    MSG([[Isn’t the festival supposed to be where romance blossoms? Well, I guess that’s how it goes for non-normies.\r\n学園祭って恋愛が発展するものじゃないの？\r\n    　いや、非リアの恋愛なんてこんなものか。]])\r\n\r\nPLAY_VOICE(\"akira_0923.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Advice from someone crushed by unrequited love: Don’t expect the other person to make a move... You gotta attack to win.\"\r\n「片思いの果てに散った私からのアドバイスです。相手から動いてくれることを期待しちゃダメですよ……攻めなきゃ勝てません」]])\r\n\r\nPLAY_VOICE(\"akira_0924.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Rikopin is close with his beloved’s cousin, right? If you can’t talk to him directly, why not try asking her first?\"\r\n「確かリコぴん、愛しの彼の従妹と仲がいいんですよね？　もし彼に直接話しかけられないなら、まずその子に相談してみたらどうです？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIK01ca\")\r\nPLAY_VOICE(\"lira_0632.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"Akira... th-thanks.\"\r\n「アキラ……あ、ありがとう」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[That was a blind spot. If I consult Erica, I can casually approach her as myself wearing makeup.\r\n盲点だった。\r\n    　確かにエリカへの相談なら、メイクした状態のアタシで、気楽に話をもちかけられる。]])\r\n\r\n    MSG([[I feel guilty ending up on the receiving end of advice after all.\r\n結局アドバイスをされる側に回ってしまって、心苦しい。]])\r\n\r\n    MSG([[Despite complaints and sarcasm, Akira always gives me advice. She’s twisted, but at heart, she’s kind.\r\n文句や皮肉は言いつつも、アキラはなんだかんだ、いつもアタシにアドバイスをくれる。\r\n    　ひねくれてはいても、根は優しいヤツなんだよね。]])\r\n\r\nPLAY_VOICE(\"akira_0925.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Well then, the normie’s normie problems are over, right? Now it’s my rant time. You’re sticking with me until late night.\"\r\n「さぁ、リア充のリア充的な悩みは終了しましたね？　ここからは私の愚痴タイムです、深夜まで付き合ってもらいますよ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIK01fc\")\r\nPLAY_VOICE(\"lira_0633.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"Hey hey. I’ll stick with you as long as you want.\"\r\n「へいへい。いくらでも付き合いますよー」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    -- //CI：ゲームしながら通話するアキラとリラ(リコ)・終了  116\r\n    SWITCH_SCREEN(\"mask000\",0,false)\r\n    LAYER_MOVE_ALPHA(50,0,500,Ease.InSine)\r\n    LAYER_MOVE_POSITION(50,0,-200,500,Ease.InSine)\r\n    WAIT(500)\r\n    LAYER_LOAD(50,\"\")\r\n\r\n    MSG([[I erased the half-written message, tossed my phone onto the bed, and grabbed the game controller instead.\r\nアタシは書きかけのメッセージを全部消し、スマホをベッドへ放って、代わりにゲームのコントローラーを握る。]])\r\n\r\n    MSG([[As usual, I started the online game while chatting with Akira.\r\nそしていつものように、アキラと会話をしつつ、オンラインゲームを始めるのであった。]])\r\n\r\n    -- 　　　　　◆\r\nSTOP_BGM(2000)\r\n    SWITCH_SCREEN(\"mask000\",0,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    -- //BG：アキラ宅\r\n    LAYER_LOAD(LAYER_BG, \"BG023aa\")\r\n    -- //BU：ミナト（私服・驚き）、アキラ（部屋着・通常）\r\n    LAYER_LOAD(50,\"BU_AKI03aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_VOICE(\"minato_0945.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Akira, you’re still up...? Who are you talking to?\"\r\n「アキラ、まだ起きてたの…？　誰と会話してるワケ？」]])\r\n\r\nPLAY_VOICE(\"akira_0926.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"A fellow non-normie. Normies should go to bed early, okay?\"\r\n「非リア充仲間です。リア充は早く寝て、どうぞ」]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n\r\n    -- 　　　　　◆\r\n\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\", 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"RIR_EP04_03\")\r\nend\r\n"
}