{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP04_19",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP04/RIR/EP04_19.lua",
  "Text": "function RIR_EP04_19()\r\n    -- .結-1【12月第4週】「乱入」\r\n    SaveData.Title = \"乱入\"\r\n\r\n    -- //BG：黒バック\r\n    LAYER_LOAD(LAYER_BG, \"\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    -- //SE：戦姫コール\r\n    PLAY_SE(\"SEf026.wav\", 1000, true)\r\n\r\nPLAY_VOICE(\"hermes_0414.wav\")\r\n    MSG([[\r\n【Announcement】\r\n \"Erika Ikusa—! Please come to the stageーーー!!\"\r\n「伊草エリカちゃーーーん！\r\n    　ステージへどうぞーーーーー！！」]])\r\n    -- //エルメス\r\n\r\nPLAY_VOICE(\"lira_0919.wav\")\r\n    MSG([[\r\n【???】\r\n \"Yes.\"\r\n「はい」]])\r\n    -- //リラ\r\n\r\n    MSG([[I proceed down the dark hallway and step onto the stage.\r\n暗がりの通路を進んで、いざステージの上へ。]])\r\n\r\n    MSG([[The stage, after so long, looks much more radiant than before.\r\n久しぶりのステージは以前よりずっと輝いて見える。]])\r\n\r\n    MSG([[Just like the stars in the night sky I looked up at on the night of my first date with Minato-kun.\r\nまるで、ミナトくんと初めてデートした日の夜に見上げた、あの夜空の星々のように。]])\r\n\r\n    STOP_SE(\"SEf026.wav\",1000)\r\n\r\n    -- //BG：選挙ステージ\r\n    LAYER_LOAD(LAYER_BG, \"BG024da\")\r\n    -- //BU：エルメス（通常）\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    LAYER_LOAD(50,\"BU_ERU01aa\")\r\n    LAYER_POSITION(50,200,0)\r\n    LAYER_MOVE_POSITION(50,0,0,500,Ease.OutSine)\r\n    SWITCH_SCREEN(\"mask000\",500,false)\r\n\r\nPLAY_BGM(\"BGM15.wav\",1000,true)\r\n\r\nPLAY_VOICE(\"hermes_0415.wav\")\r\n    MSG([[\r\n【Hermes】\r\n \"Ladies & gentlegaaaaarls<sprite=\"Emoji\" name=\"heart\"> Now, now, now! It’s time for the long-awaited Princess Election!\"\r\n「レディース＆ジェントルガーーーールズ<sprite=\"Emoji\" name=\"heart\">　さぁさぁさぁ！　皆お待ちかねの、姫選挙の時間だよー！」]])\r\n    -- //注釈：￥はハート\r\n\r\n    LAYER_LOAD(50,\"BU_ERU01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"hermes_0416.wav\")\r\n    MSG([[\r\n【Hermes】\r\n \"The ones battling for votes today are—my older sister and the academy’s top handsome girl, the princess knight Daria!\"\r\n「本日票を奪い合うのは――私のお姉ちゃんにして学園最高のイケメン女子、姫騎士のダリアちゃんと！」]])\r\n\r\nPLAY_VOICE(\"hermes_0417.wav\")\r\n    MSG([[\r\n【Hermes】\r\n \"A superstar who was a big hit even at the Hakuyousai! Now risen to become Yuriai Private Academy’s representative beauty, the battle princess Erika cha……\"\r\n「白陽祭でも大活躍！　今や百合愛学園を代表する美少女にまで昇りつめたスーパースター、戦姫のエリカちゃ……」]])\r\n\r\n    MSG([[Hermes-senpai’s words come to a halt.\r\nエルメスちゃん先輩の言葉が止まる。]])\r\n\r\n    MSG([[And understandably so. Because who appeared in the place Erika was supposed to standーー\r\nそれも当然だ。\r\n    　だってエリカが立つべき場所に現れたのはーー]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n\r\n    -- //CG：ステージ上のリラ（決意・対ダリア）\r\n    LAYER_LOAD(LAYER_BG, \"EVb001aa\")\r\n    LAYER_LOAD(50,\"EV01_BUS_DAR01aa\")\r\n    LAYER_POSITION(50,570,-160)\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_VOICE(\"dahlia_0375.wav\")\r\n    MSG([[\r\n【Daria】\r\n \"What kind of joke is this? This is not the place for ‘a knight’ like you to stand.\"\r\n「何の冗談かな？　ここは『騎士』のキミが立つべき場所ではないよ」]])\r\n\r\nPLAY_VOICE(\"lira_0920.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"There’s nothing strange here, is there? The Princess Election was originally a contest for the title of ‘Princess.’\"\r\n「何もおかしくはないでしょう？　姫選挙は本来、『姫』の称号をかけて競う場だったはず」]])\r\n\r\nPLAY_VOICE(\"lira_0921.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"A challenger has appeared to take the ‘Princess’ title from you. That’s all there is to it.\"\r\n「アナタから『姫』の称号を奪うために挑戦者が現れた。それだけのことです」]])\r\n\r\nPLAY_VOICE(\"hermes_0418.wav\")\r\n    MSG([[\r\n【Hermes】\r\n \"L-Lira-chanーーーーーーーーーーーーー!!!\"\r\n「り、リラちゃんだぁーーーーーーーーーーーーー！！！」]])\r\n\r\n-- SE：どよめき\r\nPLAY_SE(\"SEf005.wav\",0,true)\r\n\r\nPLAY_VOICE(\"hermes_0419.wav\")\r\n    MSG([[\r\n【Hermes】\r\n \"Just when you thought Erika-chan would come, lo and behold! Here appears second-year ‘Princess Gal’ Lira Hoozuki, first-year student and future candidate for ‘Princess’ーーー!\"\r\n「エリカちゃんが来ると思いきやなんと！　将来の『姫』候補として『姫ギャル』の称号を持つ１年生、鬼灯リラちゃんが現れましたーーーー！」]])\r\n\r\nPLAY_VOICE(\"hermes_0420.wav\")\r\n    MSG([[\r\n【Hermes】\r\n \"I’m truly surprised by this! What’s going to happen now? What should I doーー!?\"\r\n「これには私もびっくりびっくり！　どうなっちゃうのかな、どうしちゃえばいいのかなー！？」]])\r\n\r\n\r\nSTOP_SE(\"SEf005.wav\", 1000)\r\n    -- //SE：手を打つ音\r\nPLAY_SE(\"SEa018.wav\")\r\n--WAIT(600)\r\n\r\nPLAY_VOICE(\"dahlia_0376.wav\")\r\n    MSG([[\r\n【Daria】\r\n \"Calm yourself. The simplest solution is to promptly remove Lira-kun and call forth the original candidate Erika-kun.\"\r\n「落ち着きたまえ。速やかにリラくんを退場させ、本来の出馬者であるエリカくんを呼べばいい話だ」]])\r\n\r\n    MSG([[When Daria clapped her hands, the murmuring crowd fell silent.\r\nダリアが手を打ち鳴らしたことで、どよめきだった会場内は静まり返った。]])\r\n\r\n    MSG([[Furthermore, Daria sent me a disappointed look.\r\n更にダリアは、アタシに失望の眼差しを送る。]])\r\n\r\nPLAY_VOICE(\"dahlia_0377.wav\")\r\n    MSG([[\r\n【Daria】\r\n \"I’m disappointed in you, Lira-kun. Changing the candidate on the day of the election is absolutely unacceptable.\"\r\n「キミには失望したよ、リラくん。当日に選挙の出馬者が変わるなんて許されるワケがないだろう」]])\r\n\r\nPLAY_VOICE(\"lira_0922.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"Unacceptable? How can you say that with such certainty? There is no clause in the election rules that prohibits a proxy participant.\"\r\n「許されない？　どうしてそう言い切れるんですか？　姫選挙のルールに、代理人の参加を認めないとする条項はありませんよ」]])\r\n\r\nPLAY_VOICE(\"dahlia_0378.wav\")\r\n    MSG([[\r\n【Daria】\r\n \"Even if it’s not explicitly stated, it’s obvious. Besides, have you gotten approval from the Election Management Committee? You can’t just unilaterally change the sacred Princess Electionーー\"\r\n「そんなことは定めなくともわかり切ったことだ。そもそも、選挙管理委員会に話を通してあるのかね？　キミの独断で神聖な姫選挙の場を――」]])\r\n\r\nPLAY_VOICE(\"lira_0923.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"I got permission from the committee this morning. Because Erika suddenly became unwell, I, the head knight, am running in her place.\"\r\n「選管からは今朝許可をもらいました。急遽エリカが体調を崩したから、筆頭騎士のアタシが代わりに出馬することになったとね」]])\r\n\r\n    MSG([[Knowing there are Uraniu faction students in the Election Management Committee, I naturally prepared the groundwork.\r\n選挙管理委員会にウラン派の生徒がいることは知っていたので、当然根回し済みだ。]])\r\n\r\n    MSG([[I also completed all the paperwork to be officially recognized as a proxy.\r\n正式に代理として認められるよう、各種書類の処理はもちろん済ませておいた。]])\r\n\r\n    MSG([[And above all, I have this strongest ally on my side.\r\nそして何より、アタシにはこの最大の味方が存在する。]])\r\n\r\nPLAY_VOICE(\"lira_0924.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"Proxy participation was also permitted at the 82nd Princess Election. In other words, it’s a precedent recognized by our great seniors.\"\r\n「代理での参加は、過去の第８２回姫選挙でも許された前例もある対応。つまり、アタシたちの大先輩が認めた事例なんです」]])\r\n\r\nPLAY_VOICE(\"lira_0925.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"At Yuriai Private Academy, seniority is absolute. Overturning past rulings from our seniors is simply not allowed.\"\r\n「百合愛学園において“年功序列”は絶対。大先輩たちの過去の裁決を覆すなんて真似、許されませんよね」]])\r\n\r\nPLAY_VOICE(\"dahlia_0379.wav\")\r\n    MSG([[\r\n【Daria】\r\n \"…I see. I’m impressed with your knowledge of the Princess Election. Reluctantly, I have no choice but to accept your claim.\"\r\n「……なるほど。キミの姫選挙に関する知識には恐れ入ったよ。悔しいが、キミの主張を認める他ないらしい」]])\r\n\r\nPLAY_VOICE(\"lira_0926.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"I’m seriously aiming to become a ‘Princess.’ Of course I have past election results memorized.\"\r\n「アタシは本気で『姫』を目指してるんです。過去の姫選挙の結果くらい、頭に入れて当然ですよ」]])\r\n\r\n    MSG([[This strategy only occurred to me because I was so obsessed with the Princess Election.\r\nこれは、姫選挙に執着していたアタシだからこそ思いついた作戦。]])\r\n\r\n    MSG([[Sensing the Himekami family’s trap, I only consulted with Uran-senpai, quietly arranging behind the scenes to participate as Erika’s proxy.\r\n姫神家の罠の気配を感じ取ったアタシは、ウラン先輩にだけ相談し、裏でエリカの代理として姫選挙に参加できる手筈をコソコソと進めていった。]])\r\n\r\n    MSG([[If they’d spotted my moves beforehand, they might have blocked me, so the only chance I had was election day.\r\nもし事前に動きを察知されたら対策を施されるかもしれない以上、チャンスは選挙当日だけ。]])\r\n\r\n    MSG([[It took longer than expected to convince the committee, and contacting Erika was almost too late, but I made it just in time.\r\n思ったより選管の説得に時間がかかってエリカへの連絡がギリギリになったけど、何とかセーフ。]])\r\n\r\n    MSG([[Because even Erika didn’t know, this surprise attack went off without anyone catching on.\r\nエリカにすらナイショにしたからこそ、この奇襲は誰にも気取られることなく、上手くいったんだ。]])\r\n\r\nPLAY_VOICE(\"lira_0927.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"Hermes-chan senpai, okay with me participating as a proxy, right? I’m not breaking any rules!\"\r\n「エルメスちゃん先輩、アタシの代理参加はＯＫってことでいいですよね？　何もルールは違反してないんですから！」]])\r\n\r\nPLAY_VOICE(\"hermes_0421.wav\")\r\n    MSG([[\r\n【Hermes】\r\n \"Sounds fun, so it’s a yes<sprite=\"Emoji\" name=\"heart\">\"\r\n「面白いからオッケー<sprite=\"Emoji\" name=\"heart\">」]])\r\n    -- //注釈：￥はハート\r\n\r\n    MSG([[Despite my older sister’s reasonable objections, her little sister, the Princess Emperor, easily accepted my claim.\r\n姉の賢明な反論もむなしく、妹の姫皇は凄まじい気軽\r\n    さでアタシの主張を認めてくれた。]])\r\n\r\nPLAY_VOICE(\"hermes_0422.wav\")\r\n    MSG([[\r\n【Hermes】\r\n \"This surprise really shocked me, and more than anything, Lira-chan, your seriousness really comes through!\"\r\n「このサプライズには本当に本当に驚かせてもらったし、それに何よりリラちゃんの本気、スッゴ～～～～～く伝わってくるもん！」]])\r\n    -- //注釈：￥はハート\r\n\r\nPLAY_VOICE(\"hermes_0423.wav\")\r\n    MSG([[\r\n【Hermes】\r\n \"Daria-chan! Please take Lira-chan’s determination seriously!\"\r\n「ダリアちゃん！　リラちゃんの本気、ちゃんと受け止めてあげて！」]])\r\n\r\nPLAY_VOICE(\"dahlia_0380.wav\")\r\n    MSG([[\r\n【Daria】\r\n \"…Fine. If Lira-kun loses terribly, we might still be able to drag out Erika-kun.\"\r\n「……まぁいいさ。リラくんが惨敗すれば、エリカくんを引っ張り出すことも、できるかもしれないからね」]])\r\n\r\nPLAY_VOICE(\"lira_0928.wav\")\r\n    MSG([[\r\n【Lira】\r\n (Well then, the real challenge starts now.)\r\n（さて、マジで大変なのはここからだぞ、っと）]])\r\n\r\n    MSG([[I face Daria in the center.\r\nそして中央でダリアと向かい合う。]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(LAYER_BG, \"BG024db\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    -- //CI：ダリアBU（真剣）顔左半分を切り抜き 129\r\n    SET_CUTIN_22_XL(450,300)\r\n    LAYER_LOAD(200,\"BG024db\")\r\n    LAYER_SCALE(200,200,200)\r\n    LAYER_EFFECT(200, 7)\r\n    LAYER_LOAD(201,\"BUL_DAR01ba\")\r\n    LAYER_POSITION(201,280,0)\r\n    SWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\n    MSG([[Her furious and hostile gaze makes me want to step back.\r\n凄まじい怒りと敵意を向けられ、後ずさりそうになった。]])\r\n\r\n    MSG([[From her expression, I’m certain the Himekami family had laid some kind of trap for Erika.\r\nその表情から、やはり姫神家はエリカに対して、何かしらの罠を張っていたことを確信する。]])\r\n\r\n    MSG([[They’re seriously angry that I’ve disrupted their plan. Heh, serves them right.\r\nよほどアタシに、計画を狂わされたことが腹立たしいらしい。\r\n    　ふふーん、ざまぁみろだ。]])\r\n\r\nPLAY_VOICE(\"dahlia_0381.wav\")\r\n    MSG([[\r\n【Daria】\r\n \"Your spirit of self-sacrifice is admirable, but I will crush you thoroughly. Prepare yourself.\"\r\n「キミの自己犠牲の精神はアッパレだが、本気で潰させてもらう。覚悟したまえ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIR07ba\")\r\nPLAY_VOICE(\"lira_0929.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"Self-sacrifice? I don’t have an ounce of that feeling.\"\r\n「自己犠牲？　そんな気持ち、これっぽっちもないっつーの」]])\r\n\r\nPLAY_VOICE(\"lira_0930.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"I’m not just here to protect Erika. I intend to snatch the title of ‘Princess’ from you today!\"\r\n「エリカを守るためってだけじゃない。\r\n    　アタシは今日、アンタから『姫』の称号をブン取るつもりでこの場に立ったの！」]])\r\n\r\nPLAY_VOICE(\"lira_0931.wav\")\r\n    MSG([[\r\n【Lira】\r\n \"Prepare yourself, ‘Princess Knight’ Daria Himegami! The pain you’ve inflicted on my heart will be returned amplified by a billion!\"\r\n「覚悟しなさい、『姫騎士』姫神ダリア！　アンタから受けた心の痛み、一億万倍にして返してあげるわ！」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"dahlia_0382.wav\")\r\n    MSG([[\r\n【Daria】\r\n \"…Interesting. Show me your resolve, ‘Princess Gal’ Lira Hoozuki!\"\r\n「……面白い。キミの覚悟を見せてもらおうじゃないか、『姫ギャル』鬼灯リラ！」]])\r\n\r\n    MSG([[At this point, Erika no longer mattersーー\r\nここまできたら、もうエリカは関係ない――]])\r\n\r\n    MSG([[My second-ever Princess Election, fought for pride, is finally set to begin.\r\nアタシのプライドをかけた生涯二度目の姫選挙が、遂に幕を開ける。]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    RESET_CUTIN_00()\r\n    -- 　　　　◆\r\nSTOP_BGM(1000)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\", 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"RIR_EP04_20\")\r\nend\r\n"
}