{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP05_13",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP05/RYU/EP05_13.lua",
  "Text": "function RYU_EP05_13()\r\n    -- .承-6【2月第2週】「龍宮院家の出発」\r\n    SaveData.Title = \"龍宮院家の出発\"\r\n\r\n    -- //BG：龍宮院邸\r\nLAYER_LOAD(LAYER_BG, \"BG006aa\")\r\nSWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    -- //BU：ウラン・私服（驚き）\r\nLAYER_LOAD(50,\"BU_RYU02ca\")\r\nLAYER_POSITION(50,400,0)\r\nSWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\n    MSG([[Taking Uran-san out from the annex, we headed outside the mansion――\r\n別館からウランさんを連れ出して、屋敷の外へと向かう途中――]])\r\n\r\n    -- //BU：ウラン・私服（驚き）、ウラン父\r\n    SWITCH_SCREEN(\"mask000\",0,false)\r\nLAYER_LOAD(55,\"BU_MOB12aa\")\r\nLAYER_ALPHA(55,0)\r\nLAYER_POSITION(55,-600,0)\r\nLAYER_MOVE_POSITION(55,-400,0,500,Ease.OutCubic)\r\nLAYER_MOVE_ALPHA(55,255,500,Ease.OutCubic)\r\nWAIT(500)\r\n\r\nPLAY_VOICE(\"udoh_0019.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"Have you been able to reunite with my daughter, Minato Ikusa-kun?\"\r\n「娘との再会は叶ったかね？　伊草ミナトくん」]])\r\n\r\nPLAY_BGM(\"BGM05.wav\",0)\r\n\r\nPLAY_VOICE(\"uran_0883.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"F-Father!?\"\r\n「お、お父さま！？」]])\r\n\r\n    MSG([[Just as if he had been waiting for us, Mr. Urandou appeared in front of us.\r\nまるで待ち構えていたように、ボクらの前に羽堂さんが現れた。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07ba\")\r\nPLAY_VOICE(\"erika_2105.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"My true identity has been discovered from the beginning, hasn’t it?\"\r\n「ボクの正体は、初めからバレていたんですね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"udoh_0020.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"Your acting was perfect. But muscles speak louder than words, don’t they?\"\r\n「演技は完璧だったよ。だが筋肉は口ほどにモノを言うだろう？」]])\r\n\r\nPLAY_VOICE(\"udoh_0021.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"The tension in your muscles when suspected, the relaxation when realizing it was a misunderstanding, the slight strain when you said you forgot something. There was plenty to see through your true feelings.\"\r\n「疑いをかけられた際の筋肉の緊張、誤解だと気付いた時の弛緩、忘れ物をしたと言った時の僅かな力み。本心を見抜く材料はいくらでもあったさ」]])\r\n\r\nPLAY_VOICE(\"udoh_0022.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"If you were approaching Uran with ill intentions, I would have caught you immediately.\"\r\n「キミが悪意をもってウランに近づこうとしているなら、すぐにでも捕まえていただろうね」]])\r\n\r\n    MSG([[I remembered the moment when I acted like I forgot something, and Mr. Urandou’s expression twisted.\r\nボクが忘れ物をしたという演技をしてみせた時、羽堂さんの表情が歪んだことを思い出す。]])\r\n\r\n    MSG([[That must have been suspicion toward me.\r\nアレは、ボクを訝しんでいたということか。]])\r\n\r\nPLAY_VOICE(\"udoh_0023.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"From your behavior as a maid, I can tell you put in considerable effort. You wouldn’t work that hard for a shallow purpose.\"\r\n「キミのメイドとしての振る舞いを見れば、相当に努力を重ねたことはわかるよ。軟派な目的ではそこまでの努力はできない」]])\r\n\r\nPLAY_VOICE(\"udoh_0024.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"Why did you contact Uran? What are you planning to do with my daughter?\"\r\n「キミはどうしてウランと接触した？　私の娘を、どうしようというんだい？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07ba\")\r\nPLAY_VOICE(\"erika_2106.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"I apologize for intruding without permission. I don’t care what punishment I receive. But in exchange――\"\r\n「勝手に侵入してしまって申し訳ありません。どのような罰を受けたってかまいません。その代わり――」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"udoh_0025.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"In exchange?\"\r\n「その代わり？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07ba\")\r\nPLAY_VOICE(\"erika_2107.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"I will take Uran away. From this prison called the Ryuguuin family estate, by my own hands.\"\r\n「ウランさんは連れ出します。この龍宮院家という牢獄から、ボクの手で」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nLAYER_LOAD(50,\"BU_RYU02ha\")\r\nLAYER_POSITION(50,400,0)\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0884.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"E-Erika-san...\"\r\n「え、エリカさん」]])\r\n\r\n    MSG([[Holding Uran-san’s hand tightly, I stared straight at Mr. Urandou.\r\nウランさんと手を握り合ったまま、真っ直ぐに羽堂さんと睨み合う。]])\r\n\r\n    MSG([[There was no way we would back down here. I was prepared to fight against the Ryuguuin family.\r\nここで引くワケにはいかない。\r\n    　龍宮院家と争いになるのは覚悟の上での行動だ。]])\r\n\r\n    MSG([[From the start, once I got Uran-san out of the mansion, I planned to hide her at my place for a while.\r\n初めから、ウランさんを屋敷から連れ出せたあとは、しばらくはウチで匿うつもりだった。]])\r\n\r\nPLAY_VOICE(\"udoh_0026.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"Don’t underestimate the Ryuguuin family's influence in the Tokai region. What can a powerless boy like you do alone?\"\r\n「東海圏における、龍宮院家の影響力を舐めない方がいいな。キミのような何の権力もない家系の少年一人で、一体何ができると言うんだい？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07ba\")\r\nPLAY_VOICE(\"erika_2108.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"If it’s to make Uran-san happy, I can fight anyone. Even you.\"\r\n「ウランさんを幸せにするためなら、誰とだって戦えます。たとえ、アナタとでも」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"udoh_0027.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"Fufufu, you’re an interesting boy. My muscles are tingling like never before.\"\r\n「フッフッフ、面白い少年だなぁ。久しぶりに筋肉が滾ってしまうよ」]])\r\n\r\n    MSG([[He cracked his knuckles and edged closer. The pressure was overwhelming, like facing a giant boar on a mountain training retreat.\r\n拳を鳴らしながら、羽堂さんがにじり寄ってくる。\r\n    　まるで山ごもりの修行で巨大イノシシと遭遇した時のような、凄まじい威圧感だ。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07ba\")\r\nPLAY_VOICE(\"erika_2109.wav\")\r\n    MSG([[\r\n【Erika】\r\n (This person is stronger than anyone I have ever seen.)\r\n（このヒト、今まで見てきたどんなヒトよりも、強い）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I carefully gauged the distance with sliding steps, observing the enemy for any openings.\r\n摺り足で間合いを測りながら、目の前の強敵に隙がないか、慎重に観察を続ける。]])\r\n\r\n    MSG([[Then, I suddenly noticed something.\r\nそこで、ふと気付いた。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07ca\")\r\nPLAY_VOICE(\"erika_2110.wav\")\r\n    MSG([[\r\n【Erika】\r\n (H-Huh...?)\r\n（あ、アレ……？）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[He was clearly the superior opponent. Yet there was no sign of him attacking, nor the intent to counter like an aikido teacher.\r\n間違いなく相手の方が格上だ。\r\n    　なのに一向に攻めてくる気配はなく、かと言って合気道の先生のような、コチラを迎え撃とうとする意志も感じられない。]])\r\n\r\n    MSG([[More than that, the feeling was almost friendly?\r\nその気配はむしろ、好意的？]])\r\n\r\n    MSG([[Instead of counterattacking me, it felt like he was welcoming me.\r\nコチラを返り討ちにするどころか、歓迎してやろうというような。]])\r\n\r\n    MSG([[Mr. Urandou was emitting a calm aura I had never sensed before during our encounters.\r\nこれまでの立ち会いでは感じたこともない、穏やかな空気を羽堂さんはまとっていた。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07aa\")\r\nPLAY_VOICE(\"erika_2111.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Why aren’t you taking a stance?\"\r\n「どうして、構えないんですか？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I unconsciously relaxed my guard and lowered my clenched fists.\r\nボクは思わず警戒を緩め、構えていた拳を下げた。]])\r\n\r\n    MSG([[Seeing this, Mr. Urandou’s stern expression softened into a bright smile.\r\nそんなボクを見ると、羽堂さんの険しい表情が緩み、朗らかな笑顔を浮かべる。]])\r\n\r\nSTOP_BGM(2000)\r\n\r\nPLAY_VOICE(\"udoh_0028.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"Finally, you’ve lowered your fists. Honestly, I was startled by your instant readiness to fight.\"\r\n「やっと拳を下げてくれたか。いやーまったく、いきなり臨戦態勢なんだものな。焦ってしまったよ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07aa\")\r\nPLAY_VOICE(\"erika_2112.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Could it be you never planned to capture us from the start?\"\r\n「もしかして最初から……ボクたちを捕まえる気なんてなかったんですか？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"udoh_0029.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"I never said anything about capturing anyone.\"\r\n「誰も捕まえるだなんて一言も言っていないじゃないか」]])\r\n\r\nPLAY_VOICE(\"udoh_0030.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"You came to take Uran back to Yuriai Private Academy, right? She looks happy, so that’s good. I’ll have her start attending again tomorrow.\"\r\n「ウランをまた百合愛学園に連れ出しに来てくれたのだろう？　ウランも嬉しそうだし、結構なことだ。明日からでも登校させよう」]])\r\n\r\n    LAYER_LOAD(50,\"BU_RYU02ca\")\r\n    LAYER_POSITION(50,400,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\n    MSG([[His agreement came so easily I was completely taken aback, thinking it was a trap.\r\n罠かと思うほどあっさり了承がもらえて、拍子抜けしてしまう。]])\r\n\r\n    MSG([[What exactly was the point of this whole infiltration operation?\r\n一連の潜入作戦は一体何だったというのか。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07ca\")\r\nPLAY_VOICE(\"erika_2113.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"R-Really? Is that okay?\"\r\n「ほ、本当にいいんですか？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"udoh_0031.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"There’s no reason not to. I appreciate your courage and actions, Minato-kun.\"\r\n「むしろ悪い理由がないだろう。よく勇気を出して行動してくれた。感謝するよ、ミナトくん」]])\r\n\r\nPLAY_BGM(\"BGM09.wav\",0)\r\n\r\nPLAY_VOICE(\"udoh_0032.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"You’re indeed the kind of man even good ol’ Ouga would acknowledge. It’s no wonder Uran fell for you.\"\r\n「流石はあのオウガくんも認めるほどの男だ。ウランが惚れるのも納得だよ」]])\r\n\r\n    MSG([[I didn’t know what to think. This was completely the opposite of the image of her father I had imagined from Uran-san’s stories.\r\n何だろう。\r\n    　ウランさんからの話を聞いて想像していた父親像とまるで真逆で、頭が追いつかない。]])\r\n\r\n    MSG([[Uran-san beside me was clearly shaken too.\r\n隣ではウランさんも明らかに動揺している。]])\r\n\r\nLAYER_LOAD(50,\"BU_RYU02ga\")\r\nLAYER_POSITION(50,400,0)\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"uran_0885.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"W-What kind of sudden change of heart is this? Didn’t you order me to leave the academy, Father?\"\r\n「い、一体どういう気の変わりようですか？　わたくしに、学園を去るよう命じたのはお父さまではありませんか」]])\r\n\r\nPLAY_VOICE(\"udoh_0033.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"Yes. When I saw Minato-kun’s gender from the photo sent by the Himegami family, I was quite distressed. I thought it was impossible for her to continue attending the same school.\"\r\n「ああ。姫神家から届いた写真でミナトくんの性別を知り、随分と憔悴していたからね。同じ学園に通い続けるのは無理だと思ったんだ」]])\r\n\r\nLAYER_LOAD(50,\"BU_RYU02ca\")\r\nLAYER_POSITION(50,400,0)\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0886.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"B-But to order a withdrawal from the school altogether...\"\r\n「で、ですけど……退学まで命じるなんて」]])\r\n\r\nPLAY_VOICE(\"udoh_0034.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"As a parent, it’s only natural to worry when you find out your daughter was deceived and fallen for a cross-dressing boy of unknown background.\"\r\n「素性も知れない女装男に娘が騙され、惚れ込んでいたと知ったら、親として心配するのは当然のことだろう？」]])\r\n\r\nLAYER_LOAD(50,\"BU_RYU02da\")\r\nLAYER_POSITION(50,400,0)\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0887.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"T-Then why did you lock me in the annex? Was it with the intention to punish me, like the discipline grandmother gave when I was little?\"\r\n「で、ではわたくしを別館に閉じ込めたのは何故ですか？　幼い頃にお祖母さまから受けたおしおきのように、わたくしを折檻するおつもりだったのでしょう？」]])\r\n\r\nPLAY_VOICE(\"uran_0888.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"And now, suddenly siding with me... What kind of change of heart is this!?\"\r\n「今更わたくしの味方になって……一体どういう心変わりなのですか！？」]])\r\n\r\n    MSG([[Mr. Urandou silently stared at his daughter breaking down like a child, without any rebuttal.\r\n子どものように感情を露わにする自分の娘を、羽堂さんは反論もせず、じっと見つめていた。]])\r\n\r\nPLAY_VOICE(\"udoh_0035.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"Uran. It seems I have caused you many misunderstandings.\"\r\n「ウラン。どうやらオマエには、様々な誤解を与えてしまっていたようだな」]])\r\n\r\nPLAY_VOICE(\"uran_0889.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"M-Misunderstandings? Isn’t it true you never gave me freedom?\"\r\n「ご、誤解？　お父さまがわたくしに自由を与えてくださらなかったことは事実でしょう？」]])\r\n\r\nPLAY_VOICE(\"uran_0890.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"You thoroughly trained me to serve men as a woman!\"\r\n「女性として男性に尽くすよう、徹底的に教育してきたじゃありませんか！」]])\r\n\r\nPLAY_VOICE(\"uran_0891.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Because of that, I tried to live happily at least while I was at Yuriai Private Academy.\"\r\n「ですからわたくしは……せめて百合愛学園にいる間だけでも、幸せに生きようと動いてきたというのに」]])\r\n\r\nPLAY_VOICE(\"udoh_0036.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"...I’m sorry. I never intended to restrict your way of life. I only wanted you to live happily.\"\r\n「……すまない。別に私は、オマエの生き方を縛りつけようなどとは一切考えていなかったんだ。ただウランに、幸せに生きて欲しかっただけなんだよ」]])\r\n\r\nPLAY_VOICE(\"uran_0892.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Happily...? By serving men in everything...?\"\r\n「幸せに……？　男性にすべてを尽くすことで、ですか？」]])\r\n\r\n    MSG([[Mr. Urandou’s face twisted at Uran-san’s words.\r\nウランさんの言葉を受け、羽堂さんが表情を歪ませる。]])\r\n\r\nPLAY_VOICE(\"udoh_0037.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"It’s true the Ryuguuin family had long been obsessed with producing good wives. But it was my wife—your mother—who encouraged that way of life for Uran.\"\r\n「龍宮院家が代々、良妻を生むことに執着していたのは事実だ。しかしウランにその生き方を促したのは、私の妻……オマエのお母さんの影響だよ」]])\r\n\r\nPLAY_VOICE(\"udoh_0038.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"In hindsight, it was extreme.\"\r\n「今思えば、極端であったがな」]])\r\n\r\nLAYER_LOAD(50,\"BU_RYU02ca\")\r\nLAYER_POSITION(50,400,0)\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0893.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Y-Your mother? I heard she also died bearing me for the prosperity of the Ryuguuin family.\"\r\n「お、お母さま？　お母さまもわたくしを生むために……龍宮院家の繁栄のために亡くなったと伺いました」]])\r\n\r\nLAYER_LOAD(50,\"BU_RYU02da\")\r\nLAYER_POSITION(50,400,0)\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0894.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"She pushed through a harsh childbirth for the heir.\"\r\n「跡継ぎを生むために、過酷な出産に挑んだ結果だと」]])\r\n\r\nPLAY_VOICE(\"udoh_0039.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"That’s not true. Rather, your mother had tried to change the old traditions of the Ryuguuin family.\"\r\n「それは違うよ。むしろオマエのお母さんは、古き龍宮院家の伝統を変えようと励んでいた」]])\r\n\r\nPLAY_VOICE(\"udoh_0040.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"But as she continued to defy tradition, she died prematurely from the strain.\"\r\n「だが伝統に逆らい続けた結果、心労のあまり早死にしたんだ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07ga\")\r\nPLAY_VOICE(\"erika_2114.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"S-Strain...? What exactly happened?\"\r\n「し、心労で……？　一体、何があったんですか？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"udoh_0041.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"She overworked herself as the head of Ryugu Holdings.\"\r\n「龍宮ホールディングスの代表として、身を粉にし過ぎたのさ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07ca\")\r\nPLAY_VOICE(\"erika_2115.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"I-If your wife was the head, then you must be...\"\r\n「え、奥さんが代表ということは、アナタは」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"udoh_0042.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"A son-in-law. That shows how much my beloved wife was an outlier in the Ryuguuin family, doesn’t it?\"\r\n「婿養子だよ。私の最愛の妻が、龍宮院家で如何に異端であったかがわかるだろう？」]])\r\n\r\nPLAY_VOICE(\"udoh_0043.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"But being an outlier carried unforeseen emotional burdens. Good wife and wise mother might be old-fashioned ideas, but male chauvinism runs deep even today.\"\r\n「だが異端であるというのは、想像以上に心労を伴うものだ。良妻賢母は古い価値観と揶揄されるがね。現代でも男尊女卑の価値観が根強い」]])\r\n\r\nPLAY_VOICE(\"udoh_0044.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"My wife, who resisted such a society, wore herself down and passed away. Without ever complaining to me until the end.\"\r\n「そのような社会に抗おうとした妻は……心を擦り減らして死んだ。最後まで私に愚痴ひとつ漏らさないままね」]])\r\n\r\n    MSG([[Marika-neesan’s face flashed through my mind.\r\nマリカ姉さんの顔が脳裏によぎる。]])\r\n\r\n    MSG([[She never confided in me or anyone else until she slipped into her current coma.\r\nマリカ姉さんが今の昏睡状態に至るまで、ボクにも、誰にも相談などしなかった。]])\r\n\r\n    MSG([[Uran-san or I might have collapsed the same way without the help of our friends.\r\nウランさんやボクだって、仲間の助けを得られなければ、同じように倒れていたかもしれない。]])\r\n\r\n    MSG([[I could not think of Uran-san’s mother’s story as someone else’s problem.\r\nウランさんのお母さんの話は、決して他人事に思えなかった。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07da\")\r\nPLAY_VOICE(\"erika_2116.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"B-But... Wasn’t Uran-san’s mother happy?\"\r\n「で、ですが……ウランさんのお母さんは幸せだったのではないでしょうか」]])\r\n\r\nPLAY_VOICE(\"erika_2117.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Didn’t she die satisfied, living true to her convictions?\"\r\n「ご自身の信念をまっとうされて、満足して死んでいったのではないですか？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"udoh_0045.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"What about those left behind? Do you think they’re happy being crushed by the expectations she bore alone?\"\r\n「残されたモノたちはどうなる？　自分一人ですべてを背負い込んで、背負った期待に押し潰されて、周囲のモノたちが喜ぶと思うのか？」]])\r\n\r\nPLAY_VOICE(\"udoh_0046.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"I never asked my wife for her beliefs... I only wished she could be with Uran and me for as long as possible.\"\r\n「私は妻に信念など求めていなかった……ただ少しでも長く、私とウランのそばにいてくれればそれでよかったんだ」]])\r\n\r\nPLAY_VOICE(\"udoh_0047.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"Minato-kun, and Uran, remember this: In today’s world, there are many choices and freedoms in the path one takes. But that doesn’t always mean happiness.\"\r\n「ミナトくん、それにウランも、覚えておいてくれ。今の時代、進むべき道に多くの選択肢がある。自由がある。だが、それが幸せとは限らない」]])\r\n\r\nPLAY_VOICE(\"udoh_0048.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"Sometimes, living the life someone else set for you, quietly making it through each day—those uneventful days—may also be happiness. Such days will come for you too.\"\r\n「誰かに定められた生き方をまっとうする。無事に毎日を過ごす。そうした“何もない日々”もまた幸せなんだと思える日が、キミたちにも訪れるはずだ」]])\r\n\r\nPLAY_VOICE(\"udoh_0049.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"That is why I named the child my beloved wife left behind 'Haran' (葉蘭).\"\r\n「だからこそ私は、愛する妻が残した子の名を『<r=バラン>葉蘭</r>』からとった」]])\r\n\r\nPLAY_VOICE(\"udoh_0050.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"It doesn’t need to be the leading role. It doesn’t need to stand out. Even flowers don’t need to bloom forcefully.\"\r\n「主役でなくてもいい。目立なくともいい。花だって、無理に咲かせる必要はない」]])\r\n\r\nPLAY_VOICE(\"udoh_0051.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"I hoped she would be a girl who could live harmoniously with others in any situation.\"\r\n「どのような時も、他者と寄り添い合って生きられるような、そんな女の子になって欲しいという想いを込めてね」]])\r\n\r\nLAYER_LOAD(50,\"BU_RYU02ca\")\r\nLAYER_POSITION(50,400,0)\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0895.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"M-My name carries that kind of meaning...?\"\r\n「わ、わたくしの名前に、そのような意味が……」]])\r\n\r\n    MSG([[Uran-san’s eyes widened.\r\nウランさんの目が大きく見開かれた。]])\r\n\r\n    MSG([[Still holding my hand, she looked down and began shedding large tears.\r\nそしてボクの手を握ったままうつむき、その目から大粒の涙を流し始める。]])\r\n\r\n    MSG([[As if releasing all her pent-up emotions.\r\nこれまで抑え続けてきた感情と一緒にすべて吐き出すように。]])\r\n\r\nLAYER_LOAD(50,\"BU_RYU02da\")\r\nLAYER_POSITION(50,400,0)\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0896.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Until now, I always thought... Father didn’t love me.\"\r\n「わたくしは今までずっと……お父さまに愛されていないと思っていました」]])\r\n\r\nPLAY_VOICE(\"uran_0897.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"That I was just someone to be sent to another family someday... That I was nothing to him...\"\r\n「いつか他家へ送り出す存在に過ぎないと……どうでもいいと思われているとばかり……」]])\r\n\r\n    MSG([[I gently let go of Uran-san’s hand and softly pushed her back.\r\nボクは泣き続けるウランさんの手を離し、その背中をそっと押した。]])\r\n\r\n    MSG([[Mr. Urandou held Uran-san’s hand and embraced her trembling body.\r\n龍宮院氏がウランさんの手を握り、震えた身体を抱き寄せる。]])\r\n\r\nPLAY_VOICE(\"udoh_0052.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"Fool, is there any parent who doesn’t love their daughter? Uran has always held herself back, and now she’s speaking up for herself... It makes me truly happy.\"\r\n「バカ者、娘を愛さない親がいるか。昔から自分を抑えてばかりいたウランがワガママを言ってくれて……お父さんは本当に嬉しいよ」]])\r\n\r\nPLAY_VOICE(\"udoh_0053.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"The way I encouraged her to live was my version of happiness for her. If she wants a different path, I will support her.\"\r\n「私が促した生き方は、あくまで私の考えたウランの幸せな生き方だ。オマエが別の生き方を望むのであれば、後押ししてやる」]])\r\n\r\nPLAY_VOICE(\"udoh_0054.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"If she wishes to marry that boy, I will cancel the engagement with the Rokujou family.\"\r\n「あの少年と結婚をしたいなら、六条家との約束は破談にするさ」]])\r\n\r\nLAYER_LOAD(50,\"BU_RYU02ca\")\r\nLAYER_POSITION(50,400,0)\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0898.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"I-If you do that, won’t you make enemies of the Rokujou family...? And isn’t the connection to the Juujou Group necessary?\"\r\n「そ、そんなことをすれば、六条家を敵に回すんじゃ……？　それに、十条グループとのつながりが必要なのでしょう？」]])\r\n\r\nPLAY_VOICE(\"udoh_0055.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"Compared to my daughter’s happiness, those are trivial matters. Ouga-kun is a truly wonderful man, so I would support him if I could.\"\r\n「娘の幸せと比べたら、些細な問題さ。オウガくんは本当に素晴らしい男性だから、推したいところだがね」]])\r\n\r\nPLAY_VOICE(\"udoh_0056.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"From now on, be more selfish. Don’t carry everything alone. Support and be supported by those dear to you.\"\r\n「これからはもっとワガママを言いなさい。一人で抱え込まず、大切なヒトと支え合いなさい」]])\r\n\r\nPLAY_VOICE(\"udoh_0057.wav\")\r\n    MSG([[\r\n【Urandou Ryuguuin】\r\n \"And be happy. Your mother is surely watching over you from heaven.\"\r\n「そして幸せになりなさい。オマエのお母さんも、きっと天国から見守ってくれている」]])\r\n\r\nLAYER_LOAD(50,\"BU_RYU02ea\")\r\nLAYER_POSITION(50,400,0)\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0899.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Th-Thank you very much... Father.\"\r\n「ありがとう、ございます……お父さま」]])\r\n\r\nLAYER_LOAD(50,\"\")\r\nLAYER_LOAD(55,\"\")\r\n\r\nLAYER_LOAD(LAYER_BG,\"BG006ae\")\r\n--LAYER_SCALE(LAYER_BG,200,200)\r\nLAYER_POSITION(LAYER_BG,-960,-100)\r\n\r\n    -- //BU：オウガ（笑顔）\r\nLAYER_LOAD(50,\"BU_OGA01ea\")\r\nSWITCH_SCREEN(\"mask006\",500,false)\r\n\r\n    MSG([[I left Uran-san and Mr. Urandou and approached Ouga-kun, who was watching from a distance.\r\nボクはウランさんと龍宮院氏の元から離れて、遠目から様子を見守っていたオウガくんへと歩み寄る。]])\r\n\r\nPLAY_VOICE(\"ogre_0442.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"That really stole the spotlight.\"\r\n「いいところを持っていかれてしまったな」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07fc\")\r\nPLAY_VOICE(\"erika_2118.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"That’s okay. Look, Uran-san is smiling.\"\r\n「いいんだよ。だってほら、ウランさんが笑ってる」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nLAYER_LOAD(50,\"BU_OGA01aa\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0443.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"...After parting with Minato, Mr. Urandou confided in me about Uran’s situation.\"\r\n「……ミナトと別れたあと、龍宮院氏がウランの事情を打ち明けてくれてな」]])\r\n\r\nPLAY_VOICE(\"ogre_0444.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"He carried guilt that his mother died because of him. He probably took Mr. Urandou’s words more heavily than necessary.\"\r\n「ヤツは、自分のせいで母親が死んだという罪の意識をずっと抱えていたそうだ。龍宮院氏の言葉も、必要以上に重く受け止めていたのだろう」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07da\")\r\nPLAY_VOICE(\"erika_2119.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Mr. Urandou only wanted Uran-san to be happy.\"\r\n「羽堂さんはただ、ウランさんを幸せにしたかっただけ、だったんだね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"ogre_0445.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Feelings don’t get across without words. But even when you try to say them, they don’t always reach.\"\r\n「言葉にしなければ想いは伝わらない。だが言葉にしようとしても、届かないことはある」]])\r\n\r\nLAYER_LOAD(50,\"BU_OGA01ea\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0446.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Because Minato acted as a bridge with words, this reconciliation was possible today. I think you should be proud.\"\r\n「ミナトが言葉の橋渡し役を演じたからこそ、今日の和解は実現したんだ。胸を張っていいと思うぞ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07fc\")\r\nPLAY_VOICE(\"erika_2120.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"If that’s true... I’m happy. Thank you, Ouga-kun.\"\r\n「そうだったら……嬉しいな。ありがとう、オウガくん」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07aa\")\r\nPLAY_VOICE(\"erika_2121.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"It seems Uran will be able to continue attending Yuriai Private Academy for a while. Thanks for everything, best friend.\"\r\n「まだしばらくは、百合愛学園に通えるみたいだ。これからもよろしくね、親友」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nLAYER_LOAD(50,\"BU_OGA01aa\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0447.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"You can count on me, best friend.\"\r\n「よろしく頼まれてやるさ、親友」]])\r\n\r\n    MSG([[We bumped our fists together, celebrating the success of our plan.\r\nボクらは互いの拳を打ち合わせ、二人で作戦の成功を祝うのであった。]])\r\n\r\nLAYER_LOAD(50,\"\")\r\n\r\n    -- 　　　　◆\r\nSTOP_BGM(1000)\r\nLAYER_LOAD(LAYER_BG, \"\")\r\nSWITCH_SCREEN(\"mask000\" , 1000,false)\r\nWAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"RYU_EP05_14\")\r\nend\r\n"
}