{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP05_12",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP05/RYU/EP05_12.lua",
  "Text": "function RYU_EP05_12()\r\n    -- .承-5【2月第2週】「背中合わせの告白」\r\n    SaveData.Title = \"背中合わせの告白\"\r\n\r\n    -- //CG：扉越しの逢瀬（ウランのみ）\r\n    LAYER_LOAD(LAYER_BG, \"EV035aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM06.wav\",0)\r\n\r\nPLAY_VOICE(\"uran_0853.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"It's almost been a month, hasn't it?\"\r\n「もうすぐ一ヶ月、ですか」]])\r\n\r\n    MSG([[After realizing that it's already been nearly a month since I learned the truth about Erika Ikusa... no, Minato Ikusa’s lies, my heart aches.\r\nエリカさん……いいえ、伊草ミナトさんのウソを知ってから既に一ヶ月が経とうとしていることに気付き、胸が痛みます。]])\r\n\r\nPLAY_VOICE(\"uran_0854.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Truly, the lowest person. Knowing that I can only love women, that I fear men, yet you’ve been mocking me behind my back all along.\"\r\n「本当に、最低なヒト。わたくしが女性しか愛せないことを、男性を恐れていることを知っていながら、ずっと影で嘲笑っていたのですね」]])\r\n\r\n    MSG([[Speaking words of resentment I’ve repeated countless times somehow eased the pain in my chest.\r\nもう何度口にしたかわからない恨み言を口に出すと、胸の痛みが和らぎました。]])\r\n\r\n    MSG([[This is fine. As long as I keep venting these grievances, my lingering feelings for him won’t grow inside me.\r\nこれでいい。\r\n    　こうして恨み言を吐いていれば、わたくしの中であの方への未練が膨らむことはありません。]])\r\n\r\n    MSG([[Just as my father advised, I will keep my distance from all malice within this annex until the day I marry into the Rokujou family.\r\nお父さまから薦められた通り、わたくしは六条家に嫁入りするその日まで、この別館の中であらゆる悪意から距離をとります。]])\r\n\r\n    MSG([[Because I never want to be betrayed by anyone again.\r\nもう二度と、誰かに裏切られるのはイヤですから。]])\r\n\r\n    -- //CG：夕陽の中のエリカ・ウラン\r\n    LAYER_LOAD(LAYER_BG, \"EV017aa\")\r\n    FILTER_SCREEN(2)\r\n    SWITCH_SCREEN(\"mask009\" , 1000,false)\r\n    -- //effect：セピア加工\r\n\r\n    -- //CG：扉越しの逢瀬（ウラン・涙）\r\n    LAYER_LOAD(LAYER_BG, \"EV035ab\")\r\n    FILTER_SCREEN(0)\r\n    SWITCH_SCREEN(\"mask000\" , 2000,false)\r\n\r\nPLAY_VOICE(\"uran_0855.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Uuu...\"\r\n「ううぅ……」]])\r\n\r\n    MSG([[Fond memories of Erika Ikusa flashed through my mind, and tears welled up.\r\nエリカさんとの懐かしい思い出が頭によぎって、涙があふれてきました。]])\r\n\r\n    MSG([[I don’t know how many tears I’ve shed already, but they just keep coming.\r\nもうどれほど涙を流したかわからないのに、まだあふれてくるなんて。]])\r\n\r\n    MSG([[I can’t forget even a single memory I want to forget.\r\n思い出したくない記憶のひとつだって忘れられないなんて。]])\r\n\r\n    MSG([[How inconvenient the human body is.\r\nなんて人間のカラダは不便なのでしょう。]])\r\n\r\n    MSG([[Once again, a sharp pain began in my chest. Whenever I think of Erika Ikusa, it hurts right away.\r\nまた、胸の奥が痛み始めました。\r\n    　エリカさんのことを思い出すと、すぐに痛むのです。]])\r\n\r\n    MSG([[Ah, how infuriating. I should hate him deeply, but why do I only picture that crossdressing man’s face in my head?\r\nああ、腹立たしい。\r\n    　大嫌いなはずなのに、どうしてわたくしの頭には、あの女装男の姿ばかりが浮かんでしまうのでしょうか。]])\r\n\r\nPLAY_VOICE(\"uran_0856.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"I won’t forgive you. No matter what happened, I won’t forgive you. I cannot forgive you. I will never forgive you, Minato Ikusa. Minato Ikusa. Minato, Ikusa...\"\r\n「許しません。何があったって許しません。許さない。許せない。許しませんよ、伊草ミナト。伊草ミナト。伊草、ミナト……」]])\r\n\r\n    MSG([[Hoping the pain would disappear, I repeated my grievances.\r\n胸の痛みが消えることを願って、恨み言を繰り返します。]])\r\n\r\n    MSG([[Disappear. Disappear from within me.\r\n消えて。\r\n    　わたくしの中から、消えて。]])\r\n\r\n    MSG([[Please disappear.\r\n消えて、くださいよ。]])\r\n\r\n    MSG([[Please don’t torment me any further.\r\nこれ以上、わたくしを、苦しめないでくださいまし。]])\r\n\r\nPLAY_VOICE(\"uran_0857.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Why won’t you... disappear from inside me?\"\r\n「どうしてアナタは……わたくしの中から消えてくださらないのですか」]])\r\n\r\n    MSG([[I touched the boundary between here and the outside world where he must be living healthily and continued to spew hatred.\r\n今も彼が元気に過ごしているはずの外の世界との境界に触れ、憎しみを吐き続けます。]])\r\n\r\nPLAY_VOICE(\"uran_0858.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"I hate Erika Ikusa... I loathe you! Liar! Pervert! Scoundrel! Damn you!\"\r\n「エリカさんのことなんて嫌い……大嫌いです…！　ウソつき…！　変態…！　外道…！　畜生…！」]])\r\n\r\nPLAY_VOICE(\"uran_0859.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"This is the first time I’ve ever hated someone so deeply... I never want to see your face ever again!\"\r\n「こんなにも誰かを憎らしく思ったことは初めてですよ…！　二度と顔も見たくありません…！」]])\r\n\r\nPLAY_VOICE(\"uran_0860.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"And yet...\"\r\n「それなのに……」]])\r\n\r\n    -- //CG：キスをするウラン\r\n    LAYER_LOAD(LAYER_BG, \"EV034aa\")\r\n    FILTER_SCREEN(2)\r\n    SWITCH_SCREEN(\"mask009\" , 1000,false)\r\n    -- //effect：セピア加工\r\n\r\n    -- //CG：扉越しの逢瀬（ウラン・涙）\r\n    LAYER_LOAD(LAYER_BG, \"EV035ab\")\r\n    FILTER_SCREEN(0)\r\n    SWITCH_SCREEN(\"mask000\" , 2000,false)\r\n\r\nPLAY_VOICE(\"uran_0861.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Why do I... want to see you so badly...\"\r\n「どうしてこんなにも……アナタに会いたくて仕方がないんですか……」]])\r\n\r\nPLAY_VOICE(\"uran_0862.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Erika Ikusa... I want to see you once more...\"\r\n「エリカさん……アナタに、もう一度会いたい……」]])\r\n\r\n    -- //SE：足音\r\n    SWITCH_SCREEN(\"mask000\",0,false)\r\n    PLAY_SE(\"SEa016.wav\")\r\n    WAIT(1000)\r\n\r\n    MSG([[I heard footsteps I recognized.\r\n聞き覚えのある足音がしました。]])\r\n\r\n    MSG([[Gentle enough to not even disturb the floor. They always calm my heart.\r\n床にまで配慮したように優しくて。\r\n    　いつだって心を穏やかにしてくれる。]])\r\n\r\n    MSG([[The footsteps I waited for every morning—came from beyond the door.\r\n毎朝わたくしが到着を待ち続けた足音が――扉の向こうから聞こえてきます。]])\r\n\r\n    -- //CG：扉越しの逢瀬（ハッとするウラン）\r\n    LAYER_LOAD(LAYER_BG, \"EV035ac\")\r\n    SWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\nPLAY_VOICE(\"erika_2079.wav\")\r\n    MSG([[\r\n【????】\r\n \"Uran-san, I came to see you.\"\r\n「ウランさん、アナタに会いに来ました」]])\r\n    -- //エリカ\r\n\r\n    MSG([[For the first time in a month, the pain in my chest vanished.\r\n一ヶ月ぶりに、胸の痛みが消えました。]])\r\n\r\n    -- 　　　　◆\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    -- //CG：扉越しの逢瀬（緊張するエリカ）\r\n    LAYER_LOAD(LAYER_BG, \"EV035ad\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    MSG([[Following the path taught by Ryuguuin-san.\r\n龍城院さんから教わった通りの道を抜けて。]])\r\n\r\n    MSG([[I reached the annex of the Ryuguuin estate where Uran-san is being kept.\r\nボクはウランさんが閉じ込められているという、龍宮院邸の別館へとたどり着いた。]])\r\n\r\n    MSG([[Standing before the door, I hesitated for a moment to open it. Even though I made it, would Uran-san listen to what I have to say?\r\n入り口の扉の前に立って、開けるのを一瞬躊躇する。\r\n    　たどり着けたはいいものの、果たしてウランさんはボクの話を聞いてくれるだろうか。]])\r\n\r\n    MSG([[I didn’t know if she could hear me, but I called out to her beyond the door.\r\n聞こえるかどうかわからないけれど。\r\n    　ボクは扉の向こうにいると思われるウランさんに向かって、呼びかけた。]])\r\n\r\nPLAY_VOICE(\"erika_2080.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Uran-san, I came to see you.\"\r\n「ウランさん、アナタに会いに来ました」]])\r\n\r\n    MSG([[There was no answer. After all, I didn’t know if she could hear me, and I shouldn’t expect a reply from a sudden call.\r\n返事はない。\r\n    　そもそも聞こえるかどうかわからないし、突然呼びかけて返事をしてもらえるワケもない。]])\r\n\r\n    MSG([[I nearly held my head in frustration at how foolish I was.\r\nボクは自分の頭の悪さに、思わず頭を抱えそうになってしまった。]])\r\n\r\n    MSG([[But then――\r\nところが――]])\r\n\r\nPLAY_VOICE(\"uran_0863.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"What do you want, Minato Ikusa?\"\r\n「何の用ですか？　伊草ミナトさん」]])\r\n\r\n    MSG([[Surprisingly, there was a response. Uran-san’s words were filled with anger and continued without waiting for my reply.\r\n意外にも返事はあった。\r\n    　怒気の込もったウランさんの言葉は、ボクの返事を待たずに続く。]])\r\n\r\nPLAY_VOICE(\"uran_0864.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"I don’t know whose permission you have to be there, but please leave immediately. I have no reason whatsoever to want to see you.\"\r\n「誰の許可を得てそこに立っているか知りませんが、早く帰ってくださいまし。わたくしがアナタに、会いたいワケがないでしょう」]])\r\n\r\nPLAY_VOICE(\"erika_2081.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"That’s true... I’m sorry. I have committed the worst kind of betrayal against you.\"\r\n「そうですよね……ごめんなさい。ボクはアナタに最低な裏切りをしました」]])\r\n\r\nPLAY_VOICE(\"erika_2082.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"But at least, I wanted to properly apologize to you, Uran-san. That’s why I came here today.\"\r\n「でもせめて、ウランさんにきちんと謝りたくて。ボクは今日この場にきたんです」]])\r\n\r\nPLAY_VOICE(\"uran_0865.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"I don’t want any apologies! Please leave!\"\r\n「謝罪など結構です！　帰ってくださいまし！」]])\r\n\r\n    MSG([[Strong rejection came flying from beyond the door.\r\n扉の向こうから飛んでくる強い拒絶の言葉。]])\r\n\r\n    MSG([[I expected it, but it still hurt my chest. Yet I stood here now, borrowing the strength of many people.\r\n予想はしていたけれど、胸が痛む。\r\n    　でもボクはたくさんのヒトのチカラを借りて、今この場に立っているんだ。]])\r\n\r\n    MSG([[I can’t leave without conveying my feelings properly.\r\nきちんと自分の気持ちを伝えずには帰れない。]])\r\n\r\nPLAY_VOICE(\"erika_2083.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Uran-san, do you remember the day we first met at Yuriai Private Academy?\"\r\n「ウランさん、百合愛学園で初めて出会った日のことを覚えていますか？」]])\r\n\r\nPLAY_VOICE(\"erika_2084.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"The day I met you was right after I started crossdressing to investigate the truth behind the incident that involved Marika-neesan...\"\r\n「ウランさんと出会ったのは、ボクがマリカ姉さんが巻き込まれた事件の真相を探るために女装してすぐのことで……」]])\r\n\r\nPLAY_VOICE(\"erika_2085.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"You were the first person besides Marika-neesan whose feminine charm made my heart skip a beat.\"\r\n「マリカ姉さん以外で初めて、その女性的な魅力にドキリとした相手がウランさんでした」]])\r\n\r\nPLAY_VOICE(\"erika_2086.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Because I experienced crossdressing myself, I was moved by your femininity, your refinement, your very presence. Before I knew it, you became the most special woman in my heart.\"\r\n「自分が女装を経験したからこそ、ウランさんの持つ女性らしさや教養、佇まいに感動し、気付けばボクの中で、一番特別な女性になっていったんです」]])\r\n\r\nPLAY_VOICE(\"uran_0866.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"W-What on earth are you talking about!? I’ve been telling you to leave!\"\r\n「い、一体何のお話をされているんですか！？　わたくしは先ほどから、帰って欲しいと言っているでしょう！」]])\r\n\r\nPLAY_VOICE(\"erika_2087.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Uran-san, I like you.\"\r\n「ウランさん、アナタが好きです」]])\r\n\r\nPLAY_VOICE(\"uran_0867.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"...!\"\r\n「……っ！」]])\r\n\r\n    MSG([[Finally, I was able to convey my honest feelings.\r\nボクはようやく、自分の正直な気持ちを伝えられた。]])\r\n\r\nPLAY_VOICE(\"erika_2088.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"I have told many lies. But the feelings I am sharing with you as Erika are true.\"\r\n「ボクはたくさんウソをついてきました。ですが、エリカとしてアナタに伝えた想いにウソはありません」]])\r\n\r\nPLAY_VOICE(\"erika_2089.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"I love your sun-like smile. I love your awkward expressions of affection. I love how you’re unfamiliar with foreign culture and easily clumsy.\"\r\n「アナタの太陽のような微笑みが好きです。アナタの不器用な愛情表現が好きです。海外の文化には疎くて、すぐにドジをしてしまうアナタが好きです」]])\r\n\r\nPLAY_VOICE(\"erika_2090.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"I have always acted for Marika-neesan and Yuriai Academy, but being here now is not for anyone else—it's just my selfish wish.\"\r\n「ボクはずっとマリカ姉さんや百合愛学園のためを想って行動してきましたが、今この場にいるのは誰のためでもない……ただのボクのワガママです」]])\r\n\r\nPLAY_VOICE(\"erika_2091.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"I’m sorry for hurting you until the very end... but I couldn’t help but tell you that my feelings toward you were genuine.\"\r\n「最後の最後まで、アナタを傷つけてしまってごめんなさい……でもアナタに向けた好意だけは本物だったことを、伝えずにはいられませんでした」]])\r\n\r\nPLAY_VOICE(\"erika_2092.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Goodbye, Uran-san. I will leave Yuriai Academy today, so if it’s alright, please come back to school.\"\r\n「さようなら、ウランさん。ボクは今日で百合愛学園を去りますから、もしよかったら復学してあげてください」]])\r\n\r\nPLAY_VOICE(\"erika_2093.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Everyone is waiting for your return.\"\r\n「みんな、アナタの帰りを待っていますよ」]])\r\n\r\n    MSG([[I said everything I wanted to say.\r\n言いたいことは全部言えた。]])\r\n\r\n    MSG([[Things I couldn’t say in front of everyone. But from the start, I planned to leave Yuriai Academy today.\r\nみんなの前では言えなかったことだけれど、ボクは最初から、今日で百合愛学園を去るつもりだったんだ。]])\r\n\r\n    MSG([[Because if I’m gone, Uran-san can return to school with peace of mind.\r\n何故なら、ボクがいなくなればウランさんも安心して復学できると思うから。]])\r\n\r\n    MSG([[If my disappearance can protect Yuriai Academy and Uran-san’s smile, I think that’s a wonderful thing.\r\nボクがいなくなることで百合愛学園を、そしてウランさんの笑顔を守ることができるなら、それはとても素敵なことだと思う。]])\r\n\r\nPLAY_VOICE(\"erika_2094.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Sorry for the long talk. Goodbye, Uran-san... please take care.\"\r\n「長々とごめんなさい。さようなら、ウランさん……どうかお元気で」]])\r\n\r\n    MSG([[Just as I turned to leave from the door――\r\nそう言って扉から離れようとした、その時――]])\r\n\r\nPLAY_VOICE(\"uran_0868.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Wait, please.\"\r\n「待って、くださいまし」]])\r\n\r\n    -- //CG：扉ごしの逢瀬（エリカ驚き）\r\n    LAYER_LOAD(LAYER_BG, \"EV035ae\")\r\n    SWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\nPLAY_VOICE(\"uran_0869.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"You really are a sly one... leaving a gaping hole in my heart.\"\r\n「本当に、アナタはズルい方ですわ……わたくしの心に、ぽっかりと穴を開けて」]])\r\n\r\nPLAY_VOICE(\"erika_2095.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"A hole...!? S-Sorry, did I say something awful to you again...?\"\r\n「あ、穴……！？　ご、ごめんなさい、ボクまたアナタに何かヒドいことを……！？」]])\r\n\r\nPLAY_VOICE(\"uran_0870.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Yes. You said exactly the words I never wanted to hear.\"\r\n「ええ。わたくしの一番聞きたくない言葉を言ってくださいましたわ」]])\r\n\r\n    MSG([[Uran-san’s voice changed from earlier to a calm tone as she continued.\r\nウランさんは先ほどとは打って変わって、どこか落ち着いた声で続ける。]])\r\n\r\nPLAY_VOICE(\"uran_0871.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"You started crossdressing to save Marika-sama, right?\"\r\n「アナタが女装を始めたのは……マリカ様を救うため、なのですよね？」]])\r\n\r\nPLAY_VOICE(\"erika_2096.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Y-Yes. At first, it was unavoidable to clear up a misunderstanding... but at Yuriai Academy, if you don’t get close to the 'Princesses,' you can’t get much information.\"\r\n「そ、そうです。初めは誤解を解くために仕方なくだったんですが……百合愛学園では『姫』に近づかなければ、ろくに情報を得られませんので」]])\r\n\r\nPLAY_VOICE(\"erika_2097.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"I really hated it, but I had no choice but to crossdress.\"\r\n「本当はイヤでしたけど、女装をすることになりました」]])\r\n\r\nPLAY_VOICE(\"uran_0872.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"You hated it? Deep down, you were glad to be in an all-female environment, weren’t you?\"\r\n「イヤだった？　内心、女性だらけの空間に入れて喜んでいたのではないですか？」]])\r\n\r\nPLAY_VOICE(\"erika_2098.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"N-No way! I was so worried every day that I’d be found out, I had no time to be happy about it!\"\r\n「そ、そんなワケないじゃないですか！　毎日正体がバレないか心配で心配で、喜んでいる余裕なんてありませんでしたよ！」]])\r\n\r\nPLAY_VOICE(\"uran_0873.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Is that so? I seem to recall a time when you buried your face in my chest, blushing.\"\r\n「どうでしょうか。わたくしの胸に埋もれて顔を真っ赤にしていた時があったと記憶しておりますけど？」]])\r\n\r\nPLAY_VOICE(\"erika_2099.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"T-That was because you were the one who did it! I’m still a guy, you know... even if I try to suppress it, bodily functions still happen!\"\r\n「そ、それはウランさんからしてきたんじゃないですか！　ボクだってその、お、男なんですから……抑えてはいても、生理現象は起きますよ！」]])\r\n\r\nPLAY_VOICE(\"uran_0874.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Fufu...\"\r\n「ふふ……」]])\r\n\r\nPLAY_VOICE(\"erika_2100.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"U-Uran-san?\"\r\n「う、ウランさん？」]])\r\n\r\n    -- //CG：扉ごしの逢瀬（ウラン泣き笑い・エリカ苦笑）\r\n    LAYER_LOAD(LAYER_BG, \"EV035af\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_VOICE(\"uran_0875.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Fufufu, ahahaha! Erika-san... You have such a cute face but were carrying such a struggle all this time.\"\r\n「ふふふ、あはははは！　エリカさんってば……可愛らしい顔をしてそのような葛藤をずっと抱えていらっしゃったのですね」]])\r\n\r\n    MSG([[From beyond the door came a very bright laugh.\r\n扉の向こうから、とても明るい笑い声が聞こえてきた。]])\r\n\r\n    MSG([[It wasn’t a sarcastic laugh. It was a voice so cheerful I could almost see the joyful expression.\r\n皮肉の笑いじゃない。\r\n    　声だけで楽しげな表情が伝わってくるような、そんな声。]])\r\n\r\nPLAY_VOICE(\"uran_0876.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Somehow... I’ve started to feel foolish for being so closed off. The more I listen, the more you seem exactly like the Erika-san I know so well.\"\r\n「何だか……ずっと思い詰めていた自分がバカらしくなってきました。だって話を聞けば聞くほど、アナタはわたくしのよく知るエリカさんそのままなんですもの」]])\r\n\r\nPLAY_VOICE(\"erika_2101.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"I-I’m embarrassed to hear that... but I don’t think I was very good at acting. Especially lately.\"\r\n「そ、そう言われると恥ずかしいのですが……あまり演技はできていなかったと思います。最近は特に」]])\r\n\r\nPLAY_VOICE(\"uran_0877.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Why are you leaving Yuriai Academy?\"\r\n「どうして、百合愛学園をやめてしまうのですか？」]])\r\n\r\nPLAY_VOICE(\"erika_2102.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Eh!? W-Well, as atonement for lying and hurting you and so many others...\"\r\n「え！？　そ、それはウソをついてウランさんやたくさんのヒトを傷つけたケジメとして……」]])\r\n\r\nPLAY_VOICE(\"uran_0878.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"That’s not atonement. It’s just running away.\"\r\n「それはケジメではありません。ただの逃げでしょう」]])\r\n\r\nPLAY_VOICE(\"uran_0879.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"You’re saying you’ll leave a big hole in our hearts and run away? That’s the thing I least wanted to hear.\"\r\n「アナタはわたくしたちの胸にぽっかりと大きな穴を開けたまま、逃げ去っていくというのですか？　そんな言葉、わたくしは一番聞きたくありませんでした」]])\r\n\r\nPLAY_VOICE(\"erika_2103.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Th-Then what... what do you want me to do?\"\r\n「じゃ、じゃあボクに……一体どうしろと」]])\r\n\r\nPLAY_VOICE(\"uran_0880.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"You stole many precious firsts from me, Erika-san. You have a duty to keep playing the part of Erika until the very end.\"\r\n「わたくしはエリカさんに、大切な初めてをたくさん奪われたのですよ。アナタには最後まで伊草エリカを演じる義務があります」]])\r\n\r\n    MSG([[My heart raced at those unexpected words.\r\n思わぬ言葉に胸が高鳴った。]])\r\n\r\n    MSG([[Could it be――\r\nそれって、もしかして――]])\r\n\r\nPLAY_VOICE(\"uran_0881.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"As you said, I will return to Yuriai Academy.\"\r\n「アナタの言う通り、わたくしは百合愛学園に戻ります」]])\r\n\r\nPLAY_VOICE(\"uran_0882.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"But I won’t come back unless Erika-san comes with me. Please attend Yuriai Academy together with me again.\"\r\n「ただし、エリカさんも一緒でなければ戻りません。わたくしと一緒に、また百合愛学園に通ってくださいまし」]])\r\n\r\nPLAY_VOICE(\"erika_2104.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"U-Uran-san――\"\r\n「う、ウランさん――」]])\r\n\r\n    MSG([[I flung open the obstructing door before me. To hold the hand of the person most important to me once again.\r\nボクは目の前の邪魔な扉を開け放つ。\r\n    　世界で一番大切なヒトの手を、また握るために。]])\r\n\r\n    -- 　　　　◆\r\nSTOP_BGM(1000)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"RYU_EP05_13\")\r\nend\r\n"
}