{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP05_13",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP05/RIR/EP05_13.lua",
  "Text": "function RIR_EP05_13()\r\n    -- .転-2【2月第4週】「恋は盲目、ただし嗅覚は鋭く」\r\n    SaveData.Title = \"恋は盲目、ただし嗅覚は鋭く\"\r\n\r\n    -- //BG：メインストリート（夕方）\r\n    LAYER_LOAD(LAYER_BG,\"BG019ba\")\r\n    SWITCH_SCREEN(\"mask000\",1000,false)\r\n\r\nPLAY_BGM(\"BGM01.wav\")\r\n\r\n    MSG([[After that, every day was hectic.\r\nそれからは毎日バタバタだった。]])\r\n\r\n    MSG([[During every break, we held strategy meetings including the Uran faction members to decide our future course of action.\r\n休み時間のたびにウラン派のメンバーも交えて作戦会議を行い、これからの方針を定めた。]])\r\n\r\n    MSG([[The training to be done after going home, to compete against Hermes Senpai, was also scheduled down to the minute.\r\nエルメス先輩に対抗するために、帰宅後にこなすべきトレーニングも、分刻みで決定。]])\r\n\r\n    MSG([[Even I, who usually makes an effort with beauty, was taken aback by the intensity; it made me imagine the hardships Minato-kun had endured so far.\r\n普段から美容の努力を続ける自分でも一歩引くその濃密さに、ミナトくんのこれまでの苦労が偲ばれた。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIR07ba\")\r\nPLAY_VOICE(\"lira_1220.wav\")\r\n    MSG([[\r\n【Lira】\r\nSerious (…Minato-kun is a boy, but he’s beaten the princesses many times, right?)\r\n（……ミナトくんは、男なのに姫たちに何度も打ち勝ってきたんだよね）]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIR07fa\")\r\nPLAY_VOICE(\"lira_1221.wav\")\r\n    MSG([[\r\n【Lira】\r\nWry smile, sweat (He’s really an amazing guy. I can’t lose either. I’m going to give it my all and beat Hermes Senpai.)\r\n（本当にスゴい奴だよ。アタシだって負けてらんない。死ぬ気でがんばって、エルメス先輩に勝つんだ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    -- //BG：メインストリート（夕方）\r\n    --LAYER_LOAD(LAYER_BG,\"BG019ba\")\r\n    --SWITCH_SCREEN(\"mask000\",1000)\r\n\r\n    MSG([[As I was walking down the main street lost in thought, a shadow suddenly approached.\r\nアタシがメインストリートを歩きながら考え事をしていると、ふと近づいてくる影があった。]])\r\n\r\n    -- //BU：ヒユ（通常）\r\n    LAYER_LOAD(50,\"BU_HIY01aa\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"hiyu_0415.wav\")\r\n    MSG([[\r\n【Hiyu】\r\nNormal \"Lira-san… no, I’ll call you Lira-chan like old times.\"\r\n「リラさん……いや、昔みたいに、リラちゃんって呼びますね」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIR07ca\")\r\nPLAY_VOICE(\"lira_1222.wav\")\r\n    MSG([[\r\n【Lira】\r\nSurprised \"Hiyu…?\"\r\n「ヒユ…？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"\")\r\n\r\n    -- 　　　　　◆\r\n    LAYER_LOAD(LAYER_BG, \"\")\r\nSTOP_BGM(2000)\r\n    SWITCH_SCREEN(\"mask002\" , 1000,false)\r\n\r\n    -- //BG：繁華街（夕方）\r\n    LAYER_LOAD(LAYER_BG, \"BG004ba\")\r\n    SWITCH_SCREEN(\"mask002\" , 1000,false)\r\n\r\n    -- //BU：ヒユ（通常）\r\n    LAYER_LOAD(50,\"BU_HIY01aa\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_BGM(\"BGM06.wav\")\r\n\r\n    MSG([[After school, I was visiting the busy shopping district near the station with Hiyu. How many years had it been since we went shopping together, just the two of us?\r\n学園の帰りに、アタシはヒユと一緒に駅前の繁華街を訪れていた。 二人きりで買い物なんて何年ぶりだろう。]])\r\n\r\n    MSG([[Without much conversation, we kept walking for about ten minutes.\r\n特に会話もないまま、しばらく歩き続けること十数分。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIR07aa\")\r\nPLAY_VOICE(\"lira_1223.wav\")\r\n    MSG([[\r\n【Lira】\r\nNormal \"So—what’s up? You want to ask me something, right?\"\r\n「そんでー、何の用？　アタシに何か聞きたいことでもあるんでしょう？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I asked Hiyu while browsing the shelves lined with used books outside a store.\r\nアタシは古本屋の店先に並んだ棚を物色しながら、ヒユに訊ねた。]])\r\n\r\n    MSG([[What came back was a question I hadn’t expected at all.\r\n返ってきたのは思いもしていなかった質問。]])\r\n\r\nPLAY_VOICE(\"hiyu_0416.wav\")\r\n    MSG([[\r\n【Hiyu】\r\nNormal \"Have you started dating Elder Sister Erika?\"\r\n「エリカお姉さまと付き合い始めたんですか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIR07ga\")\r\nPLAY_VOICE(\"lira_1224.wav\")\r\n    MSG([[\r\n【Lira】\r\nFlustered \"Pfft!?\"\r\n「ぶっ！？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Seeing my startled reaction to the unexpected question, Hiyu smiled as if she had guessed something.\r\n不意打ちで慌てるアタシの反応を見て、ヒユは何かを察したように笑う。]])\r\n\r\n    LAYER_LOAD(50,\"BU_HIY01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"hiyu_0417.wav\")\r\n    MSG([[\r\n【Hiyu】\r\nSmiling \"That’s good. I haven’t seen Lira-chan smile or get embarrassed so naturally in a long time.\"\r\n「よかった。リラちゃんがそんな自然に笑ったり恥ずかしがったりするの……ずっと見てなかったもん」]])\r\n\r\nPLAY_VOICE(\"hiyu_0418.wav\")\r\n    MSG([[\r\n【Hiyu】\r\nSmiling \"Before you started modeling, you were your natural self again, and I’m really happy about that.\"\r\n「モデルを始める前の、自然なリラちゃんに戻ってくれて、私、スゴく嬉しいです」]])\r\n\r\n    MSG([[Hiyu smiled at me with a gentle expression, recalling old times.\r\n昔を思い出す穏やかな笑顔で、ヒユが微笑みかけてくれた。]])\r\n\r\n    MSG([[It felt somehow nostalgic. When we entered middle school, Hiyu was the first to become friends with me.\r\n何だか懐かしい。\r\n    　中等部に入って、アタシと初めて友達になってくれたのがヒユだ。]])\r\n\r\n    MSG([[We used to go to lots of places and do all kinds of things together back then. I sort of understand why Hiyu started snapping at me.\r\n昔はよく一緒に色んな場所へ行ったし色んなことをして遊んだ。\r\n    　そんなヒユがアタシに噛みつくようになった理由は、何となくわかっている。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIR07aa\")\r\nPLAY_VOICE(\"lira_1225.wav\")\r\n    MSG([[\r\n【Lira】\r\nNormal \"Looking back now, I was pretty reckless before I lost to Erika.\"\r\n「今から考えると、エリカに負けるまでのアタシは結構ガムシャラ過ぎたよね」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIR07fa\")\r\nPLAY_VOICE(\"lira_1226.wav\")\r\n    MSG([[\r\n【Lira】\r\nWry smile, sweat \"My makeup and fashion just got flashier and flashier, so I guess it’s no wonder Hiyu came to dislike me.\"\r\n「どんどんメイクやファッションは派手になっていったし、ヒユに嫌われるのも仕方ないかなって思ってたよ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_HIY01da\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"hiyu_0419.wav\")\r\n    MSG([[\r\n【Hiyu】\r\nSad \"Yeah. To be honest, I was worried about you. It felt like you were drifting further and further from the Lira-chan I knew…\"\r\n「ええ。正直に言うと、アナタのことが心配でした。何だか、私の知っているリラちゃんから、どんどん離れていっているような気がして……」]])\r\n\r\n    -- //BU：ヒユ（苦笑）\r\n    LAYER_LOAD(50,\"BU_HIY01da\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\n    MSG([[Hiyu spoke a little awkwardly and gave a crumpled smile.\r\nヒユが少し気まずそうに語り、くしゃりと笑った。]])\r\n\r\nPLAY_VOICE(\"hiyu_0420.wav\")\r\n    MSG([[\r\n【Hiyu】\r\nWry smile \"But after the Princess Election with Elder Sister Erika, we started talking again, and I realized you hadn’t changed at all.\"\r\n「でも、エリカお姉さまとの姫選挙をきっかけに、リラちゃんとまた話すようになって、アナタが全然変わってないことに気付けたんです」]])\r\n\r\n    LAYER_LOAD(50,\"BU_HIY01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"hiyu_0421.wav\")\r\n    MSG([[\r\n【Hiyu】\r\nSmiling \"Especially these past few days since you decided to enter the Princess Imperial Election instead of Erika, I think you’ve been showing the natural smiles you had back then.\"\r\n「特に、エリカお姉さまの代わりに姫皇選挙に出るって決めてからのこの数日は、昔みたいな自然な笑顔を浮かべてると思って」]])\r\n\r\n    LAYER_LOAD(50,\"BU_HIY01ga\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"hiyu_0422.wav\")\r\n    MSG([[\r\n【Hiyu】\r\nFlustered \"S-So, uh… I thought maybe you and Elder Sister Erika had finally crossed the line! I just had to ask!\"\r\n「だ、だから、そのぉ……エリカお姉さまと遂に一線を超えたんじゃないかと思ってね！　聞かずにはいられなかったんです！」]])\r\n\r\n    MSG([[As her words gained heat and her face flushed, I gently cut her off.\r\n徐々に言葉に熱を帯びて、顔が赤くなるヒユを宥めるように、アタシは言葉を制した。]])\r\n\r\n    MSG([[Seriously… Even if our relationship improves, her delusional tendencies will probably never be cured.\r\nまったく……関係は改善できても、この子の妄想癖だけは一生直らないだろうなあ。]])\r\n\r\n    MSG([[Before she gets me wrong in some weird way again, I decided to give a measured confirmation.\r\nこれ以上、変に誤解される前に、ほどよく肯定しておいてやるとしよう。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIR07fa\")\r\nPLAY_VOICE(\"lira_1227.wav\")\r\n    MSG([[\r\n【Lira】\r\nWry smile, sweat \"Calm down! Well… you have a good nose for these things. I can’t say much, but you’re mostly right.\"\r\n「落ち着けって！　\r\n    まぁ……いい嗅覚してるわ。詳しくは言えないけど、大体合ってるとだけ言っておくね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_HIY01ma\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"hiyu_0423.wav\")\r\n    MSG([[\r\n【Hiyu】\r\nExcited \"Yessss!\"\r\n「ひゃあァっしゃー！」]])\r\n\r\n    MSG([[Hiyu gave a guts pose at my words. No, what kind of pose is that?\r\nアタシの言葉にヒユがガッツポーズをとる。\r\n    　いや、何のポーズだ、それは。]])\r\n\r\n    LAYER_LOAD(50,\"BU_HIY01mb\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"hiyu_0424.wav\")\r\n    MSG([[\r\n【Hiyu】\r\nExcited, nosebleed \"Ufufu! So Lira-san and Elder Sister Erika really are an intimate pair! I’m confident in my ability to sniff out lies! Mufu!\"\r\n「うふふ！　やっぱりリラさんとエリカお姉さまはねんごろな仲だったのですね！　私、ウソを嗅ぎ取る嗅覚には自信があるのですよ！　むふー！」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIR07fa\")\r\nPLAY_VOICE(\"lira_1228.wav\")\r\n    MSG([[\r\n【Lira】\r\nWry smile, sweat (Erika’s lying too, but is this love blindness? No… knowing her, she probably senses it.)\r\n（エリカも偽ってるんだけど、恋は盲目って奴？　いや…この子のことだから、本当は察してるのかもね）]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RIR07aa\")\r\nPLAY_VOICE(\"lira_1229.wav\")\r\n    MSG([[\r\n【Lira】\r\nNormal (She’s hiding something. She really loves Hiyu and the academy…)\r\n（エリカが何かを隠していることも。ヒユたちや学園を大好きだってことも……）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I still don’t really understand. But back then and now, she’s someone who makes me feel at ease when she’s next to me.\r\n相変わらず、よくわからない。\r\n    　だけど昔も今も、隣にいると何だか安心できるヤツだ。]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    -- //CI：リラとヒユ・継続 137\r\n    LAYER_LOAD(60,\"CI137a\")\r\n    LAYER_POSITION(60,0,-200)\r\n    LAYER_MOVE_POSITION(60,0,0,500,Ease.OutSine)\r\n    SWITCH_SCREEN(\"mask000\",500,false)\r\n\r\nLAYER_LOAD_FACE(\"BU_RIR07ia\")\r\nPLAY_VOICE(\"lira_1230.wav\")\r\n    MSG([[\r\n【Lira】\r\nWink \"Well, Hiyu, you’d better root for me too. As Erika’s most beloved ‘knight,’ I’ll stand at the top of the academy.\"\r\n「まぁヒユも応援してよね。エリカの最愛の『騎士』として、学園の頂点に立ってみせるからさ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(60,\"\")\r\n    LAYER_LOAD(50,\"BU_HIY01bb\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"hiyu_0425.wav\")\r\n    MSG([[\r\n【Hiyu】\r\nSerious, nosebleed \"I’d be satisfied if I can push Elder Sister up to be the academy’s top princess. So, I expect you to do your best.\"\r\n「私はお姉さまを学園一の姫に押し上げられれば満足です。だから、がんばってもらいますよ」]])\r\n\r\n    MSG([[Well, whatever. Because I could laugh together again like this with my first friend from this academy.\r\nまぁ何だっていいか。\r\n    　この学園で初めての友達と、またこうして笑い合うことができたのだから。]])\r\n\r\n    MSG([[I was inwardly thankful to Minato-kun for giving me the chance to mend my relationship with Hiyu.\r\nアタシは内心、ヒユとの仲を修繕するきっかけをくれたミナトくんに感謝した。]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n\r\n    -- 　　　　◆\r\nSTOP_BGM(1000)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"RIR_EP05_14\")\r\nend\r\n"
}