{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP05_07",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP05/RYU/EP05_07.lua",
  "Text": "function RYU_EP05_07()\r\n    -- .起-5【1月第4週】「献身の果てに」\r\n    SaveData.Title = \"献身の果てに\"\r\n\r\n    -- //BG：病室\r\nLAYER_LOAD(LAYER_BG, \"BG009ca\")\r\nSWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    MSG([[The night I was caught lying to Uran and rejected――\r\nウランさんにウソがバレ、拒絶された日の夜――]])\r\n\r\n    MSG([[I left the academy and went straight to the hospital room where Marika-nee was asleep.\r\nボクは学園を出たその足で、マリカ姉さんの眠る病室へとやってきていた。]])\r\n\r\nPLAY_BGM(\"BGM09.wav\")\r\n\r\n    -- //CI：005\r\nLAYER_LOAD(50,\"CI005a\")\r\nSWITCH_SCREEN(\"mask000\",1000,false)\r\n\r\n    MSG([[I thought I had finally changed from being someone who was always reliant on my sister. But I was back to square one.\r\nやっと姉さんに依存しっぱなしだった自分を変えることができたと思ったのに。\r\n    　また振り出し。]])\r\n\r\n    MSG([[To Marika-nee, who kept sleeping, I poured out words straight from the feelings welling up in my chest.\r\n眠り続けるマリカ姉さんに、ボクは胸から込み上げてくる感情のままに、言葉を吐き出していく。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01da\")\r\nPLAY_VOICE(\"erika_2014.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Marika-nee... I couldn’t protect the important person to me once again.”\r\n「マリカ姉さん……ボクはまた、自分の大切なヒトを守れなかったよ」]])\r\n\r\nPLAY_VOICE(\"erika_2015.wav\")\r\n    MSG([[\r\n【Erika】\r\n “And this time... I hurt her with my own hands.”\r\n「それも今度は……ボク自身の手で傷つけてしまったんだ」]])\r\n\r\n    MSG([[Of course, no words came back. That was fine for now. It was a relief.\r\n当然言葉は返ってこない。\r\n    　今は、それでいい。それが気楽。]])\r\n\r\n    MSG([[Because I don’t have the right to be comforted at this moment.\r\n今のボクに慰めてもらう権利なんて、ないのだから。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ja\")\r\nPLAY_VOICE(\"erika_2016.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Haha, I’m the worst, aren’t I? Really, the worst.”\r\n「はは、最低だよね、ボクって。本当に、最低だよ」]])\r\n\r\nPLAY_VOICE(\"erika_2017.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Maybe I just can’t protect anyone after all.”\r\n「やっぱりボクには、誰かを守ることなんてできないのかな」]])\r\n\r\nPLAY_VOICE(\"erika_2018.wav\")\r\n    MSG([[\r\n【Erika】\r\n “If only I were someone strong like Marika-nee, could I have protected Uran’s smile?”\r\n「ボクがマリカ姉さんみたいに強いヒトだったら、ウランさんの笑顔を守ることができたのかな」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Once again, I was painfully reminded of my weakness.\r\n改めて、自分の弱さを思い知らされた。]])\r\n\r\n    MSG([[I thought I had gotten stronger. I thought I wanted to protect Uran with my own power.\r\n少しは強くなれたと思っていたのに。\r\n    　自分のチカラで、ウランさんを守りたいと思っていたのに。]])\r\n\r\n    MSG([[I even thought I could do anything for Uran――\r\nウランさんのためなら、何だってやれるとさえ思っていたのに――]])\r\n\r\n    MSG([[Yet I, more than anyone, am the one who ends up hurting her. It’s absurd.\r\n誰よりもボク自身がウランさんを傷つけてしまうだなんて。\r\n    　あまりにも滑稽だ。]])\r\n\r\n    MSG([[I can’t help but wish to become stronger. Strong enough never to hurt anyone.\r\nもっと強く。決して誰も傷つけたりしないくらい強くなりたいと、願わずにいられない。]])\r\n\r\nPLAY_VOICE(\"dahlia_0543.wav\")\r\n    MSG([[\r\n【????】\r\n “What are you doing in a place like this, Erika-kun?”\r\n「こんなところで何をやっているんだ、エリカくん」]])\r\n    -- //ダリア\r\n\r\nLAYER_LOAD(50,\"\")\r\nSWITCH_SCREEN(\"mask000\",1000,false)\r\n\r\n    -- //BU：ダリア（真剣）\r\nLAYER_LOAD(50,\"BU_DAR01ba\")\r\nSWITCH_SCREEN(\"mask000\",500,false)\r\n\r\n    MSG([[When I turned around, Daria-san was there holding a deep red rose.\r\n振り返ると、真っ赤なバラを携えたダリアさんがそこにいた。]])\r\n\r\n    MSG([[Her expression was unusually tinged with anger.\r\nその表情には、いつになく怒りの色が滲んでいる。]])\r\n\r\nPLAY_VOICE(\"dahlia_0544.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Marika a strong person? Don’t talk about her when you know nothing.”\r\n「マリカが強い人間だと？　何も知らない癖に、彼女を語るんじゃない」]])\r\n\r\n    MSG([[Before I could even utter a surprised sound, Daria-san closed in, furious.\r\nボクが驚きの声をあげる間もなく、怒り心頭で詰め寄ってくるダリアさん。]])\r\n\r\n    MSG([[Usually, this would make me step back. But I strongly resisted her words.\r\n普段なら思わず後ずさる場面。\r\n    　でも彼女の言葉に、ボクは強く反発した。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ba\")\r\nPLAY_VOICE(\"erika_2019.wav\")\r\n    MSG([[\r\n【Erika】\r\n “W-What do you mean I know nothing? About Marika?”\r\n「な、何も知らないって、私が？　マリカのことを？」]])\r\n\r\nPLAY_VOICE(\"erika_2020.wav\")\r\n    MSG([[\r\n【Erika】\r\n “P-Please don’t say something strange! Marika and I have been together since we were little. I know everything about her!”\r\n「お、おかしなことを言わないでください！　私とマリカは幼い頃からずっと一緒だったんです、マリカのことなら何だって知っています！」]])\r\n    -- //辛うじて口調はエリカを保つものの、声は怒りすぎて声はミナト。\r\n\r\nPLAY_VOICE(\"erika_2021.wav\")\r\n    MSG([[\r\n【Erika】\r\n “How kind she is, how talented she is, and how strong she is! I know it all!”\r\n「彼女がどれほど優しいかも、どれほど才能に溢れたヒトなのかも、そしてどれほど強いヒトなのかも！　私は全部知っているんです！」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Just as I reached out to grab her, Daria-san smoothly evaded my hand and smiled provocatively.\r\nつい掴みかかろうとしてしまったボクの手をするりとかわして、ダリアさんは挑発的に笑った。]])\r\n\r\nLAYER_LOAD(50,\"BU_DAR01ea\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0545.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Oh dear. Is that anger directed at me? Don’t take it out on me.”\r\n「おやおや。その怒りは私に対してのモノかい？　八つ当たりはよしてくれたまえよ」]])\r\n\r\nLAYER_LOAD(50,\"BU_DAR01aa\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0546.wav\")\r\n    MSG([[\r\n【Daria】\r\n “If you really knew the real Marika, you wouldn’t speak like that. She was indeed ‘acting strong.’ She kept the act going until the moment she collapsed.”\r\n「本当のマリカを知っていたら先のような言葉は出てこないよ。彼女は確かに、『強い人間』を演じていた。倒れるその瞬間まで、演じ続けていた」]])\r\n\r\nLAYER_LOAD(50,\"BU_DAR01da\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0547.wav\")\r\n    MSG([[\r\n【Daria】\r\n “And because she couldn’t keep it up any longer... that’s why she collapsed. She was, like us, actually just ‘a weak person.’”\r\n「そして演じきれなくなったせいで……マリカは倒れたんだ。彼女もまた、本当は私たちと同じ『弱い人間』の一人だったんだよ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ga\")\r\nPLAY_VOICE(\"erika_2022.wav\")\r\n    MSG([[\r\n【Erika】\r\n “W-What do you mean? I don’t understand at all.”\r\n「ど、どういうことですか？　言っている意味が全然わかりません」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[For the past few moments, I haven’t understood a thing. I’ve been watching Marika-nee’s strong figure up close this whole time.\r\n先ほどから、てんで意味がわからない。\r\n    　ボクはマリカ姉さんの強い姿をずっと近くで見続けてきたんだ。]])\r\n\r\n    MSG([[There’s no way that figure was just an act.\r\nその姿が演技だなんてありえない。]])\r\n\r\nLAYER_LOAD(50,\"BU_DAR01ba\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0548.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Do you remember that I told you and Uran-kun that I’m the one who cornered Marika?”\r\n「私はキミやウランくんに、自分がマリカを追い詰めた張本人だと語ったのは覚えてるかい？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ba\")\r\nPLAY_VOICE(\"erika_2023.wav\")\r\n    MSG([[\r\n【Erika】\r\n “O-Of course. That’s why Uran confronted you in the Princess Election. But even after you apologized, she didn’t wake up, right?”\r\n「も、もちろんです。だからウランさんは、アナタと姫選挙で対決したのですから。でも、アナタが謝罪をしても目覚めなかったのでしょう？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[After Uran’s Princess Election, Daria-san apologized to Marika-nee in front of us. Still, she didn’t awaken.\r\nウランさんとの姫選挙のあと、ダリアさんにはボクたちの目の前でマリカ姉さんに謝罪をしてもらった。\r\n    　それでも、目覚めることはなかった。]])\r\n\r\n    MSG([[So Uran and I vowed together to investigate Marika-nee’s condition.\r\nだからウランさんとボクは二人で協力して、マリカ姉さんのことを調べようと誓い合ったんだ。]])\r\n\r\n    MSG([[Unfortunately, that vow can never be fulfilled now――\r\n残念ながら、その誓いを果たすことは、もう決してできないけれど――]])\r\n\r\nPLAY_VOICE(\"dahlia_0549.wav\")\r\n    MSG([[\r\n【Daria】\r\n “I tried to figure out why Marika hasn’t woken up in my own way but couldn’t understand it. But looking at you now, Erika-kun, I finally pieced it all together.”\r\n「何故マリカが目を覚まさないのか、私は私なりに考えてみたのだが、どうしてもわからなかった。だが今のエリカくんを見て、ようやくすべてを察したよ」]])\r\n\r\nPLAY_VOICE(\"dahlia_0550.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Neither you nor Marika try to face your problems alone. You sacrifice yourselves too much for others.”\r\n「エリカくんもマリカも、一人で問題を抱え込もうとするだけではない。自分という存在を、他者のために捧げ過ぎるんだ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ga\")\r\nPLAY_VOICE(\"erika_2024.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Sacrifice yourself too much...?”\r\n「自分を、捧げ過ぎる……？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[What could that mean?\r\nどういう意味だろう。]])\r\n\r\n    MSG([[People have said I often act for others, but I’ve never been told it that way.\r\n確かに他のヒトのために行動することが多いとは言われてきたけれど、そこまで言われたのは初めてだ。]])\r\n\r\n    MSG([[Seeming to see through my confusion, Daria-san gave a faint smile.\r\nボクの困惑を見透かすように、ダリアさんは微苦笑する。]])\r\n\r\nLAYER_LOAD(50,\"BU_DAR01fa\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0551.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Ha, you look like you don’t understand. I’ll explain in more detail.”\r\n「ふっ、言っている意味がわからないという顔だね。もう少し詳しく説明してあげよう」]])\r\n\r\nLAYER_LOAD(50,\"BU_DAR01aa\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0552.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Marika used to carry her worries alone, just like you and Uran-kun now. Even before Hermes appeared at the academy, she never once complained to me.”\r\n「かつてマリカも、今のエリカくんやウランくんのように、一人で悩みを抱え込んでいた。エルメスが学園に現れる以前から、私には愚痴ひとつこぼさなかったよ」]])\r\n\r\nLAYER_LOAD(50,\"BU_DAR01fc\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0553.wav\")\r\n    MSG([[\r\n【Daria】\r\n “I thought that was her strength. I believed Marika could solve every problem on her own.”\r\n「私はそれを彼女の強さだと思っていた。マリカなら自分一人ですべての問題を解決できると、私も信じていたんだ」]])\r\n\r\nLAYER_LOAD(50,\"BU_DAR01da\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0554.wav\")\r\n    MSG([[\r\n【Daria】\r\n “That trust — so careless — ultimately cornered Marika.”\r\n「その信頼という無責任こそが、将来的にマリカを追い詰めることになるとも知らずにね」]])\r\n\r\n    MSG([[The guilt Daria-san told me about just the other day.\r\nダリアさんが先日ボクに語ってくれた罪。]])\r\n\r\n    MSG([[How she was threatened by Nemesia, couldn’t help Marika-nee, and remained a bystander while fighting on the conservative side.\r\nネメシアに脅され、マリカ姉さんに協力することができず、保守派の筆頭として奮闘する彼女の傍観者でい続けたという話を思い出す。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01da\")\r\nPLAY_VOICE(\"erika_2025.wav\")\r\n    MSG([[\r\n【Erika】\r\n “I understand the feeling of wanting to believe Marika-nee will be alright... That’s how amazing she is.”\r\n「あのマリカ姉さんなら大丈夫と信じたくなる気持ちは……ボクにもわかります。それくらい、姉さんはスゴいヒトですから」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nLAYER_LOAD(50,\"BU_DAR01ba\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0555.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Yes. Marika was amazing. But that can also mean she couldn’t show weakness to others.”\r\n「そうだ。マリカはスゴいヤツだったよ。だがね、それは考えようによっては、他人に弱みを見せられないことの裏返しでもある]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ca\")\r\nPLAY_VOICE(\"erika_2026.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Couldn’t show weakness...?”\r\n「弱みを、見せられない……？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"dahlia_0556.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Exactly. Just because someone looks strong doesn’t mean they truly are. It may mean they aren’t showing their weak side.”\r\n「ああ。だってそうだろう？　強く見えるからと言って、実際に強いとは限らない。弱い部分を見せていない、という可能性だってあるじゃないか」]])\r\n\r\nLAYER_LOAD(50,\"BU_DAR01da\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0557.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Like now when you can be your true self, ‘Minato Ikusa,’ only in front of Marika.”\r\n「そう……今キミが、マリカの前でだけ素顔の“伊草ミナト”でいられるようにね」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ga\")\r\nPLAY_VOICE(\"erika_2027.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Daria-san, don’t tell me you realized who I really am...!?”\r\n「ダリアさん、まさかボクの正体に気付いて……！？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Compared to my surprise, Daria-san showed no sign of losing her composure.\r\nボクの驚きとは対照的なまでに、ダリアさんは余裕を崩さない。]])\r\n\r\n    MSG([[She continued explaining calmly but clearly.\r\n淡々と、それでいてしっかりと、説明を語り続ける。]])\r\n\r\nPLAY_VOICE(\"dahlia_0558.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Sorry, but the only one unaware in the Himegami family is Hermes. Well, I didn’t notice at first either.”\r\n「悪いが、姫神家で知らないのはエルメスくらいなものだよ。まぁ私も最初は気付かなかったがね」]])\r\n\r\nLAYER_LOAD(50,\"BU_DAR01fc\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0559.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Your cross-dressing is so excellent it’s almost like you were Marika’s twin. When I first met you at the academy, I was truly happy.”\r\n「マリカと双子なのかと思うほど素晴らしい女装だよ。学園でキミと初めて出会った時は、本当に心の底から喜んだものさ」]])\r\n\r\n    MSG([[Daria-san spoke almost self-mockingly. I remembered how eager she was when we first met.\r\n自嘲するように語るダリアさん。\r\n    　そう言えば初めて会った時、熱烈なまでに積極的なアプローチを受けたことを思い出す。]])\r\n\r\n    MSG([[At the time, her intensity shocked me. But now, knowing her relationship with Marika-nee, I understand why.\r\nあの時はその異常さに驚いたものだけれど。\r\n    　ダリアさんとマリカ姉さんの関係を知った今では、それも仕方がないと思えた。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01da\")\r\nPLAY_VOICE(\"erika_2028.wav\")\r\n    MSG([[\r\n【Erika】\r\n “But... what does not being able to show your true self to others have to do with Marika-nee’s collapse?”\r\n「ですが……他人に素の自分を出せないということと、マリカ姉さんが倒れたことに何の関係があるんですか？」]])\r\n\r\nPLAY_VOICE(\"erika_2029.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Even though Marika-nee didn’t awaken after the apology from Daria-san, the person she couldn’t show her true self to.”\r\n「素の自分を見せられなかった相手であるダリアさんの謝罪でも、マリカ姉さんは目覚めなかったんですよね？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nLAYER_LOAD(50,\"BU_DAR01aa\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0560.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Right. The apology meant nothing. I couldn’t understand what Marika was struggling with. Then I finally understood.”\r\n「ああ。謝罪しても意味がなかった。マリカが未だに何に苦しんでいるのか、理解ができなかった。そして遂に気付いたんだよ」]])\r\n\r\nLAYER_LOAD(50,\"BU_DAR01ba\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0561.wav\")\r\n    MSG([[\r\n【Daria】\r\n “The kindhearted Marika worries not about herself but about her close ones and juniors. That means Minato-kun and Uran-kun.”\r\n「他者のことばかりを心配するお人好しのマリカが気にするのは……自分ではなく身内や後輩。つまり、ミナトくんとウランくんだとね」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ga\")\r\nPLAY_VOICE(\"erika_2030.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Marika-nee worries about us...? Even though she’s still asleep!?”\r\n「マリカ姉さんが、ボクたちの心配を……！？　未だに眠り続けているのにですか！？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[As I panicked, Daria-san soothed me and continued explaining.\r\n慌てふためいたボクを宥めつつ、ダリアさんは説明を続ける。]])\r\n\r\nLAYER_LOAD(50,\"BU_DAR01fc\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0562.wav\")\r\n    MSG([[\r\n【Daria】\r\n “They say she’s conscious. You always came here to report the situation, right?”\r\n「意識はあるという話だろう？　キミはいつもこうして、マリカに現状の報告にでも来ていたんじゃないか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01da\")\r\nPLAY_VOICE(\"erika_2031.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Y-Yes... but what of it?”\r\n「そ、その通りです……ですが、それが何か？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nLAYER_LOAD(50,\"BU_DAR01aa\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0563.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Marika probably worries about you two going down the same path she did. I think that’s the emotional burden.”\r\n「マリカは恐らく、自分と同じ道を進もうとするキミたちを心配しているんだ。それが精神的な負担になっているんじゃないかと、私は考えている」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ga\")\r\nPLAY_VOICE(\"minato_1269.wav\")\r\n    MSG([[\r\n【Minato】\r\n “A-Are you saying Marika-nee won’t wake because we’re useless!?”\r\n「じゃ、じゃあマリカ姉さんが目覚めない理由は、ボクたちが不甲斐ないからだって言うんですか！？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nLAYER_LOAD(50,\"BU_DAR01ea\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0564.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Calm down. I’m only suggesting it as one possibility.”\r\n「落ち着きたまえ。あくまで可能性のひとつだと言っているだろう？」]])\r\n\r\n    MSG([[I nearly snapped back at her.\r\nつい食って掛かりそうになった。]])\r\n\r\n    MSG([[But I couldn’t entirely deny Daria-san’s possibility, and it’s true there’s no other option.\r\nただ、ダリアさんの言う可能性を否定しきれず、他に手立てがないことも事実。]])\r\n\r\n    MSG([[For now, I have no choice but to listen silently.\r\n今は黙ってダリアさんの言うことを聞く他ない。]])\r\n\r\nLAYER_LOAD(50,\"BU_DAR01aa\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0565.wav\")\r\n    MSG([[\r\n【Daria】\r\n “From the start, I thought Uran-kun and Minato-kun were similar. You’re the type to do your best for others. The kind who truly get angry only for friends.”\r\n「初めから、ウランくんとミナトくんは似ていると思っていたんだよ。他のヒトのためにこそがんばれる性質。友人のためにだけ本気で怒れる性格」]])\r\n\r\nLAYER_LOAD(50,\"BU_DAR01ea\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0566.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Above all, you have a mysterious aura that inspires hope in those around you. When I helped out so much during the Hakuyousai, it wasn’t for calculation — I was drawn to your atmosphere.”\r\n「何より、周囲に期待を持たせる不思議な雰囲気。私が白陽祭の際にあそこまで協力したのは打算ではなく、キミの雰囲気に惹かれたからさ」]])\r\n\r\nLAYER_LOAD(50,\"BU_DAR01ba\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0567.wav\")\r\n    MSG([[\r\n【Daria】\r\n “And your flaws are similar, too. You sacrifice yourselves for others but have trouble relying on others, and carry things alone.”\r\n「そして欠点も似ている。他者のために自分を捧げ過ぎる一方で他者をなかなか頼れず、すぐに抱え込む点がね」]])\r\n\r\nPLAY_VOICE(\"dahlia_0568.wav\")\r\n    MSG([[\r\n【Daria】\r\n “I’ll say this definitively. If this continues, Uran-kun and you will both follow Marika’s tragic path by being unable to handle your problems.”\r\n「断言しよう。このままでは、ウランくんもキミも、問題を抱えきれずにマリカの二の舞をたどる」]])\r\n\r\nPLAY_VOICE(\"dahlia_0569.wav\")\r\n    MSG([[\r\n【Daria】\r\n “As someone who inherits Marika’s will, I can’t overlook that. Let me help you trust each other with Uran-kun again.”\r\n「マリカの意志を継ぐ一人として、見過ごすワケにはいかない。キミがまたウランくんと信頼し合えるよう、私にも協力させてくれ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ga\")\r\nPLAY_VOICE(\"erika_2032.wav\")\r\n    MSG([[\r\n【Erika】\r\n “H-Help, you say...?”\r\n「きょ、協力と言ったって……」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Uran won’t come back to the academy anymore. Naturally, she trusts me zero.\r\nもうウランさんは学園に現れない。\r\n    　当然、彼女からボクへの信頼などゼロだ。]])\r\n\r\n    MSG([[What am I supposed to do in this situation?\r\nこの状況から一体どうすればいいというのだろう。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01da\")\r\nPLAY_VOICE(\"erika_2033.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Even if you try to help... it’s already too late. There’s nothing we can do.”\r\n「協力をしてもらおうにも……もう手遅れじゃないですか。どうすることもできないじゃないですか」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nLAYER_LOAD(50,\"BU_DAR01aa\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0570.wav\")\r\n    MSG([[\r\n【Daria】\r\n “No, not just you.”\r\n「ああ、キミ一人だけではな」]])\r\n\r\n    MSG([[Daria-san pulled out her smartphone and showed me the screen.\r\nダリアさんが自分のスマホを取り出し、画面を見せた。]])\r\n\r\n    MSG([[The LINE message screen showed unread messages from Ouga-kun and Lira-san.\r\nそこにはＲＩＮＥのメッセージ欄が映し出され、オウガくんやリラさんからの未読メッセージが通知されている。]])\r\n\r\nLAYER_LOAD(50,\"BU_DAR01ea\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0571.wav\")\r\n    MSG([[\r\n【Daria】\r\n “See? While we’re here, there are people worried about you contacting me.”\r\n「見えたかい？　今こうしている間にも、キミを心配して私にまで連絡が入っている」]])\r\n\r\n    MSG([[Daria-san smiled gently and spoke as if advising me.\r\nダリアさんは優しく破顔し、諭すように言った。]])\r\n\r\nLAYER_LOAD(50,\"BU_DAR01aa\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0572.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Marika and Uran, being exceptional, always had someone close to support them. They’re unaccustomed to being supported and suffer alone.”\r\n「マリカも、ウランくんも、なまじ優秀なばかりに。支えるべき存在が常にそばにいたが故に。誰かに支えてもらうことには不慣れで、一人苦しんでしまう」]])\r\n\r\nPLAY_VOICE(\"dahlia_0573.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Devotion only brings ruin. Just serving others leads to wearing down. True trust is when both support and serve each other.”\r\n「献身の果てには破滅しかない。相手に尽くすだけではやがて摩耗する。互いに尽くし合い、支え合えてこそ、真の信頼だろう」]])\r\n\r\nLAYER_LOAD(50,\"BU_DAR01da\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0574.wav\")\r\n    MSG([[\r\n【Daria】\r\n “I couldn’t do it. I’ve already lost the one I truly trusted. But you still have a lot of friends, don’t you?”\r\n「私には……無理だった。心から信頼できた唯一の相手を、既に失ったからね。だが、キミにはまだたくさんの仲間がいるじゃないか」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ga\")\r\nPLAY_VOICE(\"erika_2034.wav\")\r\n    MSG([[\r\n【Erika】\r\n “B-But... the rift with Uran is my problem. I can’t drag everyone at the school into it...”\r\n「で、でも……ウランさんとの確執はボクの問題ですよ。そのために、学園のみんなを巻き込んでしまうのは……」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    -- //BU：ダリア・真剣\r\nLAYER_LOAD(50,\"BUL_DAR01ba\")\r\n--LAYER_SCALE(50,150,150)\r\n--LAYER_POSITION(50,0,-400)\r\nSWITCH_SCREEN(\"mask000\",500,false)\r\n    -- //effect：ダリアが接近（肩を掴まれたように）\r\n\r\nPLAY_VOICE(\"dahlia_0575.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Be honest.”\r\n「正直になれ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01aa\")\r\nPLAY_VOICE(\"erika_2035.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Wha!?”\r\n「わ！？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Daria-san grabbed my shoulder, spoke firmly, and stared me down.\r\nダリアさんがボクの肩を掴み、語気を強め、鼻先でボクに語りかける。]])\r\n\r\nPLAY_VOICE(\"dahlia_0576.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Did you tell Uran why you were cross-dressing?”\r\n「何故キミが女装をしていたのか、ウランくんに伝えられたかい？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ca\")\r\nPLAY_VOICE(\"erika_2036.wav\")\r\n    MSG([[\r\n【Erika】\r\n “N-No. It wasn’t the right situation.”\r\n「い、いえ。そんな状況ではありませんでしたし」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"dahlia_0577.wav\")\r\n    MSG([[\r\n【Daria】\r\n “You weren’t cross-dressing with ill intent, right? Not trying to trick her? Did you tell her your true feelings?”\r\n「キミは悪意を持って女装していたワケじゃないだろう？　騙すつもりで近づいたワケじゃないだろう？　自分の気持ちをすべて伝えたのかい？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01da\")\r\nPLAY_VOICE(\"erika_2037.wav\")\r\n    MSG([[\r\n【Erika】\r\n “N-No... I haven’t told her.”\r\n「い、いえ……伝えられて、いません」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"dahlia_0578.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Did you tell her how much you care for her?”\r\n「キミがどれほどウランくんを想っているか、伝えたのかい？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01da\")\r\nPLAY_VOICE(\"erika_2038.wav\")\r\n    MSG([[\r\n【Erika】\r\n “I haven’t told her...!”\r\n「伝えて、ません…！」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Daria-san’s questions made me realize there were still many things I hadn’t told Uran.\r\nダリアさんに問われて気付いた。\r\n    　まだ、ウランさんに伝えられていないことがたくさんある。]])\r\n\r\n    MSG([[I hate the thought of never seeing her again.\r\nこのまま二度と会えないなんて、嫌だ。]])\r\n\r\n    MSG([[If I could meet Uran again, even if I wasn’t forgiven or got scolded, I wouldn’t care.\r\nもう一度ウランさんに会えるのなら、たとえ許されなくたって、どんなに罵倒されたって、構わない。]])\r\n\r\n    MSG([[Once I became aware of my true feelings, I couldn’t stop.\r\n一度自分の真意に気付いてしまうと、止めることはできなかった。]])\r\n\r\nPLAY_VOICE(\"dahlia_0579.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Don’t you want to meet Uran-kun again?”\r\n「もう一度ウランくんに会いたくないのか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ba\")\r\nPLAY_VOICE(\"erika_2039.wav\")\r\n    MSG([[\r\n【Erika】\r\n “I do! I want to meet Uran and properly tell her how I feel!”\r\n「会いたい！　ウランさんに会って、ちゃんと自分の気持ちを伝えたいです！」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nLAYER_LOAD(50,\"BU_DAR01ea\")\r\nSWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"dahlia_0580.wav\")\r\n    MSG([[\r\n【Daria】\r\n “…You said it. That’s your wish, isn’t it?”\r\n「……言えたじゃないか。それが、キミの望みだろう？」]])\r\n    -- //effect：ダリアのＢＵが元の位置に\r\n\r\nPLAY_VOICE(\"dahlia_0581.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Forget everything about Marika for now. Focus on fulfilling your own wish.”\r\n「マリカのことは一度すべて忘れたまえ。キミの中の願いの実現することだけを考えるんだ」]])\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01ib\")\r\n    DARIA_PARTICLE_02(150,0,0,100,500)\r\n\r\nPLAY_VOICE(\"dahlia_0582.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Not only me but your friends will help you for your sake.”\r\n「キミのためなら私だけじゃなく、キミの仲間たちもチカラを貸してくれるはずだからね」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ja\")\r\nPLAY_VOICE(\"erika_2040.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Th-Thank you very much.”\r\n「ありがとう、ございます」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I took Daria-san’s hand and bowed my head. I think I was overthinking things too much, just like she said.\r\nボクはダリアさんの手を取って頭を下げた。\r\n    　彼女の言う通り、きっとボクは余計なことを考え過ぎていたんだと思う。]])\r\n\r\n    MSG([[My one wish in this situation is clear.\r\n今この状況でボクの願いはひとつ。]])\r\n\r\n    MSG([[To meet Uran and pour out all my feelings.\r\nウランさんと会って、自分の気持ちをすべてぶつけることだけだ。]])\r\n\r\n    MSG([[I was able to free myself from the need to consider others or circumstances and give up.\r\n他のヒトや事情を慮って諦める必要なんてないんだと、吹っ切ることができた。]])\r\n\r\nLAYER_LOAD(50,\"BU_DAR01aa\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"dahlia_0583.wav\")\r\n    MSG([[\r\n【Daria】\r\n “Now, let’s contact the others. Things are going to get busy from here.”\r\n「さぁ、仲間たちに連絡をとろう。ココから忙しくなるぞ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ba\")\r\nPLAY_VOICE(\"erika_2041.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Yes…!”\r\n「はい…！」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nSWITCH_SCREEN(\"mask000\",0,false)\r\nLAYER_MOVE_POSITION(50,200,0,500,Ease.InSine)\r\nLAYER_MOVE_ALPHA(50,0,500,Ease.InSine)\r\nWAIT(500)\r\nLAYER_LOAD(50,\"\")\r\n\r\n    MSG([[Then, I left Marika-nee’s hospital room together with Daria-san.\r\nそしてボクはダリアさんと共にマリカ姉さんの病室をあとにした。]])\r\n\r\n    MSG([[To accomplish what Marika-nee and Daria-san could not.\r\nマリカ姉さんとダリアさんが叶えられなかったことを。]])\r\n\r\n    MSG([[To convey all my feelings to the important person――\r\n大切なヒトに、想いの丈のすべてを伝えるために――]])\r\n\r\n    -- 　　　　◆\r\nSTOP_BGM(1000)\r\nLAYER_LOAD(LAYER_BG, \"\")\r\nSWITCH_SCREEN(\"mask000\" , 1000,false)\r\nWAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"RYU_EP05_08\")\r\nend\r\n"
}