{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP05_02",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP05/RYU/EP05_02.lua",
  "Text": "function RYU_EP05_02()\r\n    -- .序章-2【1月第1週】「いつか終わる幸せ」\r\n    SaveData.Title = \"いつか終わる幸せ\"\r\n\r\n    -- //BG：龍宮院邸\r\nLAYER_LOAD(LAYER_BG, \"BG006aa\")\r\nFILTER_SCREEN(2)\r\nSWITCH_SCREEN(\"mask009\" , 1000,false)\r\n    -- //effect：セピア加工\r\n\r\nPLAY_BGM(\"BGM09.wav\",0)\r\n\r\nPLAY_VOICE(\"uran_0790.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"When speaking about the Ryuguuin family's educational policies, I must quote a saying that has been passed down through our bloodline for generations.\"\r\n「龍宮院家の教育方針について語ろうとすると、わたくしたちの血族に古くから伝わる言葉を引用しなければならないでしょう」]])\r\n\r\nPLAY_VOICE(\"uran_0791.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"It is the phrase, 'A woman must devote herself completely.'\"\r\n「それは『女、須らく身を尽くすべし』という言葉です」]])\r\n\r\nPLAY_VOICE(\"uran_0792_1.0.1.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"Apparently, it originates from a Confucian scholar who named the Ryuguuin family, and my family has followed this phrase faithfully, providing girls with a thorough education whenever they are born.\"\r\n「何でも、『龍宮院』という家名を名付けた儒学者の言葉だそうで、わたくしの家系は代々その言葉に従い、女の子が生まれた場合は徹底的な教育を施しました」]])\r\n\r\nPLAY_VOICE(\"uran_0793.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"That high standard of education resulted in sending out good wives who support their husbands both mentally and physically, enabling the Ryuguuin family to form blood ties across many fields.\"\r\n「その高水準な教育は、夫を心身ともに支える良妻を送り出す結果に繋がり、龍宮院家は各界と血の結びつきを得ることができたとされています」]])\r\n\r\n    -- //BG：繁華街\r\nLAYER_LOAD(LAYER_BG, \"BG004aa\")\r\nFILTER_SCREEN(0)\r\nSWITCH_SCREEN(\"mask009\" , 1000,false)\r\n    -- //BU：ウラン（通常）\r\nLAYER_LOAD(50,\"BU_RYU01aa\")\r\nSWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ca\")\r\nPLAY_VOICE(\"erika_1944.wav\")\r\n    MSG([[\r\n【Erika】\r\nSurprised \"A political marriage, you mean...?\"\r\n驚き\r\n    「政略結婚、というモノですか……？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"uran_0794.wav\")\r\n    MSG([[\r\n【Uran】\r\nNormal \"Yes. To put it simply, that's exactly right.\"\r\n通常\r\n    「ええ。一言で言えばその通りです」]])\r\n\r\nPLAY_VOICE(\"uran_0795.wav\")\r\n    MSG([[\r\n【Uran】\r\nNormal \"The 'Ryuguya,' which began as a traveler’s inn during the Sengoku period, is now renowned as a long-established restaurant, but just running a restaurant alone would have limited its growth.\"\r\n通常 「戦国時代に旅の宿として始まった『龍宮屋』は、現在まで老舗の料亭として名を馳せていますが、料亭を構えるのみでは業績が伸び悩んでいたことでしょう」]])\r\n\r\nPLAY_VOICE(\"uran_0796.wav\")\r\n    MSG([[\r\n【Uran】\r\nNormal \"By expanding the business through diplomacy using daughters, it grew from a mere eatery to the head of the food service industry, Ryugu Holdings.\"\r\n通常 「娘を用いた外交によって事業を拡大し、一介の料亭から外食産業の長『龍宮ホールディングス』へと成長を遂げていったのです」]])\r\n\r\nPLAY_VOICE(\"uran_0797.wav\")\r\n    MSG([[\r\n【Uran】\r\nNormal \"And I, too, have received education from a young age to ensure I do not fall out of the Ryuguuin family lineage.\"\r\n通常\r\n    「そしてわたくしも、その龍宮院家の系譜から漏れぬよう、幼い頃から教育を受けてきました」]])\r\n\r\nLAYER_LOAD(50,\"\")\r\n\r\n    -- //CG：着飾されたウラン\r\nLAYER_LOAD(LAYER_BG, \"EV016aa\")\r\nSWITCH_SCREEN(\"mask010\" , 1000,false)\r\n\r\nPLAY_VOICE(\"uran_0798.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"By the time I became aware, I was appointed as a bridge to the Jujo Group, the one with the longest history among the six major groups.\"\r\n「わたくしは物心がつく頃には、６大グループの中で最も長い歴史を持つ十条グループとの橋渡し役に任命されました」]])\r\n\r\nPLAY_VOICE(\"uran_0799.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"In other words, an engagement was determined with an influential figure from the Jujo Group.\"\r\n「それはつまり、十条グループの有力者との婚約が定められたということです」]])\r\n\r\nPLAY_VOICE(\"erika_1945.wav\")\r\n    MSG([[\r\n【Erika】\r\nPanicked \"W-was your marriage already decided when you were so young?! You couldn’t have made any decisions yourself!\"\r\n焦り\r\n    「そ、そんな幼い頃にはもう結婚が決められていたんですか！？　本人には判断がつかないでしょう！」]])\r\n\r\nPLAY_VOICE(\"uran_0800.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"It’s not for the person to decide. The role of deciding belongs to the family; the individual's will does not matter.\"\r\n「本人が判断することではないのですよ。 判断する役目は実家が務めますから、本人の意思など関係ありません」]])\r\n\r\nPLAY_VOICE(\"uran_0801.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"When I graduate from Yuriai Private Academy, I am prepared to go through the marriage procedures with the partner my family has chosen, without any objections, just as told.\"\r\n「わたくしがこの百合愛学園を卒業した暁には、何の反論もせず、ただ言われるがまま、実家の決めた将来の相手との結婚の手続きを済ませる覚悟でした」]])\r\n\r\nPLAY_VOICE(\"erika_1946.wav\")\r\n    MSG([[\r\n【Erika】\r\nPanicked \"S-so right after graduation, marriage...? And without your own will in the matter?\"\r\n焦り\r\n    「そ、卒業後には、すぐに結婚……？　しかも、本人の意思とは無関係に？」]])\r\n\r\nPLAY_VOICE(\"erika_1947.wav\")\r\n    MSG([[\r\n【Erika】\r\nSerious \"That’s wrong! What do they think Uran-san’s life is? She wasn’t born just to continue the family line!\"\r\n真剣\r\n    「そんなの間違ってます！　一体ウランさんの人生を何だと思っているんですか？　一族繁栄のために生まれてきたワケではないんですよ！」]])\r\n\r\n    -- //BG：繁華街\r\nLAYER_LOAD(LAYER_BG, \"BG004aa\")\r\nSWITCH_SCREEN(\"mask009\" , 1000,false)\r\n    -- //BU：ウラン（悲しみ）\r\nLAYER_LOAD(50,\"BU_RYU01da\")\r\nSWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"uran_0802.wav\")\r\n    MSG([[\r\n【Uran】\r\nSad \"Thank you for your kind words, Erika-san. However... those objections would not carry weight with them.\"\r\n悲しみ\r\n    「嬉しいお言葉をありがとうございます、エリカさん。ですが……そのような反論が通じる相手ではありません」]])\r\n\r\nPLAY_VOICE(\"uran_0803.wav\")\r\n    MSG([[\r\n【Uran】\r\nSad \"Artificial flowers that do not bloom by their own will tend to feel bland. Still, there are always some people in the world who are satisfied with that kind of charm.\"\r\n悲しみ 「自らの意志で花を咲かせない造花は、どうしても味気ないものになってしまうでしょう。それでも、その魅力に満足する方々も世には一定数いるのです」]])\r\n\r\nLAYER_LOAD(50,\"BU_RYU01aa\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0804.wav\")\r\n    MSG([[\r\n【Uran】\r\nNormal \"Supply arises because there is demand. If there were none, the Ryuguuin family wouldn’t raise daughters like us.\"\r\n通常\r\n    「需要があるから供給が生まれる。求められていなければ、龍宮院家だってわたくしたちのような娘は育てないでしょう」]])\r\n\r\nLAYER_LOAD(50,\"BU_RYU01fc\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0805.wav\")\r\n    MSG([[\r\n【Uran】\r\nBitter smile \"There are apparently mountains of people who want me as their wife. Hehe... I’m curious what would happen if they got to know my true personality.\"\r\n苦笑 「わたくしを妻に欲しがる方は山のようにいるそうですよ。ふふ……わたくしの素の人間性を知ったら、どうなるか、気になるものですけれどね」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01da\")\r\nPLAY_VOICE(\"erika_1948.wav\")\r\n    MSG([[\r\n【Erika】\r\nSad \"Just because there’s demand… treating your daughter like a product. I just can’t understand it or forgive it.\"\r\n悲しみ\r\n    「求められているからって……自分の娘をまるで商品みたいに扱って。私にはどうしたって理解できませんし許せません」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nLAYER_LOAD(50,\"BU_RYU01aa\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0806.wav\")\r\n    MSG([[\r\n【Uran】\r\nNormal \"That idea is reflected even in my name, have you noticed?\"\r\n通常\r\n    「わたくしの名前にもその考えは反映されているのですが、お気付きですか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ca\")\r\nPLAY_VOICE(\"erika_1949.wav\")\r\n    MSG([[\r\n【Erika】\r\nSurprised \"Huh? You mean the name 'Uran'? It’s written with the kanji for 'feather' and 'orchid,' right?\"\r\n驚き\r\n    「え、『ウラン』というお名前のことですか？　羽の蘭と書いて、ウランと読むのですよね？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"uran_0807.wav\")\r\n    MSG([[\r\n【Uran】\r\nNormal \"Yes. But the original reading of this name is '<r=ハラン>羽蘭</r>'. It carries the wish that I live like the '<r=はらん>葉蘭</r>' from which it originated.\"\r\n通常 「ええ。ですが、この名前の本来の読み方は『<r=ハラン>羽蘭</r>』。由来となった『<r=はらん>葉蘭</r>』のように生きていくよう命じる気持ちが込められているのですよ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ca\")\r\nPLAY_VOICE(\"erika_1950.wav\")\r\n    MSG([[\r\n【Erika】\r\nSurprised \"Ha, Horan...? I’ve never heard of that flower.\"\r\n驚き\r\n    「は、葉蘭……？　聞いたことがないお花ですね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nLAYER_LOAD(50,\"BU_RYU01ea\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0808.wav\")\r\n    MSG([[\r\n【Uran】\r\nSmiling \"Erika-san must have seen it at least once. Horan—which is also called 'baran'—is used as decoration in sushi and bento boxes.\"\r\n笑顔 「エリカさんも一度は見たことがあるはずですよ。葉蘭――『バラン』とも呼ばれるその植物は、寿司や弁当の飾りとして使われていますから」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ga\")\r\nPLAY_VOICE(\"erika_1951.wav\")\r\n    MSG([[\r\n【Erika】\r\nPanicked \"Ba-baran? The green jagged thing in sushi lunch boxes?\"\r\n焦り\r\n    「バ、バランって、あのお寿司のお弁当に入っている緑のギザギザしたのですか？」]])\r\n\r\nPLAY_VOICE(\"erika_1952.wav\")\r\n    MSG([[\r\n【Erika】\r\nPanicked \"I’ve only ever seen the plastic ones, but was that originally a real plant?\"\r\n焦り\r\n    「プラスチックでできたものしか見たことがなかったのですが、もしかしてアレって、元々は本当の植物が使われていたんですか？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nLAYER_LOAD(50,\"BU_RYU01aa\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0809.wav\")\r\n    MSG([[\r\n【Uran】\r\nNormal \"Yes, exactly that baran. As with you, Erika-san, many people don’t know that decoration comes from an actual plant.\"\r\n通常\r\n    「ええ、まさしくそのバランですわ。エリカさんもそうであったように、あの飾りが植物由来のモノだと知らない方は少なくないでしょう」]])\r\n\r\nPLAY_VOICE(\"uran_0810.wav\")\r\n    MSG([[\r\n【Uran】\r\nNormal \"Even fewer have actually seen the flower itself.\"\r\n通常\r\n    「まして、その花を見たことがある方は更に少ないはずです」]])\r\n\r\nPLAY_VOICE(\"uran_0811.wav\")\r\n    MSG([[\r\n【Uran】\r\nNormal \"It keeps its beauty within, neither standing out nor asserting itself, only making others shine. Baran is precisely how the Ryuguuin family idealizes a daughter's way of life.\"\r\n通常 「自分の美しさは内に秘め、目立たず主張せず、ただ他者を際立たせる存在。バランとはまさしく、龍宮院家が理想とする娘の生き方そのものなのです」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01da\")\r\nPLAY_VOICE(\"erika_1953.wav\")\r\n    MSG([[\r\n【Erika】\r\nSad \"...Uran-san, is living like that really okay?\"\r\n悲しみ\r\n    「……ウランさんは、そんな生き方でいいんですか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ba\")\r\nPLAY_VOICE(\"erika_1954.wav\")\r\n    MSG([[\r\n【Erika】\r\nSerious \"Don’t you want to live your own life freely, just like everyone else, for the things you love?\"\r\n真剣\r\n    「他の皆さんのように自分の人生を自由に、好きなことのために生きたいとは思わないんですか？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nLAYER_LOAD(50,\"BU_RYU01da\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0812.wav\")\r\n    MSG([[\r\n【Uran】\r\nSad \"That, is...\"\r\n悲しみ\r\n    「それ、は…………」]])\r\n\r\n    MSG([[Uran-san faltered in her answer, her expression clouding as if troubled.\r\nウランさんは回答に詰まり、困ったように表情を曇らせた。]])\r\n\r\nPLAY_VOICE(\"uran_0813.wav\")\r\n    MSG([[\r\n【Uran】\r\nSad \"I do not intend to deny my family’s teachings. If the Ryuguuin family has grown in that way, then I understand that obeying is the role of the eldest daughter.\"\r\n悲しみ 「実家の教えを否定する気はありませんわ。龍宮院家がそのようにして成長してきたというのでしたら、従うのが長女の役目だと理解しています」]])\r\n\r\nLAYER_LOAD(50,\"BU_RYU01aa\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0814.wav\")\r\n    MSG([[\r\n【Uran】\r\nNormal \"No, I was trying to accept it. As the eldest daughter of the Ryuguuin family, I kept telling myself I must comply with my family's customs.\"\r\n通常 「いえ、理解しようとしていました。龍宮院家の長女として生まれた以上、実家のしきたりに準ずるべきなのだと、自分に言い聞かせていたのです」]])\r\n\r\nPLAY_VOICE(\"uran_0815.wav\")\r\n    MSG([[\r\n【Uran】\r\n \"It was you... Erika-san, who changed that about me.\"\r\n「そんなわたくしを……アナタが変えてくださったのですよ、エリカさん」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ca\")\r\nPLAY_VOICE(\"erika_1955.wav\")\r\n    MSG([[\r\n【Erika】\r\nSurprised \"Huh? M-me?\"\r\n驚き\r\n    「え？　わ、私が？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nLAYER_LOAD(50,\"BU_RYU01ea\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0816.wav\")\r\n    MSG([[\r\n【Uran】\r\nSmiling \"Yes. Thanks to you, Erika-san, I decided to live selfishly at least during my school years, to love freely, and to express my honest feelings.\"\r\n笑顔 「ええ。エリカさんのおかげで、せめて学生の間はワガママに生きようと。自由に恋をし、正直な想いを伝えようと思えたのです」]])\r\n\r\nLAYER_LOAD(50,\"BU_RYU01ha\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0817.wav\")\r\n    MSG([[\r\n【Uran】\r\nBlushing \"If not for that... I wouldn’t have been able to do such a shameless thing in front of everyone.\"\r\n赤面\r\n    「そ、そうでなければ……皆さんの前であのような破廉恥な真似、で、できませんし」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ha\")\r\nPLAY_VOICE(\"erika_1956.wav\")\r\n    MSG([[\r\n【Erika】\r\nBlushing \"I-I suppose that might be true.\"\r\n赤面\r\n    「そ、それはそうかも、しれませんね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Remembering the kiss after the Princess Election, my face heats up as well.\r\n姫選挙のあとにキスしたことを思い出し、ボクも顔が熱を帯びてしまう。]])\r\n\r\n    MSG([[Even now, as lovers, that incident still makes me happily embarrassed and my head feel like it's boiling.\r\n恋人になれた今でも、あの一件は思い出すたびに嬉し恥ずかしで、頭が沸騰しそうになる。]])\r\n\r\n    MSG([[Though I was excited, I think I acted quite boldly.\r\nテンションが上がっていたとは言え、我ながら大胆な行動に出たものだと思った。]])\r\n\r\nLAYER_LOAD(50,\"BU_RYU01da\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0818.wav\")\r\n    MSG([[\r\n【Uran】\r\nSad \"...I’m sorry, Erika-san, but I will probably be taken in as a wife by the Rokujou family soon after graduating from Yuriai Private Academy.\"\r\n悲しみ 「……エリカさんには申し訳ないのですが、恐らくわたくしは百合愛学園を出て間もなく、六条家に妻として迎え入れられるでしょう」]])\r\n\r\nPLAY_VOICE(\"uran_0819.wav\")\r\n    MSG([[\r\n【Uran】\r\nSad \"It is a fate I cannot resist alone. The centuries-old Ryuguuin family arrangements cannot be defied.\"\r\n悲しみ\r\n    「それは、わたくし一人では抗いがたい定め。四百年余も続く龍宮院家の取り決めには逆らえません」]])\r\n\r\nLAYER_LOAD(50,\"BU_RYU01ea\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0820.wav\")\r\n    MSG([[\r\n【Uran】\r\nSmiling \"But as I told you before, Erika-san, it’s different while I’m here at Yuriai Private Academy. While in this birdcage, no one can bind me.\"\r\n笑顔 「ですが以前にエリカさんに語った通り、この百合愛学園にいる間は別ですわ。この鳥籠にいる間は、誰もわたくしを束縛できません」]])\r\n\r\nLAYER_LOAD(50,\"BU_RYU01ha\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0821.wav\")\r\n    MSG([[\r\n【Uran】\r\nBlushing \"As long as you’re by my side... I will never let go of your hand. You are the most important person to me.\"\r\n赤面\r\n    「エリカさんがそばにいてくれる間は……絶対にこの手を離しませんよ。アナタはわたくしにとって、何より大切な存在」]])\r\n\r\nPLAY_VOICE(\"uran_0822.wav\")\r\n    MSG([[\r\n【Uran】\r\nBlushing \"More than any man in the world, to me, you are a prince.\"\r\n赤面\r\n    「世界中のどんな男性よりも、わたくしにとっては王子様ですわ」]])\r\n\r\n    MSG([[Saying that, Uran-san enveloped my hand with hers.\r\nそう言って、ウランさんがボクの手を自らの手で包み込む。]])\r\n\r\n    MSG([[Looking at her delicate, petal-like smile, my cheeks grow warm while I feel my heart also chilling.\r\nその可憐な花弁のような笑顔を見ていると、頬が熱くなる一方で、心が冷えていくのも感じる。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01da\")\r\nPLAY_VOICE(\"erika_1957.wav\")\r\n    MSG([[\r\n【Erika】\r\nSad (If Uran-san knew I was really a boy... what would she think?)\r\n悲しみ\r\n    （ボクが本当は男だと知ったら……ウランさんはどう思うかな）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I’m deceiving Uran-san, who trusts me so deeply. It is something that can never be forgiven.\r\nこれほどまでに信頼してくれているウランさんを、ボクは騙し続けている。\r\n    　決して許される行為じゃない。]])\r\n\r\n    MSG([[Yet, I’m not sure if telling her everything is the right thing to do.\r\nただ、かと言って、すべてを打ち明けるのがいいかどうかはわからない。]])\r\n\r\n    MSG([[She wants to spend her remaining time happily, and it would be too cruel to ruin that with my lies.\r\nウランさんは残り僅かな期間をせめて幸せに過ごしたいと語っているのに、それをボクのウソで台無しにするなんてあんまりだ。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01aa\")\r\nPLAY_VOICE(\"erika_1958.wav\")\r\n    MSG([[\r\n【Erika】\r\nNormal (If I keep lying until the end, I can avoid hurting Uran-san.)\r\n通常\r\n    （最後までウソをつき続ければ、ウランさんを傷つけずに済む）]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ba\")\r\nPLAY_VOICE(\"erika_1959.wav\")\r\n    MSG([[\r\n【Erika】\r\nSerious (After all, the cause was me approaching Uran-san without serious resolve. I have to keep playing the role of the “ideal girlfriend” whenever I’m with her.)\r\n真剣 （元はと言えば、ボクが半端な覚悟でウランさんに近づいたのが原因なんだ。最後まで彼女の前だけでは、“理想の彼女”を演じ続けないと）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nLAYER_LOAD(50,\"BU_RYU01ca\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0823.wav\")\r\n    MSG([[\r\n【Uran】\r\nSurprised \"Erika-san...? Your expression looks troubled. What’s wrong?\"\r\n驚き\r\n    「エリカさん……？　険しい顔をされて、どうしたのですか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01ea\")\r\nPLAY_VOICE(\"erika_1960.wav\")\r\n    MSG([[\r\n【Erika】\r\nSmiling \"Sorry. I was just thinking that if I married a cute princess like Uran-san, I’d probably become the most targeted prince in the world.\"\r\n笑顔 「ごめんなさい。ウランさんみたいな可愛いお姫さまを娶ったら、きっと世界一命を狙われる王子になるんだろうなと思って」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nLAYER_LOAD(50,\"BU_RYU01ha\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"uran_0824.wav\")\r\n    MSG([[\r\n【Uran】\r\nBlushing \"Oh, Erika-san...\"\r\n赤面\r\n    「もう、エリカさんったら……」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01da\")\r\nPLAY_VOICE(\"erika_1961.wav\")\r\n    MSG([[\r\n【Erika】\r\nSad (I’m sorry, Uran-san. Though I lie so much, please let me stay by your side.)\r\n悲しみ\r\n    （ごめんなさい、ウランさん。ウソばかりのボクですが、そばにいさせてください）]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI01aa\")\r\nPLAY_VOICE(\"erika_1962.wav\")\r\n    MSG([[\r\n【Erika】\r\nNormal (While I’m by your side, “I” will always remain “Erika Ikusa.”)\r\n通常\r\n    （アナタの隣にいる間、“私”はずっと“伊草エリカ”であり続けますから）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I silently make a vow in my heart, careful not to let Uran-san notice.\r\nボクはウランさんに気付かれないよう、心の中で一人で覚悟を固めるのであった。]])\r\n\r\nLAYER_LOAD(50,\"\")\r\n\r\n    -- 　　　　◆\r\nLAYER_LOAD(LAYER_BG, \"\")\r\nSWITCH_SCREEN(\"mask000\" , 1000,false)\r\nWAIT_INPUT(1000)\r\n\r\n    -- //駅前（夕方）\r\nLAYER_LOAD(LAYER_BG, \"BG002ba\")\r\nSWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    -- //BU：エリカ・通常\r\nLAYER_LOAD(50,\"BU_ERI01aa\")\r\nSWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[Walking beside Erika-san, I thought about what lies ahead.\r\nエリカさんの隣を歩きながら、わたくしは今後のことを考えていました。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RYU01da\")\r\nPLAY_VOICE(\"uran_0825.wav\")\r\n    MSG([[\r\n【Uran】\r\nSad (Erika-san accepted everything I told her without prying.)\r\n悲しみ\r\n    （エリカさんはわたくしが話した事情について、詮索もせず、すべて受け入れてくださいました）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[The Ryuguuin family values are outdated. I myself, who was taught those values from a young age, must be terribly twisted.\r\n龍宮院家の価値観は時代錯誤。\r\n    　その価値観を幼い頃から教え込まれたわたくし自身も、ひどく歪んでいることでしょう。]])\r\n\r\n    MSG([[I fully understand that. But for the sake of my mother, who lost her life to give birth to me, I cannot defy those teachings.\r\nそれは、重々に承知しています。\r\n    　ですが、わたくしを産むために命を落としたお母さまのためにも、教えに背くことはできません。]])\r\n\r\nLAYER_LOAD(50,\"\")\r\n\r\n    -- //effect：セピア加工\r\n    -- //CG：着飾されたウラン\r\nLAYER_LOAD(LAYER_BG, \"EV016aa\")\r\nFILTER_SCREEN(2)\r\nSWITCH_SCREEN(\"mask010\" , 1000,false)\r\n\r\n    MSG([[My mother passed away shortly after giving birth to me.\r\nお母さまはわたくしを産んで間もなく亡くなっています。]])\r\n\r\n    MSG([[My family naturally treated me strictly, and my grandmother, who took on my education instead of my busy father, said this every day.\r\nわたくしに対する実家の当たりは当然厳しく、多忙の父に代わって教育してくださったお婆さまは、毎日のようにこう語りました。]])\r\n\r\n    MSG([[—To preserve the Ryuguuin family tradition, your mother risked her life in childbirth. —You have an obligation to protect the Ryuguuin family.\r\n――龍宮院家の伝統を守るために、アナタの母は命を賭して出産に臨んだわ。 ――アナタには龍宮院家を守る義務があるの。]])\r\n\r\n    MSG([[Those words, like a curse, still blaze in my mind and won't leave me.\r\nまるで呪詛のようなその言葉は、今でもわたくしの脳裏に焼きついて離れません。]])\r\n\r\n    MSG([[While longing for freedom, the guilt of living freely after being born at the cost of my mother’s life never disappears.\r\n自由を望む一方で、母の命と引き換えに生を受けた自分が自由に生きることへの、罪の意識が消えないのです。]])\r\n\r\n    -- //effect：なし\r\n    -- //駅前（夕方）\r\nLAYER_LOAD(LAYER_BG, \"BG002ba\")\r\nFILTER_SCREEN(0)\r\nLAYER_LOAD(50,\"BU_ERI01aa\")\r\nSWITCH_SCREEN(\"mask009\" , 1000,false)\r\n    -- //BU：エリカ・通常\r\n\r\n    MSG([[Maybe I told Erika-san everything because if she ended up hating me, it would be easier.\r\n今日エリカさんに話してしまったのは、いっそ嫌いになっていただけたら楽になるから、なのかもしれません。]])\r\n\r\n    MSG([[But she gave me an unexpected reaction.\r\nですが彼女からは、意外な反応が返ってきました。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RYU01aa\")\r\nPLAY_VOICE(\"uran_0826.wav\")\r\n    MSG([[\r\n【Uran】\r\nNormal (Though she raised questions, she showed understanding.)\r\n通常\r\n    （まさか、疑問こそ投げかけながらも、理解を示してくださるなんて）]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RYU01da\")\r\nPLAY_VOICE(\"uran_0827.wav\")\r\n    MSG([[\r\n【Uran】\r\nSad (Truly kind, warm, and wonderful... If only Erika-san were a man, would everything be solved?)\r\n悲しみ\r\n    （本当に優しくて、温かくて、素敵な方……エリカさんが男性であれば、すべては解決したのでしょうか）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[That thought flickered through my mind, and I sighed at myself.\r\nふと頭によぎった可能性に、自ら呆れて溜め息をつく。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RYU01da\")\r\nPLAY_VOICE(\"uran_0828.wav\")\r\n    MSG([[\r\n【Uran】\r\nSad (No... it’s not that simple. I was drawn to Erika-san because she’s a woman. Indeed, I showed little interest in Minato-san, who looks similar.)\r\n悲しみ （いえ……そう、単純ではありませんよね。わたくしが心惹かれたのはエリカさんが女性だからです。事実、顔の似たミナトさんにはさほど興味は涌きませんでした）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Because we are both women, I could love her. But because we are both women, we can never be united.\r\n女性同士だからこそ好きになれた。\r\n    　ですが女性同士であるために、決して結ばれない。]])\r\n\r\n    MSG([[Fate is truly cruel. If there is a God, I think He must be quite malicious.\r\n運命とは、本当に意地悪なものですね。\r\n    　神様がいるとしたら、きっと相当に底意地の悪い方なのだろうと思いました。]])\r\n\r\nLAYER_LOAD(50,\"BU_ERI01ca\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"erika_1963.wav\")\r\n    MSG([[\r\n【Erika】\r\nSurprised \"Uran-san? You’ve been staring at my face. What’s wrong?\"\r\n驚き\r\n    「ウランさん？　私の顔をじっと見つめて、どうされたんですか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RYU01ga\")\r\nPLAY_VOICE(\"uran_0829.wav\")\r\n    MSG([[\r\n【Uran】\r\nPanicked \"N-no, I’m sorry.\"\r\n焦り\r\n    「い、いえ、ごめんなさい」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_RYU01ha\")\r\nPLAY_VOICE(\"uran_0830.wav\")\r\n    MSG([[\r\n【Uran】\r\nBlushing \"I was just feeling grateful that the most beloved person is by my side.\"\r\n赤面\r\n    「……隣に最愛の方がいてくださる幸せを実感していただけ、ですから」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nLAYER_LOAD(50,\"BU_ERI01ha\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"erika_1964.wav\")\r\n    MSG([[\r\n【Erika】\r\nBlushing \"Haa...\"\r\n赤面\r\n    「はぅ……」]])\r\n\r\n    MSG([[Seeing Erika-san blush because of me made me laugh.\r\nわたくしにつられて、エリカさんの顔まで赤くなるのを見て、笑ってしまいました。]])\r\n\r\nLAYER_LOAD(50,\"\")\r\n\r\n    -- //BG：黒バック\r\nLAYER_LOAD(LAYER_BG, \"\")\r\nSWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    MSG([[There’s no need for anything special. I just want to keep loving the girl beside me as if it were ordinary and enjoy a peaceful happiness.\r\n特別なことなど不要。\r\n    　このまま隣の彼女と当たり前のように恋をし、平凡な幸せを謳歌していきたい。]])\r\n\r\n    MSG([[That is what I cannot help but wish for.\r\nそうわたくしは、願わずにはいられないのでした。]])\r\n\r\n    -- 　最終章「ボク姫様と紅蓮の契り」\r\n\r\n    -- 　　　　◆\r\nSTOP_BGM(1000)\r\nLAYER_LOAD(LAYER_BG, \"\")\r\nSWITCH_SCREEN(\"mask000\" , 1000,false)\r\nWAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"RYU_EP05_03\")\r\nend\r\n"
}