{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP05_06",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP05/ERU/EP05_06.lua",
  "Text": "function ERU_EP05_06()\r\n    -- .起-2【6年前の3月】「アルメリアの生まれた日」\r\n    SaveData.Title = \"アルメリアの生まれた日\"\r\n\r\n    -- //BG：繁華街\r\n    LAYER_LOAD(LAYER_BG,\"BG004aa\")\r\n    LAYER_LOAD(50,\"BU_CMI01aa\")\r\n    SWITCH_SCREEN(\"mask000\",1000,false,false)\r\n    -- //BU：ミナト・ショタ（通常）\r\n\r\n    PLAY_BGM(\"BGM18.wav\")\r\n\r\n    MSG([[I still remember that day vividly.\r\nあの日のことは今でも鮮明に覚えてるよ。]])\r\n\r\n    MSG([[Because it was the first time Minato and I went out alone to a faraway place.\r\nだってミナちゃんと、初めて二人きりで遠くにお出かけした日だからね。]])\r\n\r\n    MSG([[He said he wanted to find a present for his older sister, which secretly made my heart ache a little.\r\n「お姉ちゃんへのプレゼントを探したい」とか言うから、内心胸がチクチクしていたけどね。]])\r\n\r\n    MSG([[Wow, it was so much fun... Looking back, shopping just a few stations away isn’t a big deal, but to a kid, it was a grand adventure.\r\nいやー、楽しかったなぁ……今思えば、数駅先の街での買い物なんて大したことないけど、子どもにとっては大冒険だもん。]])\r\n\r\n    MSG([[We went around all sorts of shops, and I even freely voiced my preferences.\r\n色んなお店を見て回って、私も自分の好みを全開で口出ししたりしてね。]])\r\n\r\n    MSG([[By the time we were exhausted, Minato and I finally found our favorite rocket pendants.\r\n全身クタクタになったところで、やっとミナちゃんも私もお気に入りのロケットペンダントを見つけられた。]])\r\n\r\n    MSG([[Ah, giving them to Marika feels a bit lonely.\r\nあーあ、マリカにあげちゃうの、ちょっと寂しいな。]])\r\n\r\n    MSG([[I thought to myself quietly like that.\r\n私は心の中でついついそう思っちゃったっけ。]])\r\n\r\n    MSG([[Then... Minato, as if reading my mind, said this to me.\r\nそしたらね……。\r\n    　ミナちゃんは私の心でも見透かしたみたいに、こう言ってくれたの。]])\r\n\r\n    -- //BU：ミナト・ショタ（笑顔）\r\n    LAYER_LOAD(50,\"BU_CMI01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"minato_1392.wav\")\r\n    MSG([[\r\n【Minato】\r\nショタ・笑顔 \"Here you go, Alto Onee-chan. Happy birthday!\"\r\n「はい、アルトお姉ちゃん。お誕生日、おめでとう！」]])\r\n\r\n    MSG([[Eh. My birthday is completely different though.\r\nえ。\r\n    　私の誕生日は、全然違うけど。]])\r\n\r\n    MSG([[When I blinked in surprise, Minato smiled warmly and continued speaking.\r\n私が驚いて目をパチクリとさせていると、ミナちゃんはニッコリ笑って言葉を続けた。]])\r\n\r\nPLAY_VOICE(\"minato_1393.wav\")\r\n    MSG([[\r\n【Minato】\r\nショタ・笑顔 \"Actually, I prepared one more present. And that is!\\nAlto Onee-chan’s new name!\"\r\n「実はね、もうひとつプレゼントを用意してきたの。それはなんと！\r\n    　アルトお姉ちゃんの新しい名前！」]])\r\n\r\nPLAY_VOICE(\"armeria_0178.wav\")\r\n    MSG([[\r\n【Alto】\r\n \"M-My name?\"\r\n「わ、私の名前？」]])\r\n\r\nPLAY_VOICE(\"minato_1394.wav\")\r\n    MSG([[\r\n【Minato】\r\nショタ・通常 \"Yeah! Look, a long time ago, Alto Onee-chan said you didn't like your name, right? So I thought of a wonderful name for you.\"\r\n「うん！　ほら、ずーっと前だけど、アルトお姉ちゃん、自分の名前がイヤって言ってたでしょ？　だからボク、素敵な名前を考えてみたの」]])\r\n\r\nPLAY_VOICE(\"minato_1395.wav\")\r\n    MSG([[\r\n【Minato】\r\nショタ・笑顔 \"Your name from today will be 'Almeria'. It’s taken from a flower that means 'consideration', so it sounds properly girly, right?\"\r\n「お姉ちゃんの名前は今日から『アルメリア』。『思いやり』のお花からとったから、ちゃんと女の子らしいでしょう？」]])\r\n\r\nPLAY_VOICE(\"minato_1396.wav\")\r\n    MSG([[\r\n【Minato】\r\nショタ・笑顔 \"From today, I’ll call you 'Almeria'! Please use the name 'Almeria' when you’re with me too!\"\r\n「ボクは今日からお姉ちゃんのことを、『アルメリア』ちゃんって呼ぶから！　お姉ちゃんもボクと一緒にいる時は『アルメリア』って名乗ってね」]])\r\n\r\nPLAY_VOICE(\"armeria_0179.wav\")\r\n    MSG([[\r\n【Alto】\r\n \"Al-me-ria. Almeria... hehe, it’s a lovely name.\"\r\n「アル、メリア。アルメリア……ふふ、素敵な名前だね」]])\r\n\r\n    MSG([[I was so moved by an unexpected present that I lost my words.\r\n思ってもみなかったプレゼントに、私は感極まってしまって、言葉を失った。]])\r\n\r\n    MSG([[Because a name taken from such a rare flower isn’t something a kid Minato’s age could easily come up with.\r\nだって『アルメリア』なんて珍しい花からとった名前、ミナトくんの年齢の子が、簡単に思いつけるワケないもの。]])\r\n\r\n    MSG([[He must have researched a lot.\r\nきっといっぱい調べてくれたに違いない。\r\n    　たくさん頭を悩ませてくれたに違いない。]])\r\n\r\n    MSG([[He must have struggled with it a lot.\r\nパパやママには申し訳ないけれど……私にはこの名前の方が、ずっとずっと愛情が込められているように感じられたわ。]])\r\n\r\nPLAY_VOICE(\"minato_1397.wav\")\r\n    MSG([[Though I felt sorry for Mom and Dad... to me, this name felt filled with so much more love.\r\n「ハッピーバースデー！　アルメリアちゃん！」]])\r\n\r\nPLAY_VOICE(\"armeria_0180.wav\")\r\n    MSG([[\r\n【Minato】\r\nショタ・笑顔 \"Happy birthday, Almeria-chan!\"\r\n「ありがとう、ミナちゃん。キミの言う通り、今日は私の生まれた日になったね」]])\r\n\r\n    MSG([[\r\n【Almeria】\r\n \"Thank you, Mina-chan. Just as you said, today has become the day I was born.\"\r\nその日、私は確かに生まれ変わった。\r\n    　きっと世界中で、その日一番の幸せ者は私だろうと思った。]])\r\n\r\nSTOP_BGM(500)\r\n\r\n    MSG([[That day, I was truly reborn. I thought for sure I was the happiest person in the world that day.\r\nでもその幸せは――本当に一瞬で崩れたの。]])\r\n\r\n    -- //SE：ガラスの割れる音\r\n    PLAY_SE(\"SEb050.wav\")\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\",500,false)\r\n\r\nPLAY_VOICE(\"armeria_0181.wav\")\r\n    MSG([[But that happiness — crumbled in an instant.\r\n「ミナちゃん！　危ない！」]])\r\n\r\nPLAY_VOICE(\"minato_1398.wav\")\r\n    MSG([[\r\n【Almeria】\r\n \"Mina-chan! Watch out!\"\r\n「あ、アルトお姉ちゃん――」]])\r\n\r\n    -- //SE：血の音\r\n    PLAY_SE(\"SEb051.wav\")\r\n    WAIT(500)\r\n\r\n    MSG([[\r\n【Minato】\r\n \"Ah, Alto Onee-chan—\"\r\n運悪く。\r\n    　なんて言葉じゃ足りないくらい折りが悪く。]])\r\n\r\n    MSG([[Bad luck wouldn’t even begin to cover it.\r\nなんて言葉じゃ足りな過ぎるくらいに最凶最悪のタイミングで、大地震が起きた。]])\r\n\r\n    MSG([[No words could express how deadly and awful the timing was when the massive earthquake hit.\r\nすぐ頭上でガラスの割れる音がしたかと思うと、光の雨みたいな、大量のガラスの破片がミナちゃんへと降りかかるのが見えて。]])\r\n\r\n    MSG([[At first, I heard glass shatter right above us, then saw a shower of glass shards, like a rain of light, falling down on Minato.\r\n私はたまらず地面を蹴って。]])\r\n\r\n    MSG([[I couldn’t stand it and kicked off the ground.\r\n彼の盾になろうと両手を広げて――]])\r\n\r\n\r\n    SWITCH_SCREEN(\"mask000\",0,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    -- //BG：病室\r\n    LAYER_LOAD(LAYER_BG, \"BG009aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM09.wav\",0)\r\n\r\n    MSG([[I spread both my arms, trying to shield him—\r\nそして気付けば、全身に包帯を巻かれて病室にいたの。]])\r\n\r\n    MSG([[And before I knew it, I was in a hospital room, my entire body wrapped in bandages.\r\n最初は笑っちゃうかと思ったよ。\r\n    　だって何の冗談かと思うくらいに、全身包帯でグルグル巻きでね。]])\r\n\r\n    MSG([[At first, I thought it was funny.\r\n古いＢ級ホラー映画に出てくるミイラ男みたいだったんだもの。]])\r\n\r\n    MSG([[Because I was wrapped from head to toe in bandages like some kind of mummy.\r\nだけど、両親が見舞いに来るのを嫌がるようになってようやく、私は今の自分の姿が現実だってわかった。]])\r\n\r\n    MSG([[Like a mummy out of an old B-grade horror film.\r\n包帯を張り替える時に自分のズタズタの肌が見えるたびに、心がねじ切れそうな想いを味わったの。]])\r\n\r\n    MSG([[But when I started to hate when my parents came to visit, I finally understood that this was my reality now.\r\n生来の容姿が可愛くないことなんて些細な問題だったのね。]])\r\n\r\n    MSG([[Every time they changed my dressings and I saw my torn skin, my heart felt like it would snap.\r\nだって……今の私ではミナちゃんの隣を歩けない。\r\n    　拒絶されるかもしれないし、もし拒絶されなかったとしても隣を歩くミナちゃんまで奇異の目を向けられてしまう。]])\r\n\r\n    MSG([[Not being naturally pretty was a minor issue compared to this.\r\nずっと女の子として生きたいと願い続けて、ようやく自分を女の子として扱ってくれる人と出会えたのに。\r\n    　もうオシャレも、ショッピングも、デートも、恋愛もできない。]])\r\n\r\n    MSG([[Because now, I couldn’t walk beside Minato.\r\n――もう二度と、女の子らしく生きることなんて、叶わないんだ。]])\r\n\r\n    MSG([[He might reject me, and even if he didn’t, people would cast strange looks at Minato walking next to me.\r\n私はあまりにも滑稽な自分の境遇を呪って、毎日泣き続けた。]])\r\n\r\n    LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\",1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    -- //BG：病室（夜）\r\n    LAYER_LOAD(LAYER_BG, \"BG009ca\")\r\n    -- //BU：ネメシア（悲しみ）\r\n    LAYER_LOAD(50,\"BU_MEN01ra\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    MSG([[I had long wished to live as a girl, and finally met someone who treated me as one.\r\nそんな時に現れたのがネメシアお母さま。]])\r\n\r\n    MSG([[But now, no more dressing up, shopping, dates, or love.\r\nお母さまは私に対して、一生人目を恐れて暮らし続けるか、全身整形を施して姫神家の娘として生まれ変わるか、選択を求めたの。]])\r\n\r\n    MSG([[—I would never again live as a girl.\r\n最初は何かの詐欺だと思ったよ。]])\r\n\r\n    MSG([[I cursed my pitiful fate and cried every day without stopping.\r\n当然だよね。\r\n    　だって明らかにメリットがないもの。]])\r\n\r\n    MSG([[It was then that Nemesia Okaasama appeared.\r\nどうして有名な女優が、できそこないの上、傷だらけの化け物になった私を美少女にしたがるのか、どうしても理解できなかったわ。]])\r\n\r\n    MSG([[She gave me a choice: either live forever fearing the eyes of others, or undergo full-body plastic surgery and be reborn as a daughter of the Himegami family.\r\nでもお母さまはこう言ってくれたの。]])\r\n\r\nPLAY_VOICE(\"nemesia_0180.wav\")\r\n    MSG([[At first, I thought it was some kind of scam.\r\n「私には……アナタが必要なの。アナタみたいな子をずっと探してたわ」]])\r\n\r\n    LAYER_LOAD(50,\"BU_MEN01aa\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"nemesia_0181.wav\")\r\n    MSG([[Of course I did! Because it was clearly no benefit to me.\r\n「安心しなさい。\r\n    　私がアナタを、この世界で最高の女の子にしてあげる。\r\n    　もう誰にも、アナタを『化け物』なんて呼ばせないわ」]])\r\n\r\n    MSG([[I couldn’t understand why a famous actress would want to turn a hideous, scarred monster like me into a beautiful girl.\r\nその言葉は何よりも強く私の胸を打ったわ。]])\r\n\r\n    MSG([[But Mother said this to me.\r\nこれは、あとから知った話なのだけど。\r\n    　当時のネメシアお母さまは、ダリアお姉さまが女の子らしく生きることを望まないと知って、喪失感に打ちひしがれていたらしくてね。]])\r\n\r\n    MSG([[\r\n【Nemesia】\r\n悲しみ \"I need you... I’ve been looking for a child like you all this time.\"\r\n代わりの『娘』を探すために、『女の子らしく生きたい』と強く願う患者が入院したら連絡するよう、病院勤めの夫に言いつけていたらしいの。]])\r\n\r\n    MSG([[\r\n【Nemesia】\r\n通常 \"Don’t worry. I will make you the most beautiful girl in this world. No one will ever call you a 'monster' again.\"\r\nそこで運ばれてきたのが私。\r\n    　すべての希望を失った私を見て、自分の姿を重ねたそうよ。]])\r\n\r\n    MSG([[Those words struck my heart stronger than anything else.\r\nお母さまの言葉には何の偽りもなかった。\r\n    　だからこそ私は、彼女の提案を受け入れて、大規模な手術を受けることにしたの。]])\r\n\r\n    MSG([[I learned this story later, but at the time Nemesia Okaasama was devastated because she knew that Daria Oneesama didn’t wish to live as a girl.\r\n最高の女の子になれるなら、すべてを捧げたっていい。 今の自分なんていなくなっていい。]])\r\n\r\n    MSG([[She had instructed her hospital-employed husband to notify her if a patient who strongly wished to live as a girl was admitted, so she could find a substitute 'daughter'.\r\nまたいつか、ミナちゃんの隣を歩きたい、って。 そう思ったから。]])\r\n\r\nPLAY_VOICE(\"nemesia_0182.wav\")\r\n    MSG([[That’s how I was brought in.\r\n「アルトちゃん。手術の前に何点か確認しておきたいんだけれど――」]])\r\n\r\nPLAY_VOICE(\"armeria_0182.wav\")\r\n    MSG([[Seeing me as someone who had lost all hope, she saw herself reflected in me.\r\n「アルメリア」]])\r\n\r\nPLAY_VOICE(\"nemesia_0183.wav\")\r\n    MSG([[Mother’s words were sincere.\r\n「アル、メリア？」]])\r\n\r\nPLAY_VOICE(\"armeria_0183.wav\")\r\n    MSG([[That’s why I accepted her offer and underwent the extensive surgery.\r\n「私のことは……アルメリアと呼んでください。井上アルトは、あの大地震の日に死にましたから」]])\r\n\r\n    LAYER_LOAD(50,\"BU_MEN01ra\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"nemesia_0184.wav\")\r\n    MSG([[If I could become the best girl, I would devote everything to it.\r\n「……ええ。これからよろしくね、アルメリアちゃん」]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n\r\n    -- 　　　　◆\r\nSTOP_BGM(1000)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"ERU_EP05_07\")\r\nend\r\n"
}