{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP05_04",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP05/ERU/EP05_04.lua",
  "Text": "function ERU_EP05_04()\r\n    -- .序章-4【1月第1週】「見つかった証」\r\n    SaveData.Title = \"見つかった証\"\r\n\r\n    -- //BG：公園\r\n    LAYER_LOAD(LAYER_BG, \"BG003aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM09.wav\")\r\n\r\n    MSG([[The park I visited again after about two and a half years. When I was little, I often played here, was often bullied, and often protected.\r\nおよそ二年半ぶりに訪れた公園。\r\n    　幼い頃はよく遊び、よくイジメられ、よく守られていた。]])\r\n\r\n    MSG([[By my older sister Marika and another sister.\r\nマリカ姉さんと、もう一人の姉の手で。]])\r\n\r\n    MSG([[Knowing there's no way any clues would remain, I searched the park thoroughly.\r\n手がかりなんて残っているワケないと知りつつも、ボクは虱潰しに公園を探していく。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ba\")\r\nPLAY_VOICE(\"minato_1380.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Finally... finally, a clue.\"\r\n「やっと……やっと見つけた手がかりなんだ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[There were no other leads to follow regarding Armeria-san. With a hopeful heart, I desperately continued searching all over the park.\r\nアルメリアさんを追う手がかりはもう他にない。\r\n    　願うような気持ちで、ボクは公園内を必死に探し回り続けた。]])\r\n\r\n    MSG([[Then, at the base of a large tree, there was a fresh mark, as if someone had dug there recently.\r\nすると、大きな木の根元にまだ新しい、誰かが掘り返したような跡が残っていた。]])\r\n\r\n    MSG([[There, I remembered an important event related to that tree.\r\nそこで、その木に関して大事な出来事を思い出す。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ca\")\r\nPLAY_VOICE(\"minato_1381.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"That's right. We definitely... wished to be together even ten years from now, and buried a time capsule here back then.\"\r\n「そうだ。ボクたちは確か……十年後も一緒にいられることを願って、昔ここにタイムカプセルを埋めたんだ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    -- //SE：土を掘る音\r\n    PLAY_SE(\"SEb052.wav\")\r\n\r\n    MSG([[Not wanting to waste time looking for tools, I desperately dug into the ground with my hands. Even if my nails cracked on stones, it didn’t matter. I kept digging desperately.\r\n道具を探す手間も惜しいので、必死で手で地面を掘った。 石で爪が割れようとも関係ない。 必死になって掘り続ける。]])\r\n\r\n    MSG([[After digging for more than ten minutes. What came out from below was—a rusty cookie tin.\r\n掘り続けること十数分。\r\n    　下から出てきたのは――錆びたクッキーの箱。]])\r\n\r\n    MSG([[It seemed to have been sent to the school by a local game company, and it had a penguin drawn on it.\r\n地元のゲーム会社が学校に送ってくれたものらしくて、ペンギンが描かれている。]])\r\n\r\n    MSG([[No doubt. This was something buried long ago together with my two sisters.\r\n間違いない。\r\n    　これはその昔、二人の姉と一緒に埋めたものだ。]])\r\n\r\n    -- //SE：箱を開ける鈍い音（ガパッ）\r\n    PLAY_SE(\"SEb053.wav\")\r\n    WAIT(300)\r\n\r\n    MSG([[When I opened it, it was full of junk the kind of things kids would like.\r\n中を開くと、いかにも子どもが好きそうなガラクタがたくさん詰まっていた。]])\r\n\r\n    MSG([[But among them, there were two items that stood out.\r\nでもその中に、異彩を放つものがふたつある。]])\r\n\r\n    MSG([[They were a smartphone from about two generations ago and a photo torn in half.\r\nそれは、二世代ほど昔のスマホと、半分に破れた写真だ。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ca\")\r\nPLAY_VOICE(\"minato_1382.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"This photo is—\"\r\n「この、写真は――」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I took off the locket pendant I always wear, opened its lid, and took out the photo inside.\r\nボクは普段から身につけているロケットペンダントを取り外し、蓋を開け、中の写真を取り出した。]])\r\n\r\n    MSG([[This photo, which had always given me energy, was also torn in half, and the two pieces perfectly fit together.\r\nずっと元気をもらっていたこの写真もまた、半分に破れていて、ふたつの破片は見事に繋がる。]])\r\n\r\n    MSG([[And there, it revealed—\r\nするとそこには――]])\r\n\r\n    -- //CI：繋がった写真\r\n    LAYER_LOAD(50,\"CI159a\")\r\n    LAYER_POSITION(50,0,-200)\r\n    LAYER_MOVE_POSITION(50,0,0,500,Ease.OutSine)\r\n    SWITCH_SCREEN(\"mask000\",500,false)\r\n\r\n    MSG([[Me smiling between my two sisters.\r\n二人の姉に挟まれて笑う、ボクの姿が浮かび上がった。]])\r\n\r\n    MSG([[Looking at the other sister holding my hand, I laughed with tears.\r\n自分の手を握るもう一人の姉を見て、ボクは涙を流して笑う。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN03ja\")\r\nPLAY_VOICE(\"minato_plus0023.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"I finally found you... Sister Armeria.\"\r\n「やっと見つけたよ……アルメリアお姉ちゃん」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[The child in the photo was Armeria-san.\r\nその写真に写る子どもこそアルメリアさん。]])\r\n\r\n    MSG([[She was my other sister, born into the complicated circumstances of “Aruto Inoue.”\r\n『井上アルト』という複雑な境遇の元に生まれた、ボクのもう一人の姉さんであった。]])\r\n\r\n    -- 　最終章「ボク姫様と乙女主義」\r\n\r\n    -- 24\tもうひとりのお姉ちゃん\tアルメリアとの思い出を思い出した\r\n    UNLOCK_TROPHY(24)\r\n\r\n    -- 　　　　◆\r\nSTOP_BGM(1000)\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"ERU_EP05_05\")\r\nend\r\n"
}