{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP05_08",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP05/ERU/EP05_08.lua",
  "Text": "function ERU_EP05_08()\r\n    -- .起-4【1年前の4月】「見つけてくれて、ありがとう」\r\n    SaveData.Title = \"見つけてくれて、ありがとう\"\r\n\r\n    -- //BG：屋上\r\n    LAYER_LOAD(LAYER_BG, \"BG017aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM09.wav\",0)\r\n\r\n    MSG([[The day of the entrance ceremony.\r\n入学式の日。]])\r\n    -- //第1話でのミナトとの出会い\r\n\r\n    MSG([[Alone on the rooftop where I last spoke with Marika, I silently said goodbye in my heart to the siblings who had always protected me.\r\n私はマリカと最後に話した屋上で一人、自分を守り続けてくれた姉弟に心の中で別れを告げていた。]])\r\n\r\n    MSG([[Having two personalities, Hermes and myself, was apparently dangerous.\r\n私とエルメス、ふたつの人格がある状態は危険だそうで。]])\r\n\r\n    MSG([[I had been told long ago that eventually, I would have to be absorbed into Hermes’ personality.\r\nいつかエルメスの人格に取り込まれなければいけないことは、前々から聞かされていた。]])\r\n\r\n    MSG([[But still, the thought of my own personality disappearing made me uneasy, and I couldn’t bring myself to do it. Hurting Marika was a good reason to take that step.\r\nでもやっぱり、自分の人格が消えてしまうのは流石に不安で、なかなか実行には踏み出せずにいた。 マリカを傷つけたことはいいきっかけ。]])\r\n\r\n    MSG([[I thought it would be better if someone like me, who had been troubling others since childhood, just disappeared.\r\n幼い頃から周囲に迷惑をかけ続けてきた私なんか消えてしまった方がいいって。]])\r\n\r\n    MSG([[Finally, I was able to make up my mind to be integrated into “Hermes.”\r\nようやく「エルメス」に統合される決意を固められたんだ。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ARU01aa\")\r\nPLAY_VOICE(\"armeria_0205.wav\")\r\n    MSG([[\r\n【Almeria】\r\nNormal \"...I wonder if Mina-chan is doing well.\"\r\n通常\r\n    「……ミナちゃん、元気かな」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[If there was one thing I still regretted, it was that I hadn’t yet reunited with Mina-chan.\r\n唯一心残りがあるとすれば、まだミナちゃんに再会できていないことだった。]])\r\n\r\n    MSG([[I knew. Even if we reunited, nothing would change.\r\nわかっている。\r\n    　再会できたところで、何かが変わるワケじゃない。]])\r\n\r\n    MSG([[In my current form, which bears no trace of the past, even Marika wouldn’t recognize me.\r\n昔の面影が一切ない今の姿じゃ、マリカにだって気付いてもらえなかったんだ。]])\r\n\r\n    MSG([[Even Mina-chan would see me only as “Hermes Himegami.” There’s no way he’d realize I’m “Almeria.” It would only end in more despair.\r\nミナちゃんだって再会しても「姫神エルメス」だとしか思わない。\r\n    　「アルメリア」だと気付いてもらえるワケがない。更に絶望して終わりだ。]])\r\n\r\n    MSG([[Since reuniting would just bring more sadness, I decided to say farewell to this hateful world.\r\nどうせ再会できても余計に悲しむことになるのだから、この大嫌いな世界にはもうお別れを告げよう。]])\r\n\r\n    MSG([[With that thought, I kept watching Yuriai Private Academy from the rooftop.\r\nそう思って、私は屋上から百合愛学園を眺め続けた。]])\r\n\r\n    MSG([[But then, at that very moment――\r\nだけどそんなタイミングで――]])\r\n\r\n    SWITCH_SCREEN(\"mask000\",0,false)\r\nSTOP_BGM(2000)\r\n\r\n    -- //SE：ドアノブの回る音（ガチャ）\r\nPLAY_SE(\"SEb005.wav\")\r\nWAIT(500)\r\n\r\n    -- //CG：謎の少女との邂逅\r\n    LAYER_LOAD(LAYER_BG, \"EV002aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    -- //BG：屋上\r\n    LAYER_LOAD(LAYER_BG, \"BG017aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    -- //BU：ミナト（驚き）\r\n    LAYER_LOAD(50,\"BU_MIN01ca\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"minato_1399.wav\")\r\n    MSG([[\r\n【Minato】\r\nSurprised \"...Huh?\"\r\n驚き\r\n    「……え？」]])\r\n\r\n    MSG([[I met Mina-chan again.\r\n私は、ミナちゃんと再会した。]])\r\n\r\nPLAY_VOICE(\"minato_1400.wav\")\r\n    MSG([[\r\n【Minato】\r\nSurprised \"We've... met somewhere before, right...?\"\r\n驚き\r\n    「ボクたち……どこかで会ってますよね…？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ARU01ca\")\r\nPLAY_VOICE(\"armeria_0206.wav\")\r\n    MSG([[\r\n【Almeria】\r\nSurprised \"...Eh?\"\r\n驚き\r\n    「……えっ？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[He probably didn’t fully realize it. Still, with just one look, he understood I was there.\r\nきっと完全には気付けてなんていない。\r\n    　それでも彼は、一目で私がいることを理解してくれた。]])\r\n\r\n    MSG([[He found the existence of “Almeria,” who should have vanished from everyone’s memory.\r\nもう誰の記憶にも残っていないはずの「アルメリア」という存在を見つけてくれた。]])\r\n\r\n    MSG([[The feelings I had suppressed for Mina-chan burst forth like a dam breaking, and I couldn’t control them anymore.\r\n押し殺していたミナちゃんへの想いが堰を切って溢れ、もう抑えがつけられなくなった。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ARU01da\")\r\nPLAY_VOICE(\"armeria_0207.wav\")\r\n    MSG([[\r\n【Almeria】\r\nSad \"Why...? Why are you appearing now...?\"\r\n悲しみ\r\n    「どうして……？　どうして、こんな……」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Why would you appear at a time like this...?\r\nどうして、こんな時に現れるの……？]])\r\n\r\n    MSG([[I had already decided to say goodbye to this world. It would have been fine if no one noticed me. I thought I had no lingering attachments――\r\n私はもう世界にお別れしようと決めていたのに。 誰にも気付いてもらえなくたってよかったのに。 未練なんてないはずだったのに――]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ARU01da\")\r\nPLAY_VOICE(\"armeria_0208.wav\")\r\n    MSG([[\r\n【Almeria】\r\nSad (With this, I... want to keep living a little longer, don’t I...)\r\n悲しみ\r\n    （これじゃあ私……まだ生きていたくなるじゃない）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[No matter what, I found I didn’t want to disappear just yet.\r\nどうしても、まだ消えたくないと思ってしまった。]])\r\n\r\nPLAY_BGM(\"BGM18.wav\",0)\r\n\r\nPLAY_VOICE(\"minato_1401.wav\")\r\n    MSG([[\r\n【Minato】\r\nFlustered \"I-I'm sorry for saying something strange all of a sudden! I don’t even understand it myself, but I somehow feel like I’ve met you before... so...\"\r\n焦り 「きゅ、急に変なこと言って、ごめんなさい！ 自分でもわからないんだけど、何だかアナタに会ったことがある気がして……それで……」]])\r\n\r\n    -- //BU：無し\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n    SWITCH_SCREEN(\"mask029\",1000,false)\r\n\r\n    MSG([[Seeing Mina-chan’s cute reaction, which was just like old times, I couldn’t stay and ran away from him.\r\n昔と何にも変わらないミナちゃんのカワイイ反応を見ていられず、私は彼の元から逃げ出した。]])\r\n\r\n    MSG([[I would apologize to Mother and ask for a little more time.\r\nお母さまに謝って、もう少しだけ時間をもらおう。]])\r\n\r\n    MSG([[I know how awful I am. The guilt I owe Marika for what I did will never fade. Neither Marika nor Mina-chan will ever forgive me.\r\n自分が最低なのはわかっている。 マリカに行った仕打ちの罪は一生消えない。 マリカにも、ミナちゃんにも、決して許してもらえないだろう。]])\r\n\r\n    MSG([[Still, as long as he is looking at me—I want to live.\r\nそれでも、彼が自分を見てくれている限り――生きたい。]])\r\n\r\n    MSG([[Even if I have to throw away my looks, my name, and my heart. I just couldn’t give up the feelings I have for Mina-chan.\r\n容姿も、名前も、心も、すべてを捨て去ってしまったとしても。\r\n    　ミナちゃんへの想いだけは捨てきれなかったから。]])\r\n\r\n    MSG([[…. ……. ………….\r\n…。\r\n    　……。\r\n    　…………。]])\r\n\r\n    SWITCH_SCREEN(\"mask000\",0,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    -- //BG：公園\r\n    LAYER_LOAD(LAYER_BG, \"BG003aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    -- //BU：アルメリア・固有（通常）\r\n\r\n    MSG([[But, even so, today is the day I end it. Marika’s failure to awaken is surely because I am still here.\r\nだけど、それも今日で終わりにする。\r\n    　マリカが目覚めないのは、きっと自分がいるからだ。]])\r\n\r\n    MSG([[Both Mina-chan and Marika continue suffering because of me, so I can’t let myself feel happy anymore.\r\nミナちゃんも、マリカも、自分のせいで苦しみ続けているのに、私がこれ以上、幸せな気持ちになんてなってはいけない。]])\r\n\r\n    MSG([[Holding the happy memory of going on a date with Mina-chan again in that town for the last time, I decided to disappear.\r\n最後にミナちゃんとまたあの街でデートした幸せな記憶を胸に、消えようと思ったんだ。]])\r\n\r\n    MSG([[This message you’re hearing now is my farewell letter.\r\n今キミが聞いているこのメッセージは遺書の代わり。]])\r\n\r\n    MSG([[It’s pathetic to cling to this attachment, I’m sorry. But one day, I hope the two I love will notice me... I’m allowed to hope for that, right?\r\n未練たらしくて申し訳ないけどさ。 いつか大好きな二人が気付いてくれることくらいは……期待しても許されるよね。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ARU04da\")\r\nPLAY_VOICE(\"armeria_0209.wav\")\r\n    MSG([[\r\n【Almeria】\r\nUnique・Sad \"Marika, I’m sorry for putting all the blame on you. I was always so envious of you.\"\r\n固有・悲しみ\r\n    「マリちゃん、アナタにすべての責任を押しつけてごめんね。ずっと、アナタが羨ましくて仕方なかった」]])\r\n\r\nPLAY_VOICE(\"armeria_0210.wav\")\r\n    MSG([[\r\n【Almeria】\r\nUnique・Sad \"I believe that when I disappear, Marika will wake up.\"\r\n固有・悲しみ\r\n    「私が消えたらマリちゃんも目覚めてくれるって、私は信じるよ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ARU04aa\")\r\nPLAY_VOICE(\"armeria_0211.wav\")\r\n    MSG([[\r\n【Almeria】\r\nUnique・Normal \"And Mina-chan. You must have forgotten me because the trauma of me hurting you... right?\"\r\n固有・通常 「そしてミナちゃん。 アナタが私のことを忘れていたのは、きっと私をケガさせたことがトラウマだから……なんだよね」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ARU04fc\")\r\nPLAY_VOICE(\"armeria_0212.wav\")\r\n    MSG([[\r\n【Almeria】\r\nUnique・Wry Smile \"This time, I hope you can finally forget about me. You’ll surely bring smiles to many people from now on.\"\r\n固有・苦笑\r\n    「今度こそ、私のことなんて忘れてもらえたら嬉しいな。アナタはこれからも、きっとたくさんのヒトを笑顔にしてくれるはずだもの」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ARU04ea\")\r\nPLAY_VOICE(\"armeria_0213.wav\")\r\n    MSG([[\r\n【Almeria】\r\nUnique・Smile \"Thank you for finding me, the one who should have been forgotten by everyone but you.\"\r\n固有・笑顔\r\n    「誰からも忘れられたはずの私を、キミだけが見つけてくれて……ありがとう」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nSTOP_BGM(2000)\r\n    -- //BG：黒バック\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    MSG([[And with that, the message playback ended.\r\nそこで、メッセージの再生は終わった。]])\r\n\r\n    -- 　　　　◆\r\nSTOP_BGM(2000)\r\n    LAYER_LOAD(LAYER_BG, \"\")\r\n    SWITCH_SCREEN(\"mask000\" , 0,false)\r\n    WAIT_INPUT(2000)\r\n\r\n    ScenarioManager.Next(\"ERU_EP05_09\")\r\nend\r\n"
}