{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP05_11",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP05/RYU/EP05_11.lua",
  "Text": "function RYU_EP05_11()\r\n    -- .承-4【2月第2週】「潜入」\r\n    SaveData.Title = \"潜入\"\r\n\r\n    -- //BG：黒バック\r\nLAYER_LOAD(LAYER_BG, \"\")\r\nSWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    MSG([[Passing through the main gate of the Ryuguuin estate, parking the car in the lot inside, and walking for a few minutes――\r\n龍宮院家の正門を抜け、屋敷内の駐車場に車を停めてもらい、歩くこと数分――]])\r\n\r\n    -- //BG：龍宮院邸\r\nLAYER_LOAD(LAYER_BG, \"BG006aa\")\r\nSWITCH_SCREEN(\"mask001\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM05.wav\",0)\r\n\r\n    -- //BU：オウガ（通常）\r\nLAYER_LOAD(50,\"BU_OGA01aa\")\r\nSWITCH_SCREEN(\"mask000\" , 500,false)\r\n\r\n--PLAY_BGM(\"BGM20.wav\")\r\n\r\n    MSG([[Ouga and I arrived at a surprisingly beautiful garden.\r\nオウガくんとボクは何とも美しい庭へとたどり着いた。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07ca\")\r\n    MSG([[\r\n【Erika】\r\n \"…………\"\r\n「…………」]])\r\n    -- //ボイスなし\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I was lost for words at the vast garden that could hardly be believed to be privately owned.\r\n個人の所有物だとはとても思えない広大なその庭に、言葉を失くす。]])\r\n\r\n    MSG([[The size of this garden directly represented the overwhelming power of the opponent I was trying to outwit.\r\nこの庭の大きさはそのまま、ボクが出し抜こうとしている相手の強大さなワケで。]])\r\n\r\n    MSG([[Beneath the frilled skirt, my legs trembled as if they would start shaking at any moment.\r\nフリル付きのスカートの奥で、今にも足が震え出しそうだった。]])\r\n\r\nPLAY_VOICE(\"ogre_0430.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"You okay, Minato? You look pretty nervous.\"\r\n「大丈夫か？　ミナト。随分と緊張して見えるぞ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07fa\")\r\nPLAY_VOICE(\"erika_2070.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Th-thank you, Ouga. I practiced a lot, but I still get nervous.\"\r\n「あ、ありがとう、オウガくん。随分と練習したけど、やっぱり緊張するよ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07ba\")\r\nPLAY_VOICE(\"erika_2071.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"If I get found out, that's the end of it.\"\r\n「バレたらそれまでだもんね」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[When Ouga spoke to me, I managed to suppress my trembling legs.\r\nオウガくんに声をかけられて、足の震えを何とか押さえ込む。]])\r\n\r\n    MSG([[Ouga also had just as much at stake if our infiltration was discovered. For the sake of a friend who's helping me so much, I couldn’t afford to flinch.\r\n潜入がバレたらマズいのはオウガくんも同じだ。 こうしてボクを一生懸命助けてくれる友達のためにも、ひるんでなんていられない。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07ca\")\r\nPLAY_VOICE(\"erika_2072.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Ouga, you’re here wearing the Yuriai Private Academy uniform—is that okay? This is an important client, right?\"\r\n「オウガくんこそ、百合愛学園の制服で来てるけど大丈夫？　大事な取引先なんでしょ？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nLAYER_LOAD(50,\"BU_OGA01ea\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0431.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"We arranged for me to stop by after school. This is perfect.\"\r\n「学園の帰りに立ち寄るという話になっているからな。これでいいんだよ」]])\r\n\r\nPLAY_VOICE(\"ogre_0432.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Showing up in formal wear could escalate this into a big negotiation. Clothing must be chosen according to the situation.\"\r\n「下手に正装をして伺うと大きな商談に発展しかねん。服装も状況に応じて選ばなければな」]])\r\n\r\n    MSG([[As we chatted, I saw a figure walking toward us from the back of the mansion.\r\n雑談をしていると、奥の屋敷からコチラへ向かって歩いてくる影が見えた。]])\r\n\r\n    -- //BU：ウラン父\r\n    SWITCH_SCREEN(\"mask000\",0,false)\r\nLAYER_LOAD(55,\"BU_MOB12aa\")\r\nLAYER_ALPHA(55,0)\r\nLAYER_POSITION(55,-800,0)\r\nLAYER_MOVE_POSITION(55,-600,0,500,Ease.OutSine)\r\nLAYER_MOVE_ALPHA(55,255,500,Ease.OutSine)\r\nWAIT(500)\r\n\r\n    MSG([[A sturdy build topped with a shaved head.\r\n見覚えがある屈強な体格に、坊主頭。]])\r\n\r\n    MSG([[No doubt about it. It was Uran Ryuguuin’s father, whom I had seen before at the academy.\r\n間違いない。\r\n    　以前に学園内で見かけたウランさんのお父さんだ。]])\r\n\r\nPLAY_VOICE(\"udoh_0003.wav\")\r\n    MSG([[\r\n【Ryuguuin Hado】\r\n \"Oh! You’ve come at just the right time!\"\r\n「おお！　これはちょうどいいタイミングに来たなぁ！」]])\r\n\r\n    MSG([[As expected, he seemed to be Ryuguuin Hado. Upon seeing Ouga, he broke into a smile and hurried over.\r\nやっぱり、彼が龍宮院羽堂さんらしい。\r\n    　オウガくんの姿を見ると、羽堂さんは表情をほころばせて駆け寄ってきた。]])\r\n\r\nPLAY_VOICE(\"udoh_0004.wav\")\r\n    MSG([[\r\n【Ryuguuin Hado】\r\n \"Well, Ouga. Thank you for coming. Sorry I can’t offer much hospitality, but please stay and relax.\"\r\n「いやー、オウガくん。よく来てくれたね。おもてなしを何もできず申し訳ないが、ゆっくりしていってくれたまえ」]])\r\n\r\nLAYER_LOAD(50,\"BU_OGA01ea\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0433.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Haha, hospitality isn’t necessary. Hearing your theories on muscle training is the best greeting I could ask for.\"\r\n「ははは、もてなしなど不要だよ。アナタの筋トレに関する持論を聞けることが、オレ様にとっては最高の歓迎なのだからな」]])\r\n\r\nPLAY_VOICE(\"udoh_0005.wav\")\r\n    MSG([[\r\n【Ryuguuin Hado】\r\n \"You flatter me~ By the way, who’s this cute maid beside you?\"\r\n「嬉しいことを言ってくれるねぇ～。ところで、隣の可愛らしいメイドさんは一体誰だい？」]])\r\n\r\nPLAY_VOICE(\"ogre_0434.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Ah, she’s my new maid. She tends to get a little lost sometimes but is very capable.\"\r\n「ああ、ウチの新人メイドだ。少々迷子になりやすいきらいがあるが、とても優秀だよ」]])\r\n\r\n    MSG([[Following our plan, Ouga introduced me.\r\n打ち合わせ通りに、オウガくんがボクを紹介してくれた。]])\r\n\r\n    MSG([[Bowing a hundred times as practiced, I greeted him in an even more feminine voice than usual.\r\n何百回と練習したお辞儀と共に、普段よりも一層女性らしい声で挨拶をする。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07ea\")\r\nPLAY_VOICE(\"erika_2073.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Nice to meet you. I am Mina, a maid of the Rokujou family. I look forward to working with you today.\"\r\n「はじめまして、六条家のメイド、ミナです。本日はよろしくお願いいたします」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"udoh_0006.wav\")\r\n    MSG([[\r\n【Ryuguuin Hado】\r\n \"Oh, a new maid, huh? Let me see.\"\r\n「ほう、新人メイドか。どれどれ」]])\r\n\r\n    MSG([[His eyes narrowed as he appraised my body, staring me up and down from my feet upward.\r\n龍宮院氏の目が細くなり、ボクのカラダを値踏みするように、足元から上に向かってジロジロと見つめた。]])\r\n\r\n    MSG([[………… Long. The gaze lingered for a long time.\r\n…………長い。\r\n    　見つめている時間が、長い。]])\r\n\r\n    MSG([[C-could it be I’ve already been found out?\r\nま、まさかもうバレてしまったんじゃ。]])\r\n\r\nPLAY_VOICE(\"udoh_0007.wav\")\r\n    MSG([[\r\n【Ryuguuin Hado】\r\n \"I can tell even through your clothes... You’re hiding something, aren’t you?\"\r\n「服の上からでもわかるよ……キミ、隠しているねェ？」]])\r\n\r\n    MSG([[Suddenly, he struck at the core. I struggled desperately to keep my smile from faltering.\r\nいきなり核心を突いてきた。\r\n    　表情に出そうになるのを、必死にこらえて笑顔を保つ。]])\r\n\r\n    MSG([[―A maid must always wear a smile; she should be the sun of the mansion.\r\n――メイドたるもの常に笑顔、屋敷の太陽であるべし、だ。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07fc\")\r\nPLAY_VOICE(\"erika_2074.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"What are you talking about...? I’m just a humble maid, after all.\"\r\n「何のことでしょうか……？　私はただの、しがないメイドですよ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Somehow, I managed to respond naturally.\r\n何とか自然に言葉を返せた。]])\r\n\r\n    MSG([[That was close. If not for Yurikawa’s guidance, it would have shown on my face.\r\n危ない。\r\n    　百合川さんの指導を受けていなければ、表情に出ているところだ。]])\r\n\r\n    MSG([[But Ryuguuin’s suspicion was not yet cleared, as he lifted the corners of his mouth and spoke.\r\nでも龍宮院氏の疑念はまだ晴れていないようで、口角を吊り上げて語る。]])\r\n\r\nPLAY_VOICE(\"udoh_0008.wav\")\r\n    MSG([[\r\n【Ryuguuin Hado】\r\n \"You can’t hide it from me... See, you really are—\"\r\n「隠したってお見通しだよ……ほ～ら、キミはやっぱり」]])\r\n\r\nPLAY_VOICE(\"udoh_0009.wav\")\r\n    MSG([[\r\n【Ryuguuin Hado】\r\n \"—well-muscled.\"\r\n「いい筋肉をしている」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07ca\")\r\nPLAY_VOICE(\"erika_2075.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Muscles?\"\r\n「筋肉？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I barely managed to stop myself from stumbling.\r\nズッコケそうになるのを何とかこらえた。]])\r\n\r\n    MSG([[Unaware of my sincere relief, Hado continued his heavy breathing inspection of my muscles.\r\n心から安堵したボクの気も知らずに、羽堂さんは息を荒くして筋肉観察を続ける。]])\r\n\r\nPLAY_VOICE(\"udoh_0010.wav\")\r\n    MSG([[\r\n【Ryuguuin Hado】\r\n \"As expected of a maid chosen by Ouga. The muscles visible beneath that maid outfit are exactly what you’d expect: pink muscles excellent in both explosiveness and endurance.\"\r\n「流石はオウガくんが選んだメイドだけのことはある。メイド服から顔を覗かせるその筋肉はまさしく、瞬発力と持久力、どちらにも優れたピンク色の筋肉だ」]])\r\n\r\nPLAY_VOICE(\"udoh_0011.wav\")\r\n    MSG([[\r\n【Ryuguuin Hado】\r\n \"For your age—and being a woman yet—you’re remarkably well trained.\"\r\n「その年齢、しかもその女性にも関わらず、よく鍛え上げられているねぇ～」]])\r\n\r\nPLAY_VOICE(\"ogre_0435.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Noticing that, Hado is truly a genius and a muscle expert. My maid must be beautiful, elegant, and strong.\"\r\n「そこに気付くとは、流石は筋肉博士とも称された天才、龍宮院羽堂氏だ。我がメイドは美しく、華麗でかつ、強靭でなければならない」]])\r\n\r\nPLAY_VOICE(\"udoh_0012.wav\")\r\n    MSG([[\r\n【Ryuguuin Hado】\r\n \"Indeed, whether male or female, it’s the muscles that matter first.\"\r\n「やはり、男も女もまずは筋肉ですなぁ」]])\r\n\r\n    MSG([[Hado looked very satisfied. It seemed what he had been appraising was truly my muscles.\r\n何だかとても満足げな羽堂さん。\r\n    　値踏みしていたのは、本当にボクの筋肉だったらしい。]])\r\n\r\n    MSG([[I was relieved he didn’t see through my gender, but his ability to gauge muscle quality through clothes was incredible.\r\n性別を見抜かれなかったことに安心したけれど、筋肉の質を服の上から見抜くなんて凄まじい眼力だ。]])\r\n\r\n    MSG([[The rumor about needing a tranquilizer gun meant for a bear to take him down might not be such an exaggeration after all.\r\n倒すのにヒグマ用の麻酔銃がいるという話も、あながち大袈裟じゃないのかもしれない。]])\r\n\r\nPLAY_VOICE(\"ogre_0436.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Haha, I’m proud of my maid too. Since she’s a martial arts master, I’m hoping to have her spar with Mr. Ryuguuin someday.\"\r\n「ははは、オレ様も自慢のメイドだ。武道の達人でもあるから、ぜひいつか、龍宮院氏と戦わせてみたいと考えているよ」]])\r\n\r\nPLAY_VOICE(\"udoh_0013.wav\")\r\n    MSG([[\r\n【Ryuguuin Hado】\r\n \"You’re bold, Ouga. Even I won’t lose to a young lady like her!\"\r\n「言うねェ、オウガくん。私だってまだまだ若い女の子には負けたりしないぞォ？」]])\r\n\r\n    MSG([[Ouga and Hado continued their pleasant conversation.\r\nオウガくんと龍宮院氏が穏やかに談笑を続ける。]])\r\n\r\n    MSG([[Alright, the biggest worry—the first impression—is cleared.\r\nよし、一番心配だったファーストインプレッションはクリアーできた。]])\r\n\r\n    MSG([[Following plan, once we entered the building, I would pretend to get separated and head to the annex where Uran was supposedly confined.\r\nこのまま手筈通り、建物の中に入ったらはぐれたフリをし、ウランさんが閉じ込められているという別館へと向かおう。]])\r\n\r\nPLAY_VOICE(\"udoh_0014.wav\")\r\n    MSG([[\r\n【Ryuguuin Hado】\r\n \"We shouldn’t just stand and chat; let’s head inside. I have a protein supplement I really want to recommend to you.\"\r\n「立ち話もなんだし早く中へ入ろう。キミにぜひオススメしたいプロテインがあるんだよ」]])\r\n\r\nPLAY_VOICE(\"ogre_0437.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Oh, I’m looking forward to that. I’d love to try it.\"\r\n「ほう、それは楽しみだ。ぜひご馳走になりたいな」]])\r\n\r\n    MSG([[As Ryuguuin led the way to the mansion, Ouga suddenly remembered and called out to me.\r\n龍宮院氏の先導で屋敷へと向かい始めたところで、オウガくんは思い出したようにボクに呼びかける。]])\r\n\r\nLAYER_LOAD(50,\"BU_OGA01aa\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0438.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Hey Mina, did you forget the souvenir sweets in the car?\"\r\n「おいミナ、土産の茶菓子を車に忘れてきていないか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07ca\")\r\nPLAY_VOICE(\"erika_2076.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Ah!? I-I'm so sorry, Ouga-sama!\"\r\n「ああっ！？　ご、ごめんなさい、オウガ坊ちゃま」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"udoh_0015.wav\")\r\n    MSG([[\r\n【Ryuguuin Hado】\r\n \"Hmm... that’s a problem.\"\r\n「む……それはいかんな」]])\r\n\r\n    MSG([[Ryuguuin’s expression darkened in a flash. It was obvious he was displeased.\r\n龍宮院氏の表情がサッと曇った。\r\n    　露骨に不機嫌になったことが伺える。]])\r\n\r\n    MSG([[As I had heard from Uran, he might be harsh toward women.\r\nウランさんから聞いていた通り、女性に対しては当たりが強いのかもしれない。]])\r\n\r\nPLAY_VOICE(\"ogre_0439.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Mina, I’m heading to the mansion with Mr. Ryuguuin first. You go back to the car and get the souvenir.\"\r\n「ミナ、オレ様は先に龍宮院氏と屋敷に向かう。オマエは車に土産を取りに行ってこい」]])\r\n\r\nPLAY_VOICE(\"ogre_0440.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"Mr. Ryuguuin, is that building up ahead the mansion?\"\r\n「龍宮院氏、屋敷はあの先に見える建物でよかっただろうか？」]])\r\n\r\nPLAY_VOICE(\"udoh_0016.wav\")\r\n    MSG([[\r\n【Ryuguuin Hado】\r\n \"Ah, no, that’s the annex. Nobody lives there, so please don’t go near it.\"\r\n「ああ、いやあそこは別館なのだ。誰も住んでいないから近寄らないでくれたまえ」]])\r\n\r\nPLAY_VOICE(\"udoh_0017.wav\")\r\n    MSG([[\r\n【Ryuguuin Hado】\r\n \"The main building is that one beyond the pond you see there.\"\r\n「本館はあちらの、池の奥に見える建物だよ」]])\r\n\r\nLAYER_LOAD(50,\"BU_OGA01ea\")\r\nSWITCH_SCREEN(\"mask000\",300,true)\r\nPLAY_VOICE(\"ogre_0441.wav\")\r\n    MSG([[\r\n【Ouga】\r\n \"My apologies. Still, this garden is magnificent. Just looking at it feels like it cleanses my soul.\"\r\n「それは失礼した。それにしても、素晴らしい庭だ。眺めているだけで心が洗われるような心地になる」]])\r\n\r\nPLAY_VOICE(\"udoh_0018.wav\")\r\n    MSG([[\r\n【Ryuguuin Hado】\r\n \"Haha, not at all. It’s just huge, so taking care of it is tough.\"\r\n「ははは、そんなそんな。広いばっかりで手入れが大変だよ」]])\r\n\r\nSTOP_BGM(2000)\r\n\r\n    -- //BU：なし\r\n    SWITCH_SCREEN(\"mask000\",0,false)\r\nLAYER_MOVE_POSITION(50,-200,0,500,Ease.InSine)\r\nLAYER_MOVE_POSITION(55,-800,0,500,Ease.InSine)\r\nLAYER_MOVE_ALPHA(50,0,500,Ease.InSine)\r\nLAYER_MOVE_ALPHA(55,0,500,Ease.InSine)\r\nWAIT(500)\r\nLAYER_LOAD(50,\"\")\r\nLAYER_LOAD(55,\"\")\r\n\r\n    MSG([[While chatting, Ouga led Mr. Ryuguuin toward the main building.\r\nオウガくんが談笑をしながら、龍宮院氏を本館へと引き連れていってくれた。]])\r\n\r\n    MSG([[I was grateful that he casually asked about the location of the annex.\r\nさり気なく別館の場所を聞き出してくれたのもありがたい。]])\r\n\r\n    MSG([[Since it matched the information Akira got, it was probably true and not a lie.\r\nアキラが聞き出してくれた別館の情報とも相違ないので、ウソだということもないだろう。]])\r\n\r\n    MSG([[I cautiously made my way toward the annex.\r\nボクは周囲を警戒しながら別館へと向かう。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_ERI07ba\")\r\nPLAY_VOICE(\"erika_2077.wav\")\r\n    MSG([[\r\n【Erika】\r\n (According to Mr. Ryujo, Uran should be locked up in the annex now...)\r\n（龍城院さんの話では、ウランさんは今別館に閉じ込められているはず……）]])\r\n\r\nPLAY_VOICE(\"erika_2078.wav\")\r\n    MSG([[\r\n【Erika】\r\n (Please wait for me, Uran.)\r\n（待っていてください、ウランさん）]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    -- 　　　　◆\r\n\r\nLAYER_LOAD(LAYER_BG, \"\")\r\nSWITCH_SCREEN(\"mask000\" , 1000,false)\r\nWAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"RYU_EP05_12\")\r\nend\r\n"
}