{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP05_05",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP05/ERU/EP05_05.lua",
  "Text": "function ERU_EP05_05()\r\n    -- .起-1【6年前の3月】「井上アルト」\r\n    SaveData.Title = \"井上アルト\"\r\n\r\n    -- //BG：黒バック\r\n    LAYER_LOAD(LAYER_BG, \"\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    MSG([[I played back the message left by \"her\" on my smartphone.\r\nボクはスマートフォンに残された、“彼女”のメッセージを再生した。]])\r\n\r\n    -- //BG：公園\r\n    LAYER_LOAD(LAYER_BG, \"BG003aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM06.wav\")\r\n\r\n    MSG([[Ah—ah, I wonder if my voice recorded properly.\r\nあー、あー、ちゃんと声を録れているのかな、これ。]])\r\n\r\n    MSG([[Well... even if it didn’t record, it’s probably fine. This is totally just a record for my own satisfaction anyway.\r\nまぁ……最悪録れてなくてもいいかなー。\r\n    　これは完全に自己満足の記録だしね。]])\r\n\r\n    MSG([[Where should I start talking? Probably with my roots, after all.\r\nまずは何から話せばいいかな。\r\n    　やっぱり、私のルーツからだよね。]])\r\n\r\n    MSG([[I, Aruto Inoue, was born as a \"female.\" By the time I was aware of myself, I recognized that I was \"female,\" and of course my hobbies and tastes matched those of girls my age.\r\n私、井上アルトは“女性”として生まれたの。 物心つく頃には、自分が“女性”だという認識があったし、もちろん趣味や好みも同世代の女の子と同じ。]])\r\n\r\n    MSG([[Sometimes I think that if I’d been born into a different family, I probably could have lived normally without any problems...\r\nもし生まれる家庭が違ったら、きっと何事もなく、普通に暮らせてたんだろうなぁ……って思ったりもするよ。]])\r\n\r\n    MSG([[But unfortunately, the parents I was born to really wanted a \"boy\" all along.\r\nだけど運が悪いことに、アルトちゃんが生まれたおうちのお父さん、お母さんは、ずーっと“男の子”が欲しかったんだよね。]])\r\n\r\n    MSG([[Naturally, they gave me the masculine name “Aruto,” shaped my appearance to look boyish, and never allowed me to live like a girl.\r\n当然のように、私に「或人」という男らしい名前をつけて、容姿も男らしく整えて。決して女の子らしく生きることを許さなかった。]])\r\n\r\n    MSG([[At first, I listened properly to them.\r\n私も初めはちゃんと言うことを聞いていたんだけどね。]])\r\n\r\n    MSG([[But as I grew up, I began to want to live my true self more than the life my parents expected from me.\r\n成長するに従って、両親が私に望んでいる生き方よりも、自分らしい生き方を望むようになっていったの。]])\r\n\r\n    MSG([[Of course, at home I was always scolded. I clearly remember the feeling of losing my place.\r\n当然、家ではいつも叱られてばかりいてね。\r\n    　自分の居場所がなくなっていくような心地を味わったのをよく覚えているよ。]])\r\n\r\n    MSG([[And of course, the problems didn’t stop at home.\r\nそしてもちろん、問題は家の中じゃ終わらないんだよね。]])\r\n\r\n    MSG([[What would people around think if there was someone with a boy’s name and appearance but who is a “female”?\r\nもし容姿も名前も男なのに、“女性”なヤツがいたら、周りのヒトはどう思うかな？]])\r\n\r\n    -- //BU：モブ子ども×３\r\n    LAYER_LOAD(50,\"BU_MOB03aa\")\r\n    LAYER_POSITION(50,600,0)\r\n    LAYER_LOAD(55,\"BU_MOB03aa\")\r\n    LAYER_POSITION(55,-600,0)\r\n    LAYER_LOAD(60,\"BU_MOB03aa\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\nPLAY_VOICE(\"kid1_0007.wav\")\r\n    MSG([[\r\n【Children】\r\n “Hey, look! Aruto’s wearing some weird outfit again!”\r\n「おい見ろよ。アルトのヤツ、またヘンテコなかっこうしてるよ！」]])\r\n\r\nPLAY_VOICE(\"kid1_0008.wav\")\r\n    MSG([[\r\n【Children】\r\n “Mom said! You’re kinda weird!”\r\n「ママが言ってたぞ！　オマエはちょっとおかしいって！」]])\r\n\r\nPLAY_VOICE(\"kid1_0009.wav\")\r\n    MSG([[\r\n【Children】\r\n “Hey! Let’s see what’s under that skirt!”\r\n「おい！　スカートの中がどうなってるのか見てやろうぜ！」]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(55,\"\")\r\n    LAYER_LOAD(60,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[Yeah... I was hated. I was actually hated, and now I understand why.\r\nそう……嫌われるの。\r\n    　私も実際嫌われたし、今では嫌われるのも納得だなぁと思う。]])\r\n\r\n    MSG([[Back then, everyone treating the difficult me like a leper was a completely natural consequence.\r\n扱いづらい当時の私を周囲が腫れ物のように扱うのは、至極当然の帰結だったと今なら思えるね。]])\r\n\r\n    MSG([[What was really painful was... being hated by my school teachers.\r\nただツラかったのは……学校の先生たちからも嫌われたことかな。]])\r\n\r\n    MSG([[When teachers hate you, bullying becomes almost officially sanctioned.\r\n先生に嫌われるとさ、イジメが半ば公認で行われるようになるんだよね。]])\r\n\r\n    MSG([[The person who coined the word “lynching” was brilliant. Truly, there’s nothing more terrifying than bullying justified as justice.\r\nリンチって言葉を作ったヒトは偉大だと思うよ。\r\n    　本当に、正義のイジメほど恐ろしいものはないもの。]])\r\n\r\n    MSG([[Well, as you might expect, bullying happened. That harsh treatment eating away at Aruto Inoue’s heart back then was also a natural consequence.\r\nまぁイジメが当然行われたように。 その苛烈な仕打ちが当時の井上アルトちゃんの心を蝕んでいくのも、また当然な帰結なワケで。]])\r\n\r\n    MSG([[Before I knew it, \"her\" heart filled up with resentment for the world.\r\n気付けば“彼女”の胸の内は、世界の恨みで満ち満ちていったワケです。]])\r\n\r\n    MSG([[But, you know, there’s always some salvation somewhere. One day, an angel appeared before me.\r\nでもね、どんなところにも救いはあるものでさ。\r\n    　ある日、私の前に天使が現れるの。]])\r\n\r\n    -- //BU：ショタミナト（通常）\r\n    SWITCH_SCREEN(\"mask000\",0,false)\r\n    LAYER_LOAD(50,\"BU_CMI01aa\")\r\n    LAYER_ALPHA(50,0)\r\n    LAYER_POSITION(50,-200,0)\r\n    LAYER_MOVE_POSITION(50,0,0,500,Ease.OutSine)\r\n    LAYER_MOVE_ALPHA(50,255,500,Ease.OutSine)\r\n    WAIT(500)\r\n\r\nPLAY_VOICE(\"minato_1384.wav\")\r\n    MSG([[\r\n【Minato】\r\n “Big sister... why are you all alone in a place like this?”\r\n「お姉さん……どうして、そんなところで一人でいるの？」]])\r\n\r\n    MSG([[That angel’s name was Minato Ikusa. Yes, the name of the one listening to this voice right now, or so I want to believe.\r\n天使の名前は伊草ミナト。\r\n    　そう、今このボイスを聞いてくれていると信じたい、アナタの名前。]])\r\n\r\n    MSG([[...Just kidding. Surely you don’t remember meeting me at all.\r\n……なんて。\r\n    　きっとキミは私との出会いなんてこれっぽっちも覚えていないのだろうけどね。]])\r\n\r\n    MSG([[But for me, it was a shock that changed the world. It was a shock that colored what had been a monochrome world at once.\r\nでも私にとっては、世界が変わるほどの衝撃だった。\r\n    　モノクロだった世界が、一気に色づくくらいの衝撃だったの。]])\r\n\r\n    MSG([[Minato, on a rarely visited corner of the park, said this to me who was dressed like a girl.\r\nミナちゃんは、滅多にヒトの来ない公園の片隅で、女の子らしい服を着ていた私にこう言ってくれた。]])\r\n\r\nPLAY_VOICE(\"minato_1385.wav\")\r\n    MSG([[\r\n【Minato】\r\n “Big sister, you’re so cute... so why are you hiding in a corner?”\r\n「お姉さん、そんなにカワイイのに……どうして、隅っこでコソコソしてるの？」]])\r\n\r\n    MSG([[For the first time, I felt recognized by the world. I felt like I was told, “It’s okay for you to live.”\r\n私は初めて、世界に自分を認められた気がした。\r\n    　「生きてていいんだよ」と言われた気がした。]])\r\n\r\nSTOP_BGM(1500)\r\n\r\n    MSG([[So on that day, no matter what happens from then on, I vowed to protect Minato alone.\r\nだから私はその日、これから先、何があったってミナちゃんだけは守ろうと心に決めたんだ。]])\r\n\r\nLAYER_LOAD(50,\"\")\r\nLAYER_LOAD(LAYER_BG, \"BG000aa\")\r\nSWITCH_SCREEN(\"mask008\" , 500,false)\r\n\r\nLAYER_LOAD(LAYER_BG, \"BG003aa\")\r\n\r\n    -- //BU：ショタミナト（泣き）、モブ子ども×２\r\n    LAYER_LOAD(50,\"BU_MOB03aa\")\r\n    LAYER_LOAD(55,\"BU_MOB03aa\")\r\n    LAYER_POSITION(55,-400,0)\r\n    LAYER_LOAD(60,\"BU_CMI01aa\")\r\n    LAYER_POSITION(60,400,0)\r\n    SWITCH_SCREEN(\"mask008\",500,true)\r\n\r\nPLAY_BGM(\"BGM18.wav\",0,true)\r\n\r\nPLAY_VOICE(\"brat_0001.wav\")\r\n    MSG([[\r\n【Brat】\r\n “Ha ha! Crybaby Minato!”\r\n「やーい！　泣き虫ミナトー！」]])\r\n\r\nPLAY_VOICE(\"brat_0002.wav\")\r\n    MSG([[\r\n【Brat】\r\n “The scary sister isn't here today, right? We’ll get back at you!”\r\n「今日はコワい姉ちゃんも来ないんだろ！　お返ししてやるからな！」]])\r\n\r\nPLAY_VOICE(\"minato_1386.wav\")\r\n    MSG([[\r\n【Minato】\r\n “Uuuu... stop... don’t hit me!”\r\n「ううぅ……やめてぇ……殴らないでぇ」]])\r\n\r\nPLAY_VOICE(\"armeria_0168.wav\")\r\n    MSG([[\r\n【Aruto】\r\n “Hey! You guys! If you bully Mina-chan, I won’t let it go!”\r\n「おいコラ、アンタたち！　ミナちゃんをイジメたら、ただじゃおかないって言ってるでしょ！？」]])\r\n\r\nPLAY_VOICE(\"brat_0003.wav\")\r\n    MSG([[\r\n【Brat】\r\n “Gyah!? A g-<r=おんなおとこ>femboy</r>! Run away!”\r\n「ぎゃー！？　お、<r=おんなおとこ>女男</r>だー！　逃げろー！」]])\r\n\r\n    SWITCH_SCREEN(\"mask000\",0,false)\r\n    LAYER_MOVE_ALPHA(50,0,500,Ease.InSine)\r\n    LAYER_MOVE_ALPHA(55,0,500,Ease.InSine)\r\n    LAYER_MOVE_POSITION(50,-200,0,500,Ease.InSine)\r\n    LAYER_MOVE_POSITION(55,-600,0,500,Ease.InSine)\r\n    WAIT(500)\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(55,\"\")\r\n\r\nPLAY_VOICE(\"armeria_0169.wav\")\r\n    MSG([[\r\n【Aruto】\r\n “Minato, are you okay? I keep telling you not to come to the park when Marika can’t be here.”\r\n「ミナちゃん、平気？　もう……マリカが来れない時は公園に来ちゃダメって、いつも言ってるじゃない」]])\r\n\r\nPLAY_VOICE(\"minato_1387.wav\")\r\n    MSG([[\r\n【Minato】\r\n “S-sorry, Aruto big sister.”\r\n「ご、ごめんなさい、アルトお姉ちゃん」]])\r\n\r\n    MSG([[Then I started protecting that angel-like boy in the park from bullies.\r\nそれから私は、公園でその天使みたいな男の子をいじめっ子から守るようになった。]])\r\n\r\n    MSG([[I’m way more experienced in being bullied.\r\nこちとら、イジメられ歴ではうんと先輩。]])\r\n\r\n    MSG([[Back then, I had become quite tough mentally and physically, so I wasn’t about to lose to some younger kids.\r\nその頃の私は精神的にも肉体的にもなかなかにタフになっていたから、年下の子どもなんかに負けるワケもなくて。]])\r\n\r\n    MSG([[Before I knew it, together with his sister Marika, we became the ones watching over Minato.\r\n気付けば彼の姉であるマリカと一緒に、ミナちゃんを見守る立場になっていた。]])\r\n\r\n    -- //BU：ロリマリカ（通常）\r\n    SWITCH_SCREEN(\"mask000\",0,false)\r\n    LAYER_LOAD(50,\"BU_CMA01aa\")\r\n    -- SWITCH_SCREEN(\"mask000\",500,true)\r\n    LAYER_ALPHA(50,0)\r\n    LAYER_POSITION(50,-400,0)\r\n    LAYER_MOVE_POSITION(50,-200,0,500,Ease.OutSine)\r\n    LAYER_MOVE_ALPHA(50,255,500,Ease.OutSine)\r\n    WAIT(500)\r\n\r\nPLAY_VOICE(\"marika_0034.wav\")\r\n    MSG([[\r\n【Marika】\r\n “So you’re the famous big sister Aruto.”\r\n「アナタがウワサのアルトお姉ちゃんね」]])\r\n\r\nPLAY_VOICE(\"armeria_0170.wav\")\r\n    MSG([[\r\n【Aruto】\r\n “Ah, you really look just like Minato. Are you the Marika big sister?”\r\n「あ、本当にミナちゃんにそっくり。アナタが例のマリカお姉ちゃん？」]])\r\n\r\n    LAYER_LOAD(50,\"BU_CMA01ea\")\r\n    LAYER_POSITION(50,-200,0)\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"marika_0035.wav\")\r\n    MSG([[\r\n【Marika】\r\n “Yes, I’m Marika from the class next to yours. Nice to meet you, Al-chan.”\r\n「そう、アナタのとなりのクラスのマリカだよ。よろしくね、アルちゃん」]])\r\n\r\n    LAYER_LOAD(50,\"\")\r\n    LAYER_LOAD(60,\"\")\r\n    SWITCH_SCREEN(\"mask000\",500,true)\r\n\r\n    MSG([[Naturally, I also got along well with Marika who was in a similar situation.\r\nそして自然と、同じような立場であるマリカとも仲良くなったの。]])\r\n\r\n    MSG([[Marika was popular at school even then. Because I became friends with Marika, the bullying against me naturally decreased.\r\nマリカは当時から学校で人気者でね。\r\n    　マリカと友達になれたことで、私へのイジメは自然と減っていったわ。]])\r\n\r\n    MSG([[Of course... behind the scenes, various things were said, and I never got along with my parents.\r\nもちろん……影では色々と言われていたし、両親との折り合いは全然つかないままだったけどね。]])\r\n\r\n    -- //CG：アルメリアの誕生\r\n    LAYER_LOAD(LAYER_BG, \"EV040aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_VOICE(\"minato_1388.wav\")\r\n    MSG([[\r\n【Minato】\r\n “Yeah, that outfit really suits Aruto big sister! It’s so cute!”\r\n「うん、やっぱりその服、アルトお姉ちゃんにピッタリ！　とってもカワイイよ！」]])\r\n\r\nPLAY_VOICE(\"armeria_0171.wav\")\r\n    MSG([[\r\n【Aruto】\r\n “I-is that so...? Mina-chan, Mari-chan, thank you so much for giving me such wonderful clothes.”\r\n「そ、そう、かな……ミナちゃん、マリちゃん、こんなに素敵な服をくれてありがとうね」]])\r\n\r\nPLAY_VOICE(\"marika_0036.wav\")\r\n    MSG([[\r\n【Marika】\r\n “Hehe. If Al-chan wears them, I think my clothes are happy too.”\r\n「ふふ。アルちゃんに着てもらえるなら、私の服も喜んでいると思うよ」]])\r\n\r\nPLAY_VOICE(\"marika_0037.wav\")\r\n    MSG([[\r\n【Marika】\r\n “Al-chan is so cute. I want you to wear many more kinds of clothes.”\r\n「アルちゃん、とってもカワイイんだもの。もっともっと、色んな服を着てもらいたいな」]])\r\n\r\n    MSG([[You siblings brought clothes to me who couldn’t wear girls’ clothes at home... every chance you got.\r\nキミたち姉弟は家じゃ女の子の服なんて着られない私のために……事あるごとに私に服を持ってきてくれたよね。]])\r\n\r\n    MSG([[I’ll never forget the first time you let me wear those clothes.\r\n初めて服を着せてもらった時のことは今でも忘れられない。]])\r\n\r\n    MSG([[You both praised and accepted me, but having always been ridiculed by others, I couldn’t help but feel uneasy and weakly vented.\r\n二人は褒めて認めてくれたけど、ずっと周りからバカにされてきた私にはどうにも不安で仕方がなくて、弱音を漏らしちゃったんだ。]])\r\n\r\nPLAY_VOICE(\"armeria_0172.wav\")\r\n    MSG([[\r\n【Aruto】\r\n “B-but... is it really okay for someone like me to wear such cute clothes? You see, my name is 'Aruto,' and my hairstyle and face look boyish.”\r\n「で、でも……私なんかがこんなにカワイイ服を着てもいいのかな？ ほら、私って『アルト』って名前だし、髪型や顔だって男の子みたいだしさ」]])\r\n\r\nPLAY_VOICE(\"armeria_0173.wav\")\r\n    MSG([[\r\n【Aruto】\r\n “I feel kind of sorry for the clothes.”\r\n「せっかくの服に何だか申し訳ないよ」]])\r\n\r\nPLAY_VOICE(\"marika_0038.wav\")\r\n    MSG([[\r\n【Marika】\r\n “Hehe. Al-chan, you’re funny. You don’t need to think that at all.”\r\n「ふふ。アルちゃんったらおかしい。そんなこと全然思う必要ないのに」]])\r\n\r\nPLAY_VOICE(\"minato_1389.wav\")\r\n    MSG([[\r\n【Minato】\r\n “Aruto big sister, do you hate your own name?”\r\n「アルトお姉ちゃんは、自分の名前がキラいなの？」]])\r\n\r\nPLAY_VOICE(\"armeria_0174.wav\")\r\n    MSG([[\r\n【Aruto】\r\n “Well... yeah. It’s clearly a name meant for a boy.”\r\n「まぁ……そうだね。明らかに、男の子を意識した名前だからさ」]])\r\n\r\nPLAY_VOICE(\"marika_0039.wav\")\r\n    MSG([[\r\n【Marika】\r\n “Hey Al-chan, don’t you want Minato to try dressing like a girl next?”\r\n「ねえアルちゃん、次はミナちゃんに女の子の恰好をしてもらいたいと思わない？」]])\r\n\r\nPLAY_VOICE(\"armeria_0175.wav\")\r\n    MSG([[\r\n【Aruto】\r\n “As expected of Marika, we think alike. Actually, I’ve been thinking the same thing.”\r\n「流石マリちゃん、気が合うね。実は私も、ずっと同じことを考えてたよ」]])\r\n\r\nPLAY_VOICE(\"minato_1390.wav\")\r\n    MSG([[\r\n【Minato】\r\n “Eh!? M-me wearing girls’ clothes!? N-no way! That’s embarrassing!”\r\n「ええ！？　ぼ、ボクが女の子の服を！？　や、ヤダヤダ！　恥ずかしいよぉ！」]])\r\n\r\nPLAY_VOICE(\"armeria_0176.wav\")\r\n    MSG([[\r\n【Aruto】\r\n “Don’t say that! Please! I’ll do really cute makeup for you!”\r\n「そう言わずに、おねがい！　とびっきりカワイイメイクをしてあげるから！」]])\r\n\r\nPLAY_VOICE(\"marika_0040.wav\")\r\n    MSG([[\r\n【Marika】\r\n “Trying out girls’ makeup and clothes might be useful later on? Experience is important.”\r\n「女の子のメイクや服を体験しておくと、この先で役に立つかもしれないよ？　何事も経験だよ」]])\r\n\r\nPLAY_VOICE(\"minato_1391.wav\")\r\n    MSG([[\r\n【Minato】\r\n “Eeeh!? If you really want me to... okay, but...”\r\n「ええー！？　ど、どうしてもって言うなら……いい、けど」]])\r\n\r\nPLAY_VOICE(\"armeria_0177.wav\")\r\n    MSG([[\r\n【Aruto】\r\n “Yay, Marika!”\r\n「やったね、マリちゃん！」]])\r\n\r\nPLAY_VOICE(\"marika_0041.wav\")\r\n    MSG([[\r\n【Marika】\r\n “Let’s do it as soon as tomorrow, Al-chan!”\r\n「明日にでも実行しようよ、アルちゃん！」]])\r\n\r\n    MSG([[Hehe, Minato’s reaction the first time he got crossdressed was so cute...\r\nふふ、初めて女装をしてもらった時のミナちゃんの反応、可愛かったなぁ……。]])\r\n\r\n    MSG([[I believe Minato’s crossdressing started out so good because those experiences are etched in his memory.\r\nミナちゃんの女装が初めからクオリティが高かったのは、あの頃の経験が記憶に焼きついているからだって信じているよ。]])\r\n\r\n    MSG([[Not that he learned from scratch, but that he’s just recalling forgotten knowledge.\r\n一から覚えているんじゃなくて、忘れた知識を呼び覚ましているだけなんだ、ってね。]])\r\n\r\n    MSG([[After that, the three of us played together and did all sorts of things.\r\nそれからも三人で一緒に、本当に色んなことをして遊んだっけ。]])\r\n\r\n    MSG([[Even now, I sometimes think those were the happiest times.\r\n今でも、あの頃が一番幸せだったんじゃないかなぁ……って思ったりもするよ。]])\r\n\r\n    MSG([[Minato and Marika were always by my side, so I was able to laugh much more than before.\r\nいつだってミナちゃんとマリちゃんがそばにいてくれたから、私は昔と比べて、随分と笑えるようになった。]])\r\n\r\n    MSG([[But... this is completely my own flaw:\r\nだけどね……これは完全に私という人間の至らない部分なのだけど。]])\r\n\r\n    MSG([[I started to feel jealous of Marika.\r\n私はマリカに嫉妬するようになったの。]])\r\n\r\n    MSG([[Natural beauty, charisma, intelligence. And an adorable little brother.\r\n生まれながらの容姿に人望。カリスマに知性。\r\n    　そして愛らしい実の弟。]])\r\n\r\n    MSG([[Marika had everything I desperately wanted, and I, who had nothing, couldn’t help but envy her.\r\n私が喉から手が出るほど欲しいモノをすべて持っているマリカを、何も持ってない私は羨まずにはいられなかった。]])\r\n\r\n    MSG([[I should have been satisfied just having Minato beside me. Humans really are greedy.\r\nミナちゃんがそばにいてくれるだけで満足だったはずなのに。\r\n    　人間って、本当に貪欲だよね。]])\r\n\r\n--STOP_BGM(2000)\r\n\r\n    MSG([[And perhaps as punishment for my greed—I lost everything that day.\r\nそして貪欲過ぎた私はその報いからか――あの日すべてを失ったの。]])\r\n\r\n    -- 　　　　◆\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"ERU_EP05_06\")\r\nend\r\n"
}