{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP05_20",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP05/ERI/EP05_20.lua",
  "Text": "function ERI_EP05_20()\r\n    --.エピローグ「ミナトとエリカ」\r\n    SaveData.Title = \"ミナトとエリカ\"\r\n\r\n    --//CG：アキラEND\r\n    LAYER_LOAD(LAYER_BG, \"EV027aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM14.wav\",0)\r\n\r\n    MSG([[A month has already passed since the fierce battle of the Princess Election. I was walking down the main street of Yuriai Private Academy, where the cherry blossoms were falling, together with Erika.\r\n姫皇選挙での激闘から早１ヶ月。 桜の花が散る百合愛学園のメインストリートを、ボクはエリカと一緒に歩いていた。]])\r\n\r\nPLAY_VOICE(\"minato_0937.wav\")\r\n    MSG([[\r\n【Minato】\r\n “The cherry blossoms will all fall soon. How about we all go to see the flowers this weekend?”\r\n「そろそろ桜の花が全部散っちゃうね。この週末は、みんなで花見に行こうか」]])\r\n\r\nPLAY_VOICE(\"erika_1340.wav\")\r\n    MSG([[\r\n【Erika】\r\n “P-please, no…… I'm already struggling to endure living in a group at the academy on weekdays, you know?”\r\n「か、勘弁してくださいよ……ただでさえ平日は、学園で集団生活に必死で耐えてるんですよ？」]])\r\n\r\nPLAY_VOICE(\"erika_1341.wav\")\r\n    MSG([[\r\n【Erika】\r\n “At least on our days off, let me play games, lie around, and just be lazy.”\r\n「休日くらいはゲームして、ごろ寝して、ダラダラさせてください」]])\r\n\r\nPLAY_VOICE(\"minato_0938.wav\")\r\n    MSG([[\r\n【Minato】\r\n “Sorry, sorry. You’re right, Erika. I’ll just laze around with you on the weekends too.”\r\n「ごめんごめん。エリカの言う通りだね、ボクも週末は一緒にゴロゴロするよ」]])\r\n\r\nPLAY_VOICE(\"minato_0939.wav\")\r\n    MSG([[\r\n【Minato】\r\n “Even so, it still feels like a dream. That I can come to the academy like this with Erika in my natural face.”\r\n「それにしても、まだ夢みたいだなぁ。\r\n    　素顔の状態で、エリカとこうして一緒に学園に来れるなんて」]])\r\n\r\nPLAY_VOICE(\"erika_1342.wav\")\r\n    MSG([[\r\n【Erika】\r\n “What are you saying…… You were the one who personally asked the academy, weren’t you? To create a day division for the boys' section too.”\r\n「何を言ってるんですか……アナタ自身で学園に頼んだのでしょう？ 男子部にも昼の部を作って欲しいって」]])\r\n\r\nPLAY_VOICE(\"minato_0940.wav\")\r\n    MSG([[\r\n【Minato】\r\n “Yeah, that’s true.”\r\n「そうなんだけどね」]])\r\n\r\n    MSG([[Having safely become the Princess Emperor, I got the board of directors to approve boys’ participation in some classes as an improvement for the boys' section.\r\n無事に姫皇になったボクは、男子部の待遇の改善案として、一部授業への男子の参加を理事会に認めてもらった。]])\r\n\r\n    MSG([[This year, five new students enrolled in the boys’ section. Not only the highest number ever, but they were also allowed to attend the entrance ceremony alongside the girls’ section.\r\n今年男子部に新たに入学した生徒は５名。 これまでで最多の入学者数であるのに加えて、女子部に混じって入学式にも参加させてもらえたそうだ。]])\r\n\r\n    MSG([[There’s still a barrier between the girls’ and boys’ sections, but compared to when we enrolled, the treatment has improved considerably.\r\nまだまだ女子部との間に壁はあるけれど、ボクらが入学した頃と比べれば、随分と待遇も改善されてきている。]])\r\n\r\nPLAY_VOICE(\"minato_0941.wav\")\r\n    MSG([[\r\n【Minato】\r\n “From now on, while preserving Yuriai Private Academy’s traditions, I hope to lead the academy towards an even better future.”\r\n「これからも、百合愛学園の伝統は守りつつ、よりよい方向に学園を導いていけたら嬉しいな」]])\r\n\r\nPLAY_VOICE(\"erika_1343.wav\")\r\n    MSG([[\r\n【Erika】\r\n “As expected of the top ‘Princess,’ the Princess Emperor. You’re fully committed to your duties.”\r\n「流石は『姫』の頂点、姫皇。立派にお務めを果たす気満々ですね」]])\r\n\r\nPLAY_VOICE(\"minato_0942.wav\")\r\n    MSG([[\r\n【Minato】\r\n “Ugh… I’m done with cross-dressing already, though.”\r\n「ううっ……もう女装はやめたんだけど」]])\r\n\r\nPLAY_VOICE(\"erika_1344.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Minachin said it before, didn’t you? No matter what form you take, you’re still Minachin. To everyone at the academy, you’re still ‘Princess.’”\r\n「ミナちんも前に言ってたじゃないですか。どんな姿でもミナちんはミナちん。学園の皆さんにとっては、『姫』のままなのでしょう」]])\r\n\r\nPLAY_VOICE(\"erika_1345.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Look, your ‘knights’ are here to greet you.”\r\n「ほら、アナタの『騎士』たちがお出迎えですよ」]])\r\n\r\n    MSG([[At the end of the main street, the usual group was gathered, waiting for me.\r\nメインストリートの先では、いつもの面々が揃ってボクを待ってくれていた。]])\r\n\r\nPLAY_VOICE(\"lira_0603.wav\")\r\n    MSG([[\r\n【Lira】\r\n “Princess Minato, GGYY~<sprite=\"Emoji\" name=\"note\"> I didn’t get the homework yesterday, so teach me.”\r\n「ミナト姫、ＧＧＹ～<sprite=\"Emoji\" name=\"note\">　昨日の課題でわからないことあったから教えてよ」]])\r\n\r\n--;吉　テキスト修正「交流会」→「交流」（2020/02/03 03:30）\r\nPLAY_VOICE(\"uran_0396.wav\")\r\n    MSG([[\r\n【Uran】\r\n “Lord Minato, good day. May I have some time to discuss the upcoming exchange between the boys’ and girls’ sections?”\r\n「ミナトさま、ごきげんよう。今度の男子部と女子部の交流について、お話の時間をいただけますか？」]])\r\n\r\nPLAY_VOICE(\"hiyu_0369.wav\")\r\n    MSG([[\r\n【Hiyu】\r\n “Sister Minatoーーーーー! You’re so beautiful today tooー!”\r\n「ミナトお姉さまーーーーー！　今日も麗しいですー！」]])\r\n\r\nPLAY_VOICE(\"schoolgirl_0153.wav\")\r\n    MSG([[\r\n【Female Student】\r\n “Princess Minatoーーーーーーーーーーーーーー!!!”\r\n「ミナト姫さまーーーーーーーーーーーーーー！！！」]])\r\n\r\nPLAY_VOICE(\"minato_0943.wav\")\r\n    MSG([[\r\n【Minato】\r\n “Haha… Everyone really does still treat me as ‘Princess.’”\r\n「はは……みんな確かに、まだボクを『姫』として扱ってくれてるよ」]])\r\n\r\nPLAY_VOICE(\"minato_0944.wav\")\r\n    MSG([[\r\n【Minato】\r\n “I managed to save Sister Marika, but I still can’t let my guard down.”\r\n「マリカ姉さんは救えたけれど、まだまだ気は抜けそうにないね」]])\r\n\r\nPLAY_VOICE(\"erika_1346.wav\")\r\n    MSG([[\r\n【Erika】\r\n “Well, let’s take it easy. For humans, not pushing too hard is the best.”\r\n「まぁのんびりやりましょ。人間、がんばりすぎないくらいが一番です」]])\r\n\r\n    MSG([[Seeing Erika’s mischievous smile, I gave a bitter laugh. Though hardships still lie ahead, I think I can manage somehow.\r\nエリカのイタズラっぽい笑みを見て、苦笑する。\r\n    　まだまだ受難は続くけれど、何とかがんばっていけそうだ。]])\r\n\r\n    MSG([[Because I always have my greatest supporter, who understands me fully, right by my side.\r\nボクには、いつだって支えてくれる最大の理解者が、そばにいるから。]])\r\n\r\n    --//Fin\r\n\r\n    -- 20\tボク姫ＰＲＯＪＥＣＴ\tもう一度、『エリカ』として生きようと思えた\r\n    UNLOCK_TROPHY(20)\r\n\r\n    --　　　　◆\r\nSTOP_BGM(2000)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 2000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    SystemSaveData.IsClearERI = true\r\n\r\n    -- ゲームクリア\r\n    GAME_CLEAR()\r\n\r\n    ScenarioManager.Next(\"\")\r\n\r\nend\r\n"
}