{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP05_03",
  "Path": "Assets/AddressableAssets/Lua/Scenario/EP05/ERI/EP05_03.lua",
  "Text": "function ERI_EP05_03()\r\n    --.起-2【1月第2週】「姫神家の真実」\r\n    SaveData.Title = \"姫神家の真実\"\r\n\r\n    --//CG：姉にすがるミナト（虚ろな目）\r\n    LAYER_LOAD(LAYER_BG, \"EV024ab\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_BGM(\"BGM09.wav\",2000,true)\r\n\r\nPLAY_VOICE(\"minato_0754.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Hey, Marika-neesan, do you remember? That time when my randoseru got hidden at school.\"\r\n「ねえ、マリカ姉さん、覚えてる？　ボクのランドセルが学校で隠されちゃった時のこと」]])\r\n\r\nPLAY_VOICE(\"minato_0755.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"You and your two friends searched for my randoseru together and found it inside the incinerator, right?\"\r\n「姉さんと姉さんのお友達が二人でボクのランドセルを探してくれて、焼却炉の中から見つけてくれたよね」]])\r\n\r\nPLAY_VOICE(\"minato_0756.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"The two of you worked so hard to get rid of the trash smell and dirt... I was really happy back then...\"\r\n「二人で一生懸命、ゴミのニオイや汚れをとってくれて……あの時は本当に嬉しかったなぁ……」]])\r\n\r\n    MSG([[How many days had passed since then?\r\nそれから何日が過ぎただろうか。]])\r\n\r\n    MSG([[I enjoyed my daily conversations with Marika-neesan every day.\r\nボクは毎日毎日、マリカ姉さんとの会話を楽しんでいた。]])\r\n\r\nPLAY_VOICE(\"minato_0757.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"There was also a time when you and your friends asked me to dress like a girl, right?\"\r\n「マリカ姉さんたちがボクに女の子の恰好をするよう、お願いしてた時期もあったよね？」]])\r\n\r\nPLAY_VOICE(\"minato_0758.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"I was embarrassed at that time, but maybe it’s thanks to those experiences that I was able to smoothly learn makeup and styling.\"\r\n「あの時は恥ずかしかったけど、メイクや着こなしをスムーズに覚えられたのはあの頃の経験のおかげかもしれないね」]])\r\n\r\nPLAY_VOICE(\"minato_0759.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"If only I had remembered earlier... school life would have definitely been easier.\"\r\n「もっと早くに思い出せてたら……きっともっと学園生活が楽だったんだけどなぁ」]])\r\n\r\n    MSG([[It's strange how, when I'm in front of Marika-neesan, things I had almost forgotten start coming back to me one after another.\r\nマリカ姉さんを前にしていると、それまで忘れかけていたこともどんどん思い出されていくから不思議だ。]])\r\n\r\n    MSG([[No matter how much we talked, the topics never ran out, and the gloomy feelings gradually lifted. I was back to normal now.\r\nどれだけ話しても話題は尽きず、落ち込んでいた気分はどんどん回復していった。\r\n    　もう、すっかり平常運行だ。]])\r\n\r\nPLAY_VOICE(\"minato_0760.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"By the way... what was the name of the friend of Marika-neesan who was so good at makeup?\"\r\n「そう言えば……あのメイクが上手かったマリカ姉さんのお友達って、何ていう名前だったっけ？」]])\r\n\r\nPLAY_VOICE(\"minato_0761.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"She taught me so many things and protected me when you weren’t around... I loved her just as much as you.\"\r\n「ボクに色んなことを教えてくれて、姉さんがいない時にはボクを守ってくれて……姉さんと同じくらい大好きだったなぁ」]])\r\n\r\nPLAY_VOICE(\"minato_0762.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Huh? It’s strange that I loved her but can’t remember her face or name... I really am such a klutz...\"\r\n「アレ？　大好きだったのに顔も名前も思い出せないなんて、何だかおかしいね……？　本当に、ボクってドジだなぁ……」]])\r\n\r\nPLAY_VOICE(\"minato_0763.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"With me like this, it’s no wonder I can’t protect Marika-neesan.\"\r\n「こんなんじゃ、マリカ姉さんを守れなくて、当たり前だよね」]])\r\n\r\n    MSG([[Now then, I wonder what kind of story we’ll have today.\r\nさぁ、今日はどんなお話をしようかな。]])\r\n\r\n    MSG([[There are so many things I want to talk about. I have plenty of time and energy. Today, I’m going to keep talking with Marika-neesan all day long. We’ll blossom with memories of our times together. Ah, it’s so fun.\r\nお話をしたいことが山ほどある。時間も元気も有り余 ってる。今日もずーっとマリカ姉さんとお話をしていよ う。姉さんとの思い出話に花を咲かせるんだ。ああ、楽]])\r\n\r\n    MSG([[I’m incredibly happy right now. Truly happy. So happy it’s almost troubling. I wish this time would last forever. Marika-neesan feels the same way, right? Yeah, that’s right.\r\nしいな。今ボクはスッゴく幸せだ。本当に幸せ。幸せ過 ぎて困るくらい。こんな時間がずーっと続けばいいのに ね。姉さんもそう思うでしょ？　うん、そうだよね。何]])\r\n\r\n    MSG([[I don’t even need to say it; we understand each other heart to heart.\r\nも言わなくたってわかってるよ。マリカ姉さんとボクは\r\n    心と心で通じ合っているんだから。]])\r\n\r\nPLAY_VOICE(\"minato_0764.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Haha... hahahahaha.\"\r\n「はは……ははははは」]])\r\n\r\nPLAY_VOICE(\"dahlia_0264.wav\")\r\n    MSG([[\r\n【Daria】\r\n \"It’s about time you wake up, Minato Ikusa!\"\r\n「そろそろ目を覚ましたまえ、伊草ミナト！」]])\r\n\r\n    --//CI：ダリアBU（真剣）目元切り抜き 010\r\n    LAYER_LOAD(200,\"BG000aa\")\r\n    LAYER_LOAD(201,\"BUL_DAR01ba\")\r\n    LAYER_POSITION(201,0,-50)\r\n    SET_CUTIN_01_S(200, 300,true)\r\n    PLAY_SE(\"SEc056.wav\")\r\n    DARIA_PARTICLE_01(230,0,230,150,50)\r\n    RESET_CUTIN_00()\r\n    LAYER_LOAD(50,\"BG000ab\")\r\n    SWITCH_SCREEN(\"mask000\",100,false)\r\n    LAYER_LOAD(LAYER_BG,\"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\",800,false)\r\n\r\n    --//SE：椅子から転げ落ちる音（ｽﾞｯﾀｰﾝｺﾞﾛｺﾞﾛ）\r\nPLAY_SE(\"SEc007.wav\")\r\nWAIT(600)\r\n\r\n    MSG([[At that moment, I saw her beautiful, familiar eyes and felt dizzy as I tumbled off the chair.\r\nその時、見覚えのあるキレイな瞳を目にし、眩暈がして椅子から転げ落ちた。]])\r\n\r\n    --//BG：病室\r\n    LAYER_LOAD(LAYER_BG, \"BG009aa\")\r\n    --//BU：ダリア（真剣）\r\n    LAYER_LOAD(50,\"BU_DAR01ba\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_VOICE(\"dahlia_0265.wav\")\r\n    MSG([[\r\n【Daria】\r\nserious \"Minato-kun, can you hear my voice? This time, listen to what I have to say.\"\r\n真剣\r\n    「ミナトくん、私の声が聞こえるか？　今日こそ私の話を聞いてくれたまえ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN04ca\")\r\nPLAY_VOICE(\"minato_0765.wav\")\r\n    MSG([[\r\n【Minato】\r\nsurprised, hospital gown \"D-Daria-san...?\"\r\n驚き・病院服\r\n    「だ、ダリア、さん……？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[Daria-san reached out her hand to the fallen me and spoke.\r\nダリアさんが倒れたボクに手を差し出しながら、語りかけてきた。]])\r\n\r\nPLAY_VOICE(\"dahlia_0266.wav\")\r\n    MSG([[\r\n【Daria】\r\nserious \"Ah, good. It seems my words have finally reached you.\"\r\n真剣\r\n    「ああ、よかった。やっと私の言葉が届いたようだね」]])\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01da\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"dahlia_0267.wav\")\r\n    MSG([[\r\n【Daria】\r\nsad \"I apologize for the harsh treatment. Since you were brought to this hospital room, you’ve gradually lost even the ability to speak...\"\r\n悲しみ 「荒療治になってすまない。この病室に連れてきて以来、キミは日に日に会話すらままならなくなっていたから……」]])\r\n\r\nPLAY_VOICE(\"dahlia_0268.wav\")\r\n    MSG([[\r\n【Daria】\r\nsad \"I had no choice but to use the “<r=アーサーズ・>Battle Princess</r><r=キス>Gaze</r>”.\"\r\n悲しみ\r\n    「やむなく、“<r=アーサーズ・>姫騎士の</r><r=キス>眼差し</r>”を使わせてもらったよ」]])\r\n\r\nPLAY_VOICE(\"dahlia_0269.wav\")\r\n    MSG([[\r\n【Daria】\r\nsad \"Minato-kun, won’t you listen to me today?\"\r\n悲しみ\r\n    「ミナトくん、今日こそ私の話を聞いてくれないか？」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN04da\")\r\nPLAY_VOICE(\"minato_0766.wav\")\r\n    MSG([[\r\n【Minato】\r\nsad, hospital gown \"I-I don’t want to hear anything.\"\r\n悲しみ・病院服\r\n    「な、何も聞きたくありません」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I didn’t take Daria-san’s hand and stood up alone.\r\nダリアさんの手をとらず、一人で立ち上がった。]])\r\n\r\n    MSG([[No matter what I hear now, it won’t change anything. After all, there’s nothing I can do to save Marika-neesan.\r\n今更何を聞いたって意味がない。\r\n    　どうせボクには何もできず、マリカ姉さんを救うことなんてできないのだから。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN04da\")\r\nPLAY_VOICE(\"minato_0767.wav\")\r\n    MSG([[\r\n【Minato】\r\nsad, hospital gown \"All I want is to be able to talk with Marika-neesan. Please leave me alone.\"\r\n悲しみ・病院服\r\n    「ボクはもう、マリカ姉さんとお話ができれば、それでいいんです。放っておいてください」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"dahlia_0270.wav\")\r\n    MSG([[\r\n【Daria】\r\nsad \"I understand your sadness. I’m also terrified to face reality. In fact, I was once someone who ran away from Marika.\"\r\n悲しみ\r\n    「悲しいのはわかる。私だって、現実を直視するのは恐ろしい。実際、一度はマリカの元から逃げ出した人間だ」]])\r\n\r\nPLAY_VOICE(\"dahlia_0271.wav\")\r\n    MSG([[\r\n【Daria】\r\nsad \"But you’re different, right? You’ve faced every harsh situation so far. Even with trembling legs, you moved forward.\"\r\n悲しみ\r\n    「だがキミは違うだろ？　これまでどんなに厳しい状況にだって立ち向かってきた。震える足でも、前に進んできたじゃないか」]])\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01ba\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"dahlia_0272.wav\")\r\n    MSG([[\r\n【Daria】\r\nserious \"I selfishly want you to be strong. Unlike me, I want to believe you can confront reality, Minato-kun.\"\r\n真剣\r\n    「身勝手を承知で言うと、キミには強くあって欲しいんだよ。ミナトくんは私と違って、現実に立ち向かえるヒトだって信じたいんだ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN04da\")\r\nPLAY_VOICE(\"minato_0768.wav\")\r\n    MSG([[\r\n【Minato】\r\nsad, hospital gown \"It’s impossible to confront it. All I can do now is apologize.\"\r\n悲しみ・病院服\r\n    「立ち向かうなんて無理ですよ。ボクにできることなんて、もう謝罪くらいなものです」]])\r\n\r\nPLAY_VOICE(\"minato_0769.wav\")\r\n    MSG([[\r\n【Minato】\r\nsad, hospital gown \"Or better yet, should I go to Yuriai Private Academy right now and kneel down, apologizing for deceiving everyone all this time?\"\r\n悲しみ・病院服 「それとも今から百合愛学園に行って、ずっと騙していましたごめんなさいと、土下座すればいいですか？」]])\r\n\r\nPLAY_VOICE(\"minato_0770.wav\")\r\n    MSG([[\r\n【Minato】\r\nsad, hospital gown \"If so, I’m more than willing. Let’s go immediately.\"\r\n悲しみ・病院服\r\n    「それなら大歓迎ですので、今すぐに行きましょう」]])\r\n\r\nPLAY_VOICE(\"minato_0771.wav\")\r\n    MSG([[\r\n【Minato】\r\nsad, hospital gown \"Because I have done something that bad.\"\r\n悲しみ・病院服\r\n    「ボクはそれほどのことを、しでかしてしまったのですから」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"dahlia_0273.wav\")\r\n    MSG([[\r\n【Daria】\r\nserious \"No. No one asks for an apology.\"\r\n真剣\r\n    「違う。謝罪など誰も求めてはいない」]])\r\n\r\n    MSG([[Daria-san grabbed my shoulder and spoke with shaking shoulders.\r\nダリアさんがボクの肩を掴み、肩を震わせながら語る。]])\r\n\r\nPLAY_VOICE(\"dahlia_0274.wav\")\r\n    MSG([[\r\n【Daria】\r\nserious \"Get a grip. As Erika Ikusa, you brought much benefit to Yuriai Private Academy, no harm.\"\r\n真剣\r\n    「しっかりしたまえ。キミは伊草エリカとして、百合愛学園に多くの益はもたらせど、害はもたらさなかったじゃないか」]])\r\n\r\nPLAY_VOICE(\"dahlia_0275.wav\")\r\n    MSG([[\r\n【Daria】\r\nserious \"Unlike me and Nemesia, those who know you must understand how deeply you truly loved Yuriai Private Academy from your heart.\"\r\n真剣 「私やネメシアとは違う。キミが本当に心の底から百合愛学園を愛していたことは、キミを知る者たちはわかっているはずだ」]])\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01da\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"dahlia_0276.wav\")\r\n    MSG([[\r\n【Daria】\r\nsad \"In fact, Yuriai Private Academy, having lost someone as central as you, is now about to fall into Nemesia’s hands. At this rate, that school is finished.\"\r\n悲しみ 「事実、キミという中核を失った百合愛学園は今、ネメシアの手中に収まろうとしている。このままでは、あの学園はお終いだ」]])\r\n\r\n    MSG([[――Yuriai Private Academy falling into Nemesia Himegami’s hands?\r\n――百合愛学園が、ネメシアさんの手に？]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN04da\")\r\nPLAY_VOICE(\"minato_0772.wav\")\r\n    MSG([[\r\n【Minato】\r\nsad, hospital gown \"What does that mean?\"\r\n悲しみ・病院服\r\n    「それは、どういう意味ですか？」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01ba\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"dahlia_0277.wav\")\r\n    MSG([[\r\n【Daria】\r\nserious \"Think about it. You defeated Lira-kun, Uran-kun, and even me in the Princess Election. It’s fair to say the academy’s popularity was divided between Hermes and Erika-kun.\"\r\n真剣 「考えてもみろ。キミはリラくんにウランくん、それに私まで姫選挙で下したんだ。学園の人気はもはや、エルメスとエリカくんに二分されていたと言ってもいい」]])\r\n\r\nPLAY_VOICE(\"dahlia_0278.wav\")\r\n    MSG([[\r\n【Daria】\r\nserious \"What happens if your position is lost in such a situation? Obviously, all support will naturally concentrate on the last remaining princess, Hermes. Just as Nemesia planned.\"\r\n真剣 「そんな状況でキミの地位が失墜すれば、どうなると思う？　当然、残った最後の姫エルメス一人に支持が集中するさ。ネメシアの計画通りにね」]])\r\n\r\nPLAY_VOICE(\"dahlia_0279.wav\")\r\n    MSG([[\r\n【Daria】\r\nserious \"After that, all they need to do is have Hermes speak their words, and the academy will be manipulated exactly as Nemesia wishes.\"\r\n真剣 「あとはもう、エルメスに自分の言葉を代弁させれば、ネメシアの思い通りに学園は操れるというワケだよ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN04da\")\r\nPLAY_VOICE(\"minato_0773.wav\")\r\n    MSG([[\r\n【Minato】\r\nsad, hospital gown \"Is that... what it means?\"\r\n悲しみ・病院服\r\n    「そういう、ことですか」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    MSG([[I understood Nemesia-san’s motive when she exposed my cross-dressing at that timing. There was one more thing I realized.\r\nあのタイミングでボクの女装を暴いたネメシアさんの狙いはよくわかった。\r\n    　それとわかったことはもうひとつ。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN04da\")\r\nPLAY_VOICE(\"minato_0774.wav\")\r\n    MSG([[\r\n【Minato】\r\nsad, hospital gown \"...So Daria-san deliberately held back in the final Princess Election against me?\"\r\n悲しみ・病院服\r\n    「……だからダリアさんはボクとの姫選挙の最後で、わざと手を抜いたんですか？」]])\r\n\r\nPLAY_VOICE(\"minato_0775.wav\")\r\n    MSG([[\r\n【Minato】\r\nsad, hospital gown \"By gathering support for me, then revealing my true identity, to concentrate popularity solely on Hermes-san.\"\r\n悲しみ・病院服 「ボクへの支持を集めてから正体を晒すことで、エルメスさん一人に人気を集中させるために」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01da\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"dahlia_0280.wav\")\r\n    MSG([[\r\n【Daria】\r\nsad \"...That’s right. I found the contest with you interesting and got serious, but in the end, I held back as Nemesia ordered.\"\r\n悲しみ\r\n    「……その通りだ。キミとの駆け引きが面白くてつい本気を出してしまっていたが、最後にはネメシアの指示通り、手を抜いてしまった」]])\r\n\r\nPLAY_VOICE(\"dahlia_0281.wav\")\r\n    MSG([[\r\n【Daria】\r\nsad \"Losing this Princess Election was the final condition for severing ties with the Himegami family.\"\r\n悲しみ\r\n    「今回の姫選挙で負けることが、姫神家との縁を切るための、最後の条件だったんだ」]])\r\n\r\nPLAY_VOICE(\"dahlia_0282.wav\")\r\n    MSG([[\r\n【Daria】\r\nsad \"As a 'princess' standing on the stage of the Princess Election and as a martial artist, I believe no apology to you is enough. I am truly sorry.\"\r\n悲しみ 「姫選挙の場に立った『姫』として、武道家として、キミにはいくら謝罪しても足りないと思っている。本当に申し訳なかった」]])\r\n\r\n    MSG([[Learning the truth behind that confusing match gave me some relief.\r\nあの腑に落ちなかった試合の真相を知ることができて、少し安心する。]])\r\n\r\n    MSG([[At the same time, anger welled up inside me toward Nemesia-san for ruining the match.\r\n同時に、試合を台無しにしたネメシアさんへの怒りが込み上げてきた。]])\r\n\r\n    MSG([[But that anger soon faded. After all, nothing has changed—I still can’t do anything.\r\nでもその怒りもすぐに萎んでしまう。\r\n    　結局、今のボクには何もできないことは変わらない。]])\r\n\r\n    MSG([[Because I have already lost to Nemesia-san.\r\nボクはもう、ネメシアさんに負けてしまったのだから。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN04da\")\r\nPLAY_VOICE(\"minato_0776.wav\")\r\n    MSG([[\r\n【Minato】\r\nsad, hospital gown \"It should be fine to leave it to Hermes-san. I know well how much she loves Yuriai Private Academy.\"\r\n悲しみ・病院服\r\n    「エルメスさんならまかせて大丈夫でしょう。あのヒトがどれだけ百合愛学園を愛しているか、ボクはよく知っています」]])\r\n\r\nPLAY_VOICE(\"minato_0777.wav\")\r\n    MSG([[\r\n【Minato】\r\nsad, hospital gown \"No matter what Nemesia says, she shouldn’t lead Yuriai Private Academy in a bad direction.\"\r\n悲しみ・病院服\r\n    「いくらネメシアさんの言葉だからって、百合愛学園を悪い方向には導かないはずです」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01ba\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"dahlia_0283.wav\")\r\n    MSG([[\r\n【Daria】\r\nserious \"Yes... if it’s only Hermes. She harbors no malice. As her sister who loves her, I guarantee that she is an innocent child.\"\r\n真剣\r\n    「ああ……エルメスだけならな。エルメスに悪意はない。あの子は純真無垢な子どもだ。それは彼女を愛する姉として、保証しよう」]])\r\n\r\nPLAY_VOICE(\"dahlia_0284.wav\")\r\n    MSG([[\r\n【Daria】\r\nserious \"But because she’s pure, she blindly obeys Nemesia’s words. For Hermes, Nemesia’s words are absolute. She was raised never to doubt them.\"\r\n真剣 「だが純粋だからこそ、ネメシアの言葉に迷わず従ってしまう。エルメスにとって、ネメシアの言葉は絶対。疑いを持たぬよう、育てられてきたんだ」]])\r\n\r\nPLAY_VOICE(\"dahlia_0285.wav\")\r\n    MSG([[\r\n【Daria】\r\nserious \"Because of that purity, Hermes shows no pretenses. No malice can be sensed. She’s an unknowing puppet sacrificed to the Himegami family’s designs.\"\r\n真剣 「純粋だからこそ、エルメスには演技くささがない。悪意が一切感じられない。無自覚のまま姫神家の企みに殉ずる、操り人形なのさ」]])\r\n\r\n--;吉　テキスト修正「実現するためだけに」→「実現するために」（2020/02/02 01:03）\r\nPLAY_VOICE(\"dahlia_0286.wav\")\r\n    MSG([[\r\n【Daria】\r\nserious \"Hermes was created to realize the 'supreme' beauty Nemesia Himegami venerates.\"\r\n真剣\r\n    「エルメスは姫神ネメシアが至高とする“美”を実現するために、生み出された存在だからね」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN04ca\")\r\nPLAY_VOICE(\"minato_0778.wav\")\r\n    MSG([[\r\n【Minato】\r\nsurprised, hospital gown \"C-Created to realize the ‘supreme’ beauty...?\"\r\n驚き・病院服\r\n    「し、至高の“美”の実現のために、生み、出された……？」]])\r\n\r\nPLAY_VOICE(\"minato_0779.wav\")\r\n    MSG([[\r\n【Minato】\r\nsurprised, hospital gown \"N-No way. There’s no way she would train her own child like that.\"\r\n驚き・病院服\r\n    「ま、まさか。自分の子どもに、そんな教育するワケないじゃないですか」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\nPLAY_VOICE(\"dahlia_0287.wav\")\r\n    MSG([[\r\n【Daria】\r\nserious \"She does. Nemesia’s obsession with ‘beautiful girls’ is that extreme.\"\r\n真剣\r\n    「するんだよ。それほどに、姫神ネメシアの『美少女』へのこだわりは常軌を逸しているんだ」]])\r\n\r\nPLAY_VOICE(\"dahlia_0288.wav\")\r\n    MSG([[\r\n【Daria】\r\nserious \"In fact, simply because it didn’t suit her own aesthetic sense, she forced the coeducation of Yuriai Private Academy.\"\r\n真剣 「実際、自分の美的感覚と合わないという理由だけで、ヤツは百合愛学園の共学化を強行してきた」]])\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01da\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"dahlia_0289.wav\")\r\n    MSG([[\r\n【Daria】\r\nsad \"She enrolled Hermes, an advocate of her own will, and thoroughly pressured Marika, who was the leader of the conservatives.\"\r\n悲しみ\r\n    「自分の意志を代弁するエルメスを入学させ、保守派の筆頭であったマリカを徹底的に追い込んでね」]])\r\n\r\n    MSG([[Daria-san approached the sleeping Marika-neesan and gently touched her side hair.\r\nダリアさんが眠るマリカ姉さんへと近づいて、横髪にそっと触れる。]])\r\n\r\n    MSG([[Her profile looked so affectionate, filled with deep love.\r\nその横顔はとても愛おしげで、深い愛情が感じられた。]])\r\n\r\n--;吉　テキスト修正「愛していた」→「愛してた」（2020/02/02 01:07）\r\nPLAY_VOICE(\"dahlia_0290.wav\")\r\n    MSG([[\r\n【Daria】\r\nsad \"I doubt you’ll believe it now, but I truly loved Marika. She was the only one I could truly trust, and I believe she trusted me, too.\"\r\n悲しみ 「今さら信じてもらえないと思うけど、私はマリカを心から愛してた。マリカほど心を許せた相手はいないし、彼女も私を信頼してくれていたと信じている」]])\r\n\r\nPLAY_VOICE(\"dahlia_0291.wav\")\r\n    MSG([[\r\n【Daria】\r\nsad \"I often listened to Marika’s weak words when she was troubled as a conservative, right there in her bed. Ah, I think we once even stormed the board of directors together?\"\r\n悲しみ 「保守派として思い悩むマリカの弱音を、ベッドの中でよく聞いてあげていたよ。ああ、二人で理事会に乗り込んだこともあったかな？」]])\r\n    -- //添い寝です。マリカとルームメイトだったダリアさんは落ち込むとよく添い寝をしてあげてましたが、マリカのことが好きすぎて手を出せませんでした。\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01ea\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"dahlia_0292.wav\")\r\n    MSG([[\r\n【Daria】\r\nsmile \"Marika’s speech was effective—we somehow managed to reduce the number of boys in the division to fewer than five. It was very thrilling.\"\r\n笑顔 「マリカの演説が効いて、男子部の枠を何とか５人以下に減らすことができてね。とても痛快だったな」]])\r\n\r\n    MSG([[Daria-san chuckled softly. But a single tear flowed from her eye.\r\nクスクスと笑うダリアさん。\r\n    　でもその眼からは、一筋の涙が流れていた。]])\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01da\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"dahlia_0293.wav\")\r\n    MSG([[\r\n【Daria】\r\nsad \"That’s why Nemesia used me to eliminate Marika. She threatened me and forced me to stay away from Marika.\"\r\n悲しみ\r\n    「だからこそネメシアは、マリカを排除するために私を利用した。私を脅して、マリカに近づかないよう強制したんだ」]])\r\n\r\nPLAY_VOICE(\"dahlia_0294.wav\")\r\n    MSG([[\r\n【Daria】\r\nsad \"I... couldn’t defy Nemesia. Trusting Marika wouldn’t succumb to malice, I kept silent and kept my distance.\"\r\n悲しみ\r\n    「私は……ネメシアに逆らえなかった。マリカなら悪意に屈しないでくれると信じて、彼女に何も言わず、距離をとることしかできなかった」]])\r\n\r\nPLAY_VOICE(\"dahlia_0295.wav\")\r\n    MSG([[\r\n【Daria】\r\nsad \"The result is as you know. I abandoned my closest friend. What I told you before—that I’m the one who pushed Marika to the edge—is true.\"\r\n悲しみ 「結果は知っての通りだよ。私は一番の親友を見殺しにしてしまった。以前キミに話した、マリカを追い込んだ犯人が私という言葉に、偽りはないんだ」]])\r\n\r\nPLAY_VOICE(\"dahlia_0296.wav\")\r\n    MSG([[\r\n【Daria】\r\nsad \"However... it seems my betrayal alone wasn’t the whole reason. Maybe it was my arrogance to think Marika trusted me.\"\r\n悲しみ\r\n    「どうやら……私の裏切りだけが理由ではないみたいだがね。マリカに信頼されていたというのは、私の思い上がりだったのかもしれないな」]])\r\n\r\n    MSG([[Speaking with self-mockery, Daria-san headed for the door. She put her hand on the door, looked back at me, and spoke.\r\n自嘲するように言うと、ダリアさんは扉へと向かった。\r\n    　扉へと手をかけ、ボクを振り返り、語る。]])\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01ba\")\r\n    SWITCH_SCREEN(\"mask000\",300,true)\r\n\r\nPLAY_VOICE(\"dahlia_0297.wav\")\r\n    MSG([[\r\n【Daria】\r\nserious \"If there’s a cause for the wounds in Marika’s heart other than me, it’s that I couldn’t stop Nemesia’s malice.\"\r\n真剣\r\n    「マリカの心に傷を負わせた要因が私以外にあるとしたら、ネメシアの悪意を止められなかったことだ」]])\r\n\r\nPLAY_VOICE(\"dahlia_0298.wav\")\r\n    MSG([[\r\n【Daria】\r\nserious \"If I could have stopped Nemesia, maybe...\"\r\n真剣\r\n    「ネメシアを止められたなら、もしかしたら……」]])\r\n\r\n    LAYER_LOAD(50,\"BU_DAR01da\")\r\n    SWITCH_SCREEN(\"mask000\",300,false)\r\n    LAYER_MOVE_ALPHA(50,0,500,Ease.InSine)\r\n    LAYER_MOVE_POSITION(50,200,0,500,Ease.InSine)\r\n    WAIT(500)\r\n    LAYER_LOAD(50,\"\")\r\n\r\n    MSG([[There she hesitated and then left the hospital room.\r\nそこで言いよどんで、ダリアさんが病室を後にする。]])\r\n    --//SE：引き戸の開閉音（すーっ）\r\nPLAY_SE(\"SEb004.wav\")\r\nWAIT(800)\r\n\r\n    MSG([[Left alone, I looked up at the ceiling and absentmindedly thought.\r\n一人残されたボクは天井を見上げて、ボーっと考える。]])\r\n\r\n    MSG([[If I could stop Nemesia-san, maybe Marika-neesan would wake up...?\r\nネメシアさんを止められたらマリカ姉さんが目を覚ますかもしれないって……？]])\r\n\r\n    MSG([[What could I possibly do against someone even Marika-neesan couldn’t overcome and whom even Daria-san had to obey?\r\nマリカ姉さんでも打ち勝てず、ダリアさんすら言いなりになるしかなかった相手に対して、今のボクに何ができると言うんだろう。]])\r\n\r\n    MSG([[I can’t do anything. I shouldn’t be able to. After all, I’ve already lost everything.\r\n何もできない。できるはずがない。\r\n    　どうせボクはもう、すべてを失ったのだから。]])\r\n    --//CG：姉にすがるミナト（虚ろな目）\r\n    LAYER_LOAD(LAYER_BG, \"EV024ab\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_VOICE(\"minato_0780.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"That’s right... Marika-neesan.\"\r\n「そうだよね……マリカ姉さん」]])\r\n\r\n    MSG([[And with that, I resumed my conversation with Neesan—\r\nそしてまた、姉さんとの対話を再開した――]])\r\n    --　　　　　◆\r\nSTOP_BGM(1000)\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n    WAIT_INPUT(1000)\r\n\r\n    ScenarioManager.Next(\"ERI_EP05_04\")\r\nend\r\n"
}