{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "EP_OGA_02",
  "Path": "Assets/AddressableAssets/Lua/Scenario/Other/EP_OGA_02.lua",
  "Text": "function EP_OGA_02()\r\n  -- .[オウガルート]承『さようなら、百合愛学園』\r\n  SaveData.Title = \"さようなら、百合愛学園\"\r\n\r\n  -- //BG：黒バック\r\n  LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n\r\n  -- //BU：ミナト・悲しみ\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01da\")\r\nPLAY_VOICE(\"minato_plus0025.wav\")\r\n  MSG([[\r\n【Minato】\r\n \"I'm sorry... Marika-nee. It seems I can't protect you... the people I cherish.\"\r\n「ごめんね……マリカ姉さん。ボクには姉さんを……大切なヒトを守ることなんて、できないみたいだ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[After that, I continued attending Yuriai Private Academy for a while.\r\nそれからしばらくの間は、百合愛学園に通い続けてみた。]])\r\n\r\n  MSG([[But since I couldn’t make use of my position as a 'Princess,' there was no way to gather any clues about Marika-nee――\r\nでも、『姫』としての立場を活かせない以上、マリカ姉さんに関する手がかりを集められるワケもなくて――]])\r\n\r\n  -- //BG：メインストリート（冬）夕方\r\n  LAYER_LOAD(LAYER_BG,\"BG019bc\")\r\n  SWITCH_SCREEN(\"mask017\",1000,false)\r\n\r\n  MSG([[Time just passed by in vain.\r\nいたずらに時間ばかりが過ぎていく。]])\r\n\r\n  MSG([[There were only two months left until the time limit to decide Marika-nee’s future. I couldn’t afford to leisurely attend the academy anymore.\r\nマリカ姉さんの今後を決断するタイムリミットまで残り二ヶ月。 もう、悠長に学園に通っている場合じゃない。]])\r\n\r\n  -- //BU：ミナト（悲しみ）\r\n\r\n  MSG([[So I decided to quit Yuriai Private Academy and search for clues to wake Marika-nee from a different approach.\r\nそしてボクは百合愛学園を退学し、マリカ姉さんを目覚めさせる手がかりを、別の方面から探っていくことを決意した。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01da\")\r\nPLAY_VOICE(\"minato_plus0026.wav\")\r\n  MSG([[\r\n【Minato】\r\n \"Today... will probably be the last time I walk down this tree-lined path.\"\r\n「今日で……この並木道を歩くのも最後かな」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[I remember walking nervously on the entrance exam day—it feels so nostalgic now.\r\n入試の日にドキドキしながら歩いたことが、今ではとても懐かしい。]])\r\n\r\n  MSG([[From entering Yuriai Private Academy until today, so many things have happened.\r\n百合愛学園に入学してから今日まで、本当にたくさんの出来事があった。]])\r\n\r\n  MSG([[I made lots of friends, met rivals, experienced countless joys and hardships.\r\n多くの友達ができて、ライバルとも出会って、楽しいことも、辛いことも、数え切れないほど経験した。]])\r\n\r\n  MSG([[Above all, the days I cross-dressed to attend the prestigious all-girls school are something I will never forget.\r\nそして何より、女装でお嬢様学校に通った日々は、決して忘れられない。]])\r\n\r\n  MSG([[That turbulent school life ends today.\r\nそんな波乱に満ちた学園生活が、今日で終わる。]])\r\n\r\n  -- //BG：校舎前（夕方）\r\n  LAYER_LOAD(LAYER_BG, \"BG011ba\")\r\n  SWITCH_SCREEN(\"mask002\" , 1000,false)\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01fa\")\r\nPLAY_VOICE(\"minato_plus0027.wav\")\r\n  MSG([[\r\n【Minato】\r\n \"The withdrawal process... was accepted so easily. From now on, I’m no longer a student of Yuriai Private Academy.\"\r\n「退学処理……あっさりと受け取ってもらえたなぁ。これでもう、ボクは百合愛学園の生徒じゃなくなるんだ」]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01fc\")\r\nPLAY_VOICE(\"minato_plus0028.wav\")\r\n  MSG([[\r\n【Minato】\r\n \"I hated cross-dressing to attend school at first, but now I even feel a bit lonely... getting used to something is scary.\"\r\n「最初はアレだけ女装での通学を嫌がっていたのに、ちょっと寂しく思うなんて……慣れって怖いなぁ」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[I tried heading straight for the school gate but stopped in my tracks.\r\nそのまま校門に向かおうとして、足が止まる。]])\r\n\r\n  MSG([[――Today is the last day. I should properly see the other school building that’s been part of my life.\r\n――今日で最後なんだ。\r\n  　ボクにとってのもうひとつの校舎も、ちゃんと見ておこう。]])\r\n\r\n  MSG([[No sooner had I thought that than I headed toward the boys’ division building.\r\n思うが早いか、ボクは男子部の校舎へと向かった。]])\r\n\r\n  -- //BG：男子部校舎（夕方）\r\n  LAYER_LOAD(LAYER_BG, \"BG021ba\")\r\n  SWITCH_SCREEN(\"mask002\" , 1000)\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01da\")\r\nPLAY_VOICE(\"minato_plus0029.wav\")\r\n  MSG([[\r\n【Minato】\r\n \"At least, I wanted to greet everyone in the boys’ division...\"\r\n「せめて、男子部の皆さんだけには……挨拶していきたかったけど」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[There were no classes today. Neither the girls’ division nor the boys’ division came to the academy.\r\n今日は授業がお休み。\r\n  　女子部も、男子部も、学園に来ていない。]])\r\n\r\n  MSG([[If, after the break, Erika Ikusa and Minato's cousins were found to have withdrawn together, it would cause a big uproar.\r\nきっと休み明けに伊草エリカ、ミナトの従兄妹たちが、二人一緒に退学したと知れたら、大きな騒ぎになるだろう。]])\r\n\r\n  MSG([[Especially to Hiyu-san and the others in the 'Knights,' I must apologize. But since I can’t explain the circumstances behind leaving the academy, I think it’s best to leave without saying anything.\r\n特に、ヒユさんたち『騎士』の皆さんには申し訳ない。 でも、学園を去る事情を話せない以上、何も言わずに去るのが、最も正しいと思うんだ。]])\r\n\r\n  MSG([[Because the Battle Princess 'Erika Ikusa' will never appear again at Yuriai Private Academy.\r\n戦姫『伊草エリカ』が百合愛学園に現れることは、もう決してないのだから。]])\r\n\r\nLAYER_LOAD_FACE(\"BU_MIN01ja\")\r\nPLAY_VOICE(\"minato_plus0030.wav\")\r\n  MSG([[\r\n【Minato】\r\n \"I truly think I’m glad I could attend, even if just for a little while. Farewell, Yuriai Private Academy.\"\r\n「少しの間だけでも通えてよかったって、心から思うよ。\r\n  　さようなら、百合愛学園」]])\r\nLAYER_LOAD_FACE(\"\")\r\n\r\n  MSG([[I turned my back to the school building and really tried to head toward the gate this time. But when I looked back, there was an unexpected person waiting for me.\r\nボクは校舎に背を向けて、今度こそ本当に、校門へと向かおうとした。 ところが、振り返った先に、意外な人物が待ち受けていた。]])\r\n\r\n  -- 　　　◆\r\n  LAYER_LOAD(LAYER_BG, \"\")\r\n  SWITCH_SCREEN(\"mask000\" , 1000,false)\r\nWAIT_INPUT(1000)\r\n\r\n  ScenarioManager.Next(\"EP_OGA_03\")\r\n\r\nend"
}