{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "Visual_LV2",
  "Path": "Assets/AddressableAssets/Lua/Scenario/Training/Visual_LV2.lua",
  "Text": "function Visual_LV2()\r\n    -- ※以下、①を選択した場合\r\n    -- .女装稽古【ビジュアル】LV.2「ガールズファッション講座-応用編-」\r\n\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    PLAY_BGM(\"BGM11.wav\",1000,true)\r\n    -- //CG：ミニスカートを穿かされるエリカ\r\n    LAYER_LOAD(LAYER_BG, \"EV045ad\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n\r\nPLAY_VOICE(\"akira_1189.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Today, you'll get used to miniskirts and pumps.\"\r\n「今日はミニスカとパンプスに慣れてもらいます」]])\r\n\r\nPLAY_VOICE(\"erika_2442.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Eek! It’s shorter than I thought...\"\r\n「ひいいっ！　お、思ったより短い……」]])\r\n\r\n    MSG([[The skirt I changed into under Akira’s direction was so short that even from my own eyes, it seemed like my panties might be visible.\r\nアキラの指示で履き替えたスカートは、穿いているボク自身の目からもパンツが見えそうなほど短い。]])\r\n\r\n    MSG([[It’s worlds apart from the long skirt I usually wear as part of the uniform. I have to be careful, or my underwear will be completely exposed to everyone around me.\r\n普段制服として穿いている丈の長いスカートとは段違いだ。 気をつけないと、周りから下着が丸見えになってしまう。]])\r\n\r\nPLAY_VOICE(\"akira_1190.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"There are various types of skirts. The design you usually wear as your uniform, Mina-chin, is called a cocoon skirt, where the waist area flares out softly.\"\r\n「スカートにも色々と種類があるんですよ。普段ミナちんが制服として穿いているデザインは、腰周りがふんわり膨らんだコクーンスカートと言います」]])\r\n\r\nPLAY_VOICE(\"akira_1191.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Since your waist is thicker compared to a female’s, it’s a design that’s convenient for cross-dressing.\"\r\n「ミナちんも流石に腰周りは女性と比べて太めですからね、女装には都合のいいデザインでしょう」]])\r\n\r\nPLAY_VOICE(\"erika_2443.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Now that you mention it, that’s true.\"\r\n「そう言われてみると、確かに」]])\r\n\r\n    MSG([[This skirt I’m wearing now barely reaches above my knees and fits tightly to my body, so the width of my hips stands out clearly.\r\n今穿いているスカートは膝の上くらいまでしかなく、体型にもフィットしているため、腰の太さがよくわかる。]])\r\n\r\n    MSG([[People probably won’t immediately guess my gender at a glance, but many would sense something off.\r\nひと目で性別を見抜かれることは少ないかもしれないけれど、違和感を覚えるヒトは多いはずだ。]])\r\n\r\n    MSG([[It’s interesting that even just choosing a skirt involves suitability for cross-dressing.\r\nスカート１つをとってみても、女装の向き不向きがあるなんて面白いなぁ。]])\r\n\r\nPLAY_VOICE(\"akira_1192.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"By the way, the one you’re wearing now is a pleated skirt. It’s not so trendy lately, but it’s still commonly used as a uniform skirt.\"\r\n「ちなみに、今穿いているのはプリーツスカートです。最近の流行りではないですけど、制服のスカートとしてはよく採用されています」]])\r\n\r\nPLAY_VOICE(\"akira_1193.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Honestly, Mina-chin, you’re tall and mature looking for a girl, so I think you’d look better in longer, casual skirts like flared or trench skirts.\"\r\n「正直、ミナちんは女の子にしては長身で大人びて見えますし、フレアスカートとかトレンチスカートとか、丈が長めでカジュアルな方が似合うと思うんですけどね」]])\r\n\r\nPLAY_VOICE(\"akira_1194.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Since I want you to build awareness to avoid your skirt flipping up, I deliberately went with a mini skirt.\"\r\n「スカートがめくれない意識も鍛えて欲しいので、あえてミニにしました」]])\r\n\r\nPLAY_VOICE(\"erika_2444.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Deliberately...? You—you’re being strict on purpose because you care about me, right...? I’m trusting you...\"\r\n「あえて……？　ぼ、ボクを思って、あえて厳しくしてるん、だよね…？\r\n    　信じてるよ…？」]])\r\n\r\nPLAY_VOICE(\"akira_1195.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Of course. It’s for your growth, Mina-chin. Half of it, at least.\"\r\n「当然ですよ、ミナちんの成長のためです。半分は」]])\r\n\r\nPLAY_VOICE(\"erika_2445.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"The other half is!?\"\r\n「もう半分は！？」]])\r\n\r\n    MSG([[Akira didn’t answer my question but instead placed a pair of high-heeled shoes I had set aside by my feet.\r\nアキラはボクの質問に応えず、脇に用意していた、かかとの高い靴をボクの足元へと置いた。]])\r\n\r\n    -- //CI：ローヒールのパンプス 081\r\n    LAYER_LOAD(50,\"CI081a\")\r\n    LAYER_POSITION(50,0,-200)\r\n    LAYER_MOVE_POSITION(50,0,0,500,Ease.OutSine)\r\n    SWITCH_SCREEN(\"mask000\",500,false)\r\n\r\nPLAY_VOICE(\"akira_1196.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Now, put on these shoes with that skirt.\"\r\n「さぁ、そのスカートでこの靴を履いてください」]])\r\n\r\nPLAY_VOICE(\"erika_2446.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"H-high heels...? I’m supposed to wear these?\"\r\n「は、ハイヒール……？　これを履くの？」]])\r\n\r\n    MSG([[Obediently, I timidly extended one foot into the shoe. There are no fasteners, so my toes slid all the way in, fitting snugly.\r\n言われるがまま、恐る恐る靴の中へと片方の足を伸ばす。\r\n    　留め具などはないので、そのまま爪先が奥へ滑り込んでいって、ピッタリとフィットした。]])\r\n\r\n    MSG([[The feeling is strange since I’ve never worn shoes like this before. Alright, I’ll quickly put the other one on too.\r\n履いたことがない感覚で面白い。\r\n    　このまま、もう片方もパパっと履いてしまおう。]])\r\n\r\nPLAY_VOICE(\"akira_1197.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Ah, Mina-chin, standing on one foot like that is dangerou—\"\r\n「あ、ミナちん。その状態で片足立ちになるのは危な――」]])\r\n\r\n    MSG([[The moment I lifted one foot off the ground, my body wobbled.\r\n片方の足を宙に浮かしたと同時に、ぐらりと身体が傾いた。]])\r\n\r\n    MSG([[Eh?! My balance is way worse than I thought, and I’m scared—\r\nえっっっっ！\r\n    　思ったよりバランスが悪くて、怖――]])\r\n\r\n    -- //SE：転ぶ\r\nPLAY_SE(\"SEc034.wav\")\r\n\r\n    -- //CI：転ぶ雑エリカ 082\r\n    LAYER_LOAD(50,\"CI082a\")\r\n    SWITCH_SCREEN(\"mask000\",500,false)\r\n    LAYER_EFFECT(50,6,40,40,500,false)\r\n\r\nPLAY_VOICE(\"erika_2447.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Fugya!\"\r\n「ふぎゃっ！」]])\r\n\r\nPLAY_VOICE(\"akira_1198.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"How indecent. This isn’t a sight good children should see.\"\r\n「あら卑猥。良い子には見せられない光景ですね」]])\r\n\r\n    MSG([[The instability was worse than I expected, and I fell over on the spot. My bottom hurts... at least it was on the carpet.\r\n思った以上に不安定で、その場でひっくり返ってしまった。\r\n    　お尻が痛い……転んだのが絨毯の上で良かった。]])\r\n\r\n    MSG([[Do girls really walk around town wearing things like this? Is this some kind of training?\r\nお、女の子って、こんなモノを履いて街を歩いているの…？\r\n    　何かの修行なの…？]])\r\n\r\nPLAY_VOICE(\"akira_1199.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Until you get used to it, it’s good to put them on while sitting or holding onto something.\"\r\n「慣れるまでは何か手をついたり、座ったりした状態で履くといいですよ。]])\r\n\r\nPLAY_VOICE(\"erika_2448.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Y-you could have said that first...\"\r\n「さ、先に言ってよぉ……」]])\r\n\r\n    -- //CI：なし\r\n    SWITCH_SCREEN(\"mask007\",1000,false)\r\n    LAYER_MOVE_ALPHA(50,0,1000,Ease.InSine)\r\n    LAYER_MOVE_POSITION(50,0,-400,1000,Ease.InSine)\r\n    WAIT(1000)\r\n    LAYER_LOAD(50,\"\")\r\n\r\n    MSG([[Somehow managing to stand up, I tried putting them on while holding onto the wall. It feels a bit funny with the floor tilted, but it’s still wobbly. I’m not confident I could run or jump in these shoes.\r\n何とか立ち上がって、今度は壁に手をついた状態で履いてみた。 床に角度がついているみたいでちょっと面白いけど、やっぱり不安定。 この靴で走ったり跳んだりする自信はない。]])\r\n\r\nPLAY_VOICE(\"erika_2449.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"My feet wobble and it’s scary like I might fall... Are all high heels like this?\"\r\n「あ、足元がグラついて、コケそうで怖いんだけど……ハイヒールって全部こんな感じなの？」]])\r\n\r\nPLAY_VOICE(\"akira_1200.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Fufufu, what are you saying, Mina-chin? Those are low heels, you know?\"\r\n「ふっふっふ。何を言ってるんですかミナちん。それはローヒールですよ？」]])\r\n\r\nPLAY_VOICE(\"erika_2450.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Low heels? What’s that?\"\r\n「えっ？　ろ、ローヒール？　何それ」]])\r\n\r\nPLAY_VOICE(\"akira_1201.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Heels refer to the height of the heel, and shoes like the ones you’re wearing now are called pumps.\"\r\n「ヒールというのはかかとの高さを表す言葉であって、今履いているようなデザインの靴はパンプスって言います」]])\r\n\r\nPLAY_VOICE(\"akira_1202.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Be careful not to accidentally get that wrong at school or they’ll treat you like you’re clueless.\"\r\n「学園でうっかり間違えたら無知扱いされるから注意ですよ？」]])\r\n\r\nPLAY_VOICE(\"erika_2451.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Pumps, huh. I see...\"\r\n「パンプスって言うんだ。へー……」]])\r\n\r\nPLAY_VOICE(\"akira_1203.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"The high heels you pictured were probably those shaped like a boat’s canoe, right?\"\r\n「ミナちんが想像してたハイヒールって、どうせ船のカヌーみたいな形のでしょう？」]])\r\n\r\nPLAY_VOICE(\"erika_2452.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Gulp.\"\r\n「ぎくっ」]])\r\n\r\n    MSG([[Got me. I mean, the shoes mom called \"heels\" were all designs like the ones I’m wearing now...\r\n図星だった。\r\n    　だ、だって、母さんが「ヒール」って呼んでいた靴は、皆ボクが今履いているようなデザインだったし……。]])\r\n\r\n    MSG([[What exactly are pumps anyway? I’ve heard the word but don’t really understand it.\r\nそもそもパンプスって何なんだろう。\r\n    　聞いたことはあるけど、よくわからない。]])\r\n\r\nPLAY_VOICE(\"akira_1204.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"I can see you have no clue at all. Let me explain a bit more clearly.\"\r\n「全然わかってないことはよくわかりました。もう少しだけ詳しく説明します」]])\r\n\r\nPLAY_VOICE(\"erika_2453.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Sorry... thank you.\"\r\n「ごめんなさい……ありがとう」]])\r\n\r\nPLAY_VOICE(\"akira_1205.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Simply put, pumps are shoes with a large opening over the instep, covering toes and heels entirely.\"\r\n「ざっくり説明すると、足の甲の部分が大きく開いてて、つま先とかかかとまでカバーされたデザインの靴を総じてパンプスって言います」]])\r\n\r\nPLAY_VOICE(\"akira_1206.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"They have no laces, so you can slip them on immediately. Because they fit the foot’s shape, they make your feet look slim and beautiful.\"\r\n「靴紐などはなく、そのまま足を入れればすぐに履けるのも特徴ですね。足の形にフィットしている分、足を細くキレイに見せてくれます」]])\r\n\r\nPLAY_VOICE(\"akira_1207.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Since your legs are even slenderer than most girls’, they’re a perfect match. You should practice now.\"\r\n「ミナちんは女性以上に足がすらりとしているので相性バッチリのはずです。今のうちに練習しておきましょう」]])\r\n\r\nPLAY_VOICE(\"erika_2454.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"U-uggh, my feet are shaky... I’m so uneasy I couldn’t properly use arrest techniques...\"\r\n「う、うううっ、足元がフラついて……これじゃあ逮捕術も上手くできそうになくて、不安だよ……」]])\r\n\r\nPLAY_VOICE(\"akira_1208.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Hold on. Every girl has to go through the phase of getting used to this instability.\"\r\n「こらえてください。女の子は誰しも、この不安定さに慣れようとがんばる時期があるんです」]])\r\n\r\nPLAY_VOICE(\"akira_1209.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Making unseen efforts for fashion... You have to put yourself in the shoes of those earnest girls.\"\r\n「ファッションのために見えない努力を続ける……そんないたいけな女子の気持ちになりきるのですよ」]])\r\n\r\nPLAY_VOICE(\"akira_1210.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"By the way, we’re going to the convenience store like that now.\"\r\n「ちなみに、今日は今からその恰好でコンビニに行きます」]])\r\n\r\nPLAY_VOICE(\"erika_2455.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Eeeeeeh!?\"\r\n「ええええええええっ！？」]])\r\n\r\n    -- //CG：ミニスカートを穿かされるエリカ（テンパり）\r\n    LAYER_LOAD(LAYER_BG, \"EV045ae\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    MSG([[She said something terrifying so casually. Going out like this with shaky feet and the risk of underwear showing off is hell...\r\nさらっと恐ろしいことを言われた。\r\n    　こんな足元がおぼつかず、いつ下着が見えてしまうかもわからない状態で外出なんて、地獄過ぎる……。]])\r\n\r\nPLAY_VOICE(\"erika_2456.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"No way! No no no! I’m embarrassed, but if my underwear shows, they’ll catch me as a pervert!\"\r\n「無理だよ！　無理無理無理！　恥ずかしいのもあるけど、下着が見えちゃったら変質者として捕まっちゃうよ！」]])\r\n\r\nPLAY_VOICE(\"akira_1211.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"There it is. Mina-chin’s ‘No way’ disease. No one reports a guy just because they saw a girl’s panties. Even if they’re crappy boxers.\"\r\n「出ましたね。ミナちんの無理無理病が。女の子のパンツを見て通報する男なんていませんよ。それがたとえ、クソザコトランクスでもね」]])\r\n\r\nPLAY_VOICE(\"erika_2457.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"But I’m a boy...\"\r\n「ボク男の子なんだけど…」]])\r\n\r\nPLAY_VOICE(\"akira_1212.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"I’m saying that because you don’t look like a boy at all.\"\r\n「女の子にしか見えないから言ってるんですけど」]])\r\n\r\nPLAY_VOICE(\"akira_1213.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"We’ve gone over this exchange so many times you should know: no matter how much you struggle, you’ll end up complying. Just accept it.\"\r\n「この手のやり取り、もう何度も繰り返してるからわかるでしょう？ どう足掻いても最後は従う流れですよ、これ。あきらめてください」]])\r\n\r\nPLAY_VOICE(\"erika_2458.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"So ruthless!\"\r\n「無慈悲ー！」]])\r\n\r\n    MSG([[Yeah, honestly, there’s nothing I can do. I’m prepared that eventually I’ll cross-dress as Akira says.\r\nうん、正直どうにもならないのは知ってる。\r\n    　最終的にはアキラの言うとおりに女装することになるだろうって覚悟もできている。]])\r\n\r\n    MSG([[Still—I feel I have to resist.\r\nそれでも――ボクは抵抗をしなければならないと思った。]])\r\n\r\nPLAY_VOICE(\"erika_2459.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"What’s important is the will to resist cross-dressing. As long as you have that will, even if you dress up now, you should be able to resist one day, right?\"\r\n「大切なのは、女装に抗おうとする意志だと思うんだ。抗おうとする意志さえあれば、たとえ今回は女装したとしても、いつかは抗えるはずでしょう？」]])\r\n\r\nPLAY_VOICE(\"erika_2460.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Because I want to be manly... isn’t that right?\"\r\n「男らしくなりたいと思っているワケだからさ…………違うかい？」]])\r\n\r\nPLAY_VOICE(\"akira_1214.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Stop saying stuff like a colleague of Abbacchio and get ready. I want to buy and eat chocolate mint ice cream soon.\"\r\n「そんなアバッキオの同僚みたいなこと言ってないで準備してください。私、早くチョコミントアイスを買って食べたいんですよ」]])\r\n\r\nPLAY_VOICE(\"erika_2461.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"So ruthless!\"\r\n「無慈悲ー！」]])\r\n\r\n    MSG([[Short skirt, unstable footing. Can I bear those double shames and still go shopping?\r\n短いスカートに不安定な足元。\r\n    　二重の羞恥に耐えながら買い物なんて、ボクにできるだろうか。]])\r\n\r\nPLAY_VOICE(\"erika_2462.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"(But it’s true that I need to remember the feeling of wearing fashion popular with girls, or I’ll eventually stand out.)\"\r\n（でも確かに、女の子に人気のファッションを着る感覚は覚えておかないと、いつか怪しまれちゃう）]])\r\n\r\nPLAY_VOICE(\"erika_2463.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"(It’s something I have to experience someday!)\"\r\n（いつかは経験しないといけないことなんだ！）]])\r\n\r\nPLAY_VOICE(\"erika_2464.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"I-I’ll do it. Whether it’s chocolate mint or cioccolata ice cream, I’ll buy it properly and show you!\"\r\n「や、やるよ。チョコミントアイスでも、チョコラータアイスでも、ちゃんと買ってきてみせる！」]])\r\n\r\n    MSG([[Hearing my resolve, Akira happily grabbed my hand.\r\nボクの決意を聞いてアキラが嬉しそうに手を握った。]])\r\n\r\nPLAY_VOICE(\"akira_1215.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Yay! Let’s go quickly then. I get nervous going to the convenience store at night alone; the clerks tend to be quite eccentric.\"\r\n「やったー。じゃあ早く行きましょう。夜のコンビニって一人じゃ不安なんですよね、店員さんの癖が強くて」]])\r\n\r\nPLAY_VOICE(\"erika_2465.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Wait! If you pull my hand now—\"\r\n「あっ待って！　今手を引っ張られたら――」]])\r\n\r\nPLAY_VOICE(\"akira_1216.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Ah—\"\r\n「あ――」]])\r\n\r\n    -- //SE：転ぶ\r\nPLAY_SE(\"SEc034.wav\")\r\n\r\n    -- //CI：転ぶ雑エリカ 082\r\n    LAYER_LOAD(50,\"CI082a\")\r\n    LAYER_POSITION(50,-200,0)\r\n    LAYER_MOVE_POSITION(50,0,0,500,Ease.OutSine)\r\n    SWITCH_SCREEN(\"mask000\",500,false)\r\n\r\n    LAYER_EFFECT(50,6,40,40,500,false)\r\n\r\nPLAY_VOICE(\"erika_2466.wav\")\r\n    MSG([[\r\n【Erika】\r\n \"Kyaa!\"\r\n「きゃうっ！」]])\r\n\r\nPLAY_VOICE(\"akira_1217.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"...Sorry.\"\r\n「……ごめんなさい」]])\r\n\r\n    MSG([[No matter how determined I am, my body still needs a lot more time to catch up.\r\nいくら決意を固めたところで、身体がついてくるのはまだまだ時間がかかりそうだ。]])\r\n\r\n    MSG([[I was literally feeling the pain of how difficult girl’s fashion really is.\r\n女の子のファッションの難しさを、ボクは文字通り“痛”感するのであった。]])\r\n\r\n    -- Visual パラメーター更新\r\n    SaveData.TrainingParam.Visual = 2\r\n\r\n    -- 1\tぼくのへんたい\t『ビジュアル』レベルを１以上にした\r\n    UNLOCK_TROPHY(1)\r\n    -- 4\t天使の裾を踏まないでっ\t『ビジュアル』レベルを２以上にした\r\n    UNLOCK_TROPHY(4)\r\n    if SaveData.TrainingParam.Visual >= 2 and SaveData.TrainingParam.Intelligence >= 2 and SaveData.TrainingParam.Mental >= 2 then\r\n        -- 7\tドンストップ！エリカくん\tすべてのステータスのレベルを２以上にした\r\n        UNLOCK_TROPHY(7)\r\n    end\r\n\r\n\r\n    -- 　　　　　　◆\r\nLAYER_LOAD(50,\"\")\r\nSTOP_BGM(1000)\r\nLAYER_LOAD(LAYER_BG, \"\")\r\nSWITCH_SCREEN(\"mask000\" , 1000,false)\r\nWAIT_INPUT(1000)\r\n\r\n    TrainingStatusUp(\"Visual\" , 2)\r\n\r\n    ScenarioManager.TrainingNext()\r\nend\r\n"
}