{
  "m_GameObject": {
    "m_FileID": 0,
    "m_PathID": 0
  },
  "m_Enabled": 1,
  "m_Script": {
    "m_FileID": 0,
    "m_PathID": -1707786903170945384
  },
  "m_Name": "Visual_LV1",
  "Path": "Assets/AddressableAssets/Lua/Scenario/Training/Visual_LV1.lua",
  "Text": "function Visual_LV1()\r\n    -- ※以下、①を選択した場合\r\n    -- .女装稽古【ビジュアル】LV.1「ガールズファッション講座-入門編-」\r\n\r\n    -- //黒バック\r\n    LAYER_LOAD(LAYER_BG, \"BG000aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_VOICE(\"akira_1171.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Alright, Minachin, first try putting on this outfit.\"\r\n「ではミナちん、まずはこの服を着てみてください」]])\r\n\r\nPLAY_VOICE(\"minato_1438.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Ehh!? This is...\"\r\n「ええー！？　これってえ……」]])\r\n\r\nPLAY_BGM(\"BGM11.wav\",1000,true)\r\n\r\n    -- //CG：お着替えエリカ\r\n    -- 　　※衣装はオフショルダータイプのワンピース。\r\n    LAYER_LOAD(LAYER_BG, \"EV045aa\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    MSG([[My reflection in the mirror showed me wearing a pure white dress.\r\n鏡に純白のワンピースを着た自分の姿が映し出された。]])\r\n\r\n    MSG([[It was much more revealing than the uniform, my shoulders and chest feeling chilly. From my perspective, with my broader shoulders, it was obvious I looked like a guy.\r\n制服よりもずっと露出が多く、肩や胸元が肌寒い。 ボク自身からすると、女性よりも肩幅が広いので男性と丸わかりに感じた。]])\r\n\r\n    MSG([[But Akira’s reaction was different.\r\nしかしアキラの反応は違った。]])\r\n\r\nPLAY_VOICE(\"akira_1172.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Yeah, yeah. It suits you well. You look cute, like a girl who’s put effort into her first date.\"\r\n「うんうん。よく似合ってますね。初めてのデートで気合を入れてきた女の子みたいでカワイイですよ」]])\r\n\r\nPLAY_VOICE(\"minato_1439.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"W-Where does it suit me...? My build clearly looks weird.\"\r\n「ど、どこが似合ってるの……？　明らかに体つきがおかしいじゃない」]])\r\n\r\nPLAY_VOICE(\"akira_1173.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"No, no. Minachin’s body doesn’t tend to bulk up muscles, so it’s totally fine. What you’re saying right now is going to make all girls worried about having a gorilla build your enemy, you know?\"\r\n「いやいや。ミナちんは筋肉が太くなりにくい体質ですし、全然大丈夫ですってば。ミナちんの発言はゴリラ体型に悩む女たちを敵に回しますよ？」]])\r\n\r\nPLAY_VOICE(\"akira_1174.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"The chest pads feel comfortable too, right? I even adjusted the color a bit to match your skin tone, and if the dress slips down, it should at least fool people a little.\"\r\n「胸パッドの付け心地も悪くないでしょう？　ミナちんの肌の色に合わせて少し色味も調整しましたし、万が一服がズリ落ちても少しは誤魔化せるはずです」]])\r\n\r\nPLAY_VOICE(\"minato_1440.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"I-I really hope that kind of 'if' never happens.\"\r\n「そ、そんな万が一は起きないことを祈りたいんだけど」]])\r\n\r\n    MSG([[Wearing a one-piece that connects top and bottom is new to me, making my heart race. I started sweating nervously, and the skirt clinging to my legs felt uncomfortable.\r\n上下が繋がった服なんて初めてでドキドキしてしまう。 何だか緊張で汗がどんどん滲んできて、スカートが足にまとわりついて気持ちが悪い。]])\r\n\r\n    -- //CG：お着替えエリカ（透け）\r\n    LAYER_LOAD(LAYER_BG, \"EV045ab\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\n    MSG([[Ah, the sweat made the silhouette of my trunks underneath start to show through! Even if I’m at home, it’s so embarrassing I could die!\r\nあ、汗に濡れたことで、その下のトランクスのシルエットまで透け始めてる！\r\n    　いくら家の中だからとは言え、恥ずかしくて死にそう！]])\r\n\r\nPLAY_VOICE(\"akira_1175.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"How is it? It feels totally different from the uniforms and casual clothes you've worn so far, right?\"\r\n「どうです？　これまで着てきた制服や私服とは、また全然着心地が違うでしょう？」]])\r\n\r\nPLAY_VOICE(\"minato_1441.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Y-Yeah... I guess everyday clothes feel way more comfortable.\"\r\n「う、うん……そうだね、普段の服の方が何倍も気が楽かな」]])\r\n\r\nPLAY_VOICE(\"minato_1442.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"The sweat’s making it really see-through... D-Don’t girls find that embarrassing...?\"\r\n「汗かいたせいでスゴく透けてるんだけど……お、女の子たちは恥ずかしくないの…？」]])\r\n\r\nPLAY_VOICE(\"akira_1176.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Nah, that’s not the case at all.\"\r\n「いやーそんなワケないじゃないですか」]])\r\n\r\n    MSG([[Akira took out a thin piece of underwear from the costume case, similar to the dress.\r\nアキラは衣装ケースからワンピースによく似た、薄手の下着を取り出した。]])\r\n\r\nPLAY_VOICE(\"akira_1177.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"It’s common to wear underwear or innerwear under dresses like this. Right now, Minachin is a full-fledged provocateur; if you go out, all the guys' gazes will be on you.\"\r\n「こういった下着やインナーの上から着るのが一般的ですよ。今のミナちんは立派な痴女です、街に出れば男たちの視線を独り占めですね」]])\r\n\r\nPLAY_VOICE(\"minato_1443.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Y-You should’ve said that earlier!\"\r\n「さ、先に言ってよー！」]])\r\n\r\nPLAY_VOICE(\"akira_1178.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Oh? If I said it earlier, you’d have worn this slip?\"\r\n「おっ、先に言えばこのスリップ、着てくれたんです？」]])\r\n\r\nPLAY_VOICE(\"akira_1179.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Good to hear that. Since only Minachin fiercely defends wearing men's underwear, it makes sense to start getting used to slips and camisoles first.\"\r\n「それはよいことを聞きました。パンツだけは男モノを死守するミナちんですから、スリップやキャミあたりから慣れていくのはありですよね」]])\r\n\r\nPLAY_VOICE(\"akira_1180.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"The day has finally come to put to good use all the underwear Mom has been randomly buying.\"\r\n「ママがやたらめったら買ってくる下着を、有効活用できる日が遂に来ました」]])\r\n\r\n    MSG([[N-No good. I think I’ve dug myself a big hole... I’m not brave enough to wear girls’ underwear yet. I’ve got to change the subject and avoid being made to wear underwear!\r\nま、マズい。盛大に墓穴を掘ってしまったかも……。 まだ女の子の下着を着る勇気はない。 何とか話題を変えて、下着を着させられることだけは避けないと！]])\r\n\r\nPLAY_VOICE(\"minato_1444.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"E-Even so, unlike men’s clothes, you have to think about underwear too. Being a girl is tough.\"\r\n「そ、それにしてもぉ、男の服と違って下着選びから考えないといけなかったり、女の子って大変なんだね」]])\r\n\r\nPLAY_VOICE(\"akira_1181.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Minachin, you get it.\"\r\n「ミナちん、わかってくれましたか」]])\r\n\r\n    MSG([[Yes! She’s into it. I’ll keep diverting the topic this way.\r\nやった、食いついた。\r\n    　このまま話題を逸らしてしまおう。]])\r\n\r\nPLAY_VOICE(\"minato_1445.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"I don’t know much about fashion, so this is educational. Akira, have you ever studied fashion?\"\r\n「ファッションのことは全然だから、勉強になるよ。アキラはファッションの勉強をしていたことがあるの？」]])\r\n\r\nPLAY_VOICE(\"akira_1182.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"I like reading fashion magazines.\"\r\n「ファッション誌は好きで読んでます」]])\r\n\r\nPLAY_VOICE(\"akira_1183.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Well, it’s one of those things where you want what you can’t have. I’m short, hunched, and have this dull face, right? Watching girls wear glamorous clothes I can’t wear is actually fun.\"\r\n「ま、ないものねだりって奴ですね。私はチビで猫背でこんなへちゃむくれ顔でしょう？　自分が着れない華やかな服を着る女の子を観るのはやっぱり楽しいです」]])\r\n\r\n    MSG([[I almost said, \"I think Akira would suit them too\" but stopped.\r\n「アキラも似合うと思うけれど」と言いかけてやめた。]])\r\n\r\n    MSG([[I know well that her self-deprecation isn’t something she wants to be contradicted about.\r\n彼女の自虐は否定して欲しくて口から出るワケではないことを、ボクはよく知っている。]])\r\n\r\nPLAY_VOICE(\"minato_1446.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Becoming a fashion expert like Lira-san seems like it will take a lot of time...\"\r\n「リラさんみたいなファッションの達人になるのは、スゴく時間がかかりそうだねえ……」]])\r\n\r\nPLAY_VOICE(\"akira_1184.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Yeah. But at least you probably won’t want to wear one-piece or thin clothes straight on bare skin anymore, right? That’s progress.\"\r\n「ええ。ですが少なくとも、もう素肌の上からワンピースや薄手の服を着ようとは思わないでしょう？　一歩前進ですよ」]])\r\n\r\nPLAY_VOICE(\"akira_1185.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Seeing is believing. <r=ひゃっけん>Seeing</r> is experiencing. First, you should thoroughly experience representative girls’ fashion.\"\r\n「百聞は一見に如かず。<r=ひゃっけん>百見</r>は体験に如かず。まずは代表的なガールズファッションを徹底的に体験すべきでしょう」]])\r\n\r\nPLAY_VOICE(\"minato_1447.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Oh, I’m drifting further away from being a man’s man...\"\r\n「お、男の中の男からどんどん遠ざかっていく……」]])\r\n\r\nPLAY_VOICE(\"akira_1186.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"What are you saying? A certain internet user left a great saying: ‘Cross-dressing can only be done by men, so it’s the manliest act there is.’\"\r\n「何を言うんですか。とあるネット民はこんな名言を残しました。 『女装は男しかできないのだから、最高に男らしい行為なのだ』と」]])\r\n\r\nPLAY_VOICE(\"akira_1187.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"So make up your mind and dedicate yourself to cross-dressing.\"\r\n「覚悟を決めて女装に励みましょうね」]])\r\n\r\n    MSG([[Akira smiled cheerfully. I’m sure she genuinely wants to help me—this is a training she thoughtfully put together in her own way.\r\nにっこりと愉しげに微笑むアキラ。\r\n    　きっと、ボクを手助けしたいという気持ちは本当で、彼女なりに一生懸命考えてくれたトレーニングなんだ。]])\r\n\r\n    MSG([[Then, I have to respond with everything I’ve got!\r\nなら、ボクも精いっぱい応えないと！]])\r\n\r\n    -- //CG：お着替えエリカ（透け・気合）\r\n    LAYER_LOAD(LAYER_BG, \"EV045ac\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_VOICE(\"minato_1448.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"Alright! I’ll work hard to master girls’ fashion by the election with Lira-san!\"\r\n「よーし！　リラさんとの選挙までに、ガールズファッションを制覇する気持ちでがんばるよ！」]])\r\n\r\nPLAY_VOICE(\"akira_1188.wav\")\r\n    MSG([[\r\n【Akira】\r\n \"Hehe, that’s the spirit. Now next, this sexy sheer underwear...\"\r\n「ふふ、その意気です。では、次はこのセクシーなスケスケ下着を…」]])\r\n\r\n    -- //CG：お着替えエリカ（透け）\r\n    LAYER_LOAD(LAYER_BG, \"EV045ab\")\r\n    SWITCH_SCREEN(\"mask000\" , 1000,false)\r\n\r\nPLAY_VOICE(\"minato_1449.wav\")\r\n    MSG([[\r\n【Minato】\r\n \"N-No way, not yet~~~~!!!\"\r\n「そそそそれはまだ無理～～～～～～！！！」]])\r\n\r\n    MSG([[The road to mastering cross-dressing is still very long...\r\n女装の上達までの道のりはまだまだ長い……。]])\r\n\r\n    -- Visual パラメーター更新\r\n    SaveData.TrainingParam.Visual = 1\r\n    \r\n    -- 1\tぼくのへんたい\t『ビジュアル』レベルを１以上にした\r\n    UNLOCK_TROPHY(1)\r\n\r\n    -- 　　　　　◆\r\nSTOP_BGM(1000)\r\nLAYER_LOAD(LAYER_BG, \"\")\r\nSWITCH_SCREEN(\"mask000\" , 1000,false)\r\nWAIT_INPUT(1000)\r\n\r\n    TrainingStatusUp(\"Visual\" , 1)\r\n\r\n    ScenarioManager.TrainingNext()\r\nend\r\n"
}